ruby/I.org
* [[https://wordsinasentence.com/igneous-in-a-sentence/][Igneous]]

  =solidified from lava or magma=

  - After the volcano erupted and lava covered the ground, many igneous rocks were created.
  - Igneous rocks such as basalt are the after product of a volcanic eruption.
  - Although all igneous rocks originally stem from volcanic lava, many morph into other types of rocks overtime.
  - Some igneous rocks are formed from magma that cools and solidifies within the crust of the earth.

