ruby/I.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-06-19 Tue 23:26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>I</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/solarized-light/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">I</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge02c9c9">1. Igneous</a></li>
<li><a href="#orgfa5b57a">2. Ignoble</a></li>
<li><a href="#org81b7225">3. Ignominious</a></li>
<li><a href="#org6cd50ca">4. Ignominy</a></li>
<li><a href="#org8fd2904">5. Imbue</a></li>
<li><a href="#org5d01279">6. Imitate</a></li>
<li><a href="#orgadfbe80">7. Immaculate</a></li>
<li><a href="#org02b19f6">8. Imminent</a></li>
<li><a href="#org73dc4ed">9. Impair</a></li>
<li><a href="#org13a4c72">10. Impart</a></li>
<li><a href="#orgf515440">11. Impartial</a></li>
<li><a href="#org9077818">12. Impassive</a></li>
<li><a href="#org8317e65">13. Impeccable</a></li>
<li><a href="#orgc4ae6d4">14. Impecunious</a></li>
<li><a href="#org29eb10c">15. Impede</a></li>
<li><a href="#org0bf6fa3">16. Impediment</a></li>
<li><a href="#org4aaf10e">17. Impending</a></li>
<li><a href="#org9688af0">18. Imperative</a></li>
<li><a href="#org210eeb6">19. Imperious</a></li>
<li><a href="#org9266a4b">20. Impermanence</a></li>
<li><a href="#org46fa566">21. Impersonal</a></li>
<li><a href="#orgf6d05e4">22. Impersonate</a></li>
<li><a href="#orgae95aa2">23. Impertinent</a></li>
<li><a href="#org520fea9">24. Imperturbable</a></li>
<li><a href="#orga294209">25. Impervious</a></li>
<li><a href="#org7dbb040">26. Impetuous</a></li>
<li><a href="#orgb5448e8">27. Impiety</a></li>
<li><a href="#orgcc2fd45">28. Impolitic</a></li>
<li><a href="#org4559d6a">29. Imponderable</a></li>
<li><a href="#org855b0a6">30. Imposter</a></li>
<li><a href="#orgfcd6805">31. Imposture</a></li>
<li><a href="#org4c03726">32. Impound</a></li>
<li><a href="#org0823074">33. Impressionable</a></li>
<li><a href="#orgbbbc80b">34. Impromptu</a></li>
<li><a href="#orgcfbf8fc">35. Impropriety</a></li>
<li><a href="#org40f84cf">36. Improvident</a></li>
<li><a href="#org00f6190">37. Improvise</a></li>
<li><a href="#orgd3b3972">38. Imprudent</a></li>
<li><a href="#org2aa8c21">39. Impudent</a></li>
<li><a href="#orge5f593b">40. Impugn</a></li>
<li><a href="#org0201892">41. Impunity</a></li>
<li><a href="#org2fc5454">42. Impute</a></li>
<li><a href="#org05070a6">43. Inadvertent</a></li>
<li><a href="#org5a87b9e">44. Inane</a></li>
<li><a href="#orgafe880b">45. Incandescent</a></li>
<li><a href="#orgac5fb13">46. Incendiary</a></li>
<li><a href="#org2eaace9">47. Incessant</a></li>
<li><a href="#org2aebb2d">48. Incident</a></li>
<li><a href="#org4adc692">49. Incidence</a></li>
<li><a href="#org326213c">50. Incoherent</a></li>
<li><a href="#org5ef1531">51. Inconsequential</a></li>
<li><a href="#org036491b">52. Inconsolable</a></li>
<li><a href="#orga123515">53. Incorporate</a></li>
<li><a href="#org31789d1">54. Incorrigible</a></li>
<li><a href="#orgaeff09c">55. Incumbent</a></li>
<li><a href="#orgb3a3ec1">56. Indefatigable</a></li>
<li><a href="#org5b5a6c4">57. Indenture</a></li>
<li><a href="#orgc290f20">58. Indigenous</a></li>
<li><a href="#org0856fe4">59. Indigent</a></li>
<li><a href="#org28080b1">60. Inept</a></li>
<li><a href="#orgb773799">61. Ineptitude</a></li>
<li><a href="#org9aab26f">62. Inexorable</a></li>
<li><a href="#org148839e">63. Infantile</a></li>
<li><a href="#org5de683e">64. Infuse</a></li>
<li><a href="#org346f856">65. Ingenuity</a></li>
<li><a href="#orgc4c90e5">66. Ingenuous</a></li>
<li><a href="#org51ba226">67. Ingest</a></li>
<li><a href="#org89a25e0">68. Ingrained</a></li>
<li><a href="#org07e1d88">69. Ingrate</a></li>
<li><a href="#org3e19c22">70. Ingratiate</a></li>
<li><a href="#org0b6d2b5">71. Inimitable</a></li>
<li><a href="#org6d4b7c6">72. Injurious</a></li>
<li><a href="#org17033f5">73. Innate</a></li>
<li><a href="#orgd4d54e9">74. Insatiable</a></li>
<li><a href="#org99dd18f">75. Insidious</a></li>
<li><a href="#orgb85e6ba">76. Insinuate</a></li>
<li><a href="#org8b9ae38">77. Insipid</a></li>
<li><a href="#org5866f32">78. Insolent</a></li>
<li><a href="#org64b3871">79. Instigate</a></li>
<li><a href="#orgd7c626d">80. Insular</a></li>
<li><a href="#org810767f">81. Intemperate</a></li>
<li><a href="#org1eecc8e">82. Interpolate</a></li>
<li><a href="#org5d9998b">83. Intimate</a></li>
<li><a href="#org4f57bc1">84. Intimation</a></li>
<li><a href="#org28094bd">85. Intimidate</a></li>
<li><a href="#orga098022">86. Intransigent</a></li>
<li><a href="#org8a202cf">87. Intrepid</a></li>
<li><a href="#org577db1e">88. Introspective</a></li>
<li><a href="#org1895385">89. Inure</a></li>
<li><a href="#orgdc7d4d6">90. Involuntary</a></li>
<li><a href="#org7d9f590">91. Irascible</a></li>
<li><a href="#orgc828c23">92. Irate</a></li>
<li><a href="#org55c1fd2">93. Iridescent</a></li>
<li><a href="#org79ed547">94. Irresolute</a></li>
<li><a href="#org2441669">95. Irreverent</a></li>
<li><a href="#orgef912a2">96. Itinerant</a></li>
<li><a href="#orge308a14">97. Illustrious</a></li>
<li><a href="#org7de188c">98. Imbecile</a></li>
<li><a href="#orgc25ae99">99. Imbibe</a></li>
<li><a href="#org590d991">100. Imbroglio</a></li>
<li><a href="#orgdd57f58">101. Immensity</a></li>
<li><a href="#org9d6332f">102. Immolation</a></li>
<li><a href="#org755b731">103. Immure</a></li>
<li><a href="#org5f92c32">104. Impale</a></li>
<li><a href="#org274a57f">105. Impasse</a></li>
<li><a href="#org3ac4282">106. Impeach</a></li>
<li><a href="#orgea8df25">107. Impel</a></li>
<li><a href="#org37ee2e5">108. Impenitent</a></li>
<li><a href="#orgc2f346d">109. Imperil</a></li>
<li><a href="#orgf9e218e">110. Impetus</a></li>
<li><a href="#org4c0ffc4">111. Impinge</a></li>
<li><a href="#org1f7621f">112. Implant</a></li>
<li><a href="#org32d3ac5">113. Implicate</a></li>
<li><a href="#org7fe0ab9">114. Implode</a></li>
<li><a href="#orgf4e0acf">115. Implored</a></li>
<li><a href="#orgdd0ed40">116. Importune</a></li>
<li><a href="#org5d0556b">117. Imprecation</a></li>
<li><a href="#org707b6b0">118. Imprint</a></li>
<li><a href="#orgcf21693">119. Incarcerate</a></li>
<li><a href="#org194c439">120. Incinerate</a></li>
<li><a href="#org18d7b21">121. Incite</a></li>
<li><a href="#orgde2c5f2">122. Inclement</a></li>
<li><a href="#org7decf6f">123. Incriminate</a></li>
<li><a href="#orga9edb0a">124. Incubus</a></li>
<li><a href="#org880357f">125. Inculcate</a></li>
<li><a href="#orgdc4bee3">126. Inculpate</a></li>
<li><a href="#org3210bc9">127. Incur</a></li>
<li><a href="#org5328151">128. Indemnify</a></li>
<li><a href="#org9e8f944">129. Indignant</a></li>
<li><a href="#orgf3f907b">130. Indignity</a></li>
<li><a href="#orgc9d2c10">131. Induction</a></li>
<li><a href="#org2d90fbe">132. Inebriated</a></li>
<li><a href="#org533b47b">133. Ineluctable</a></li>
<li><a href="#org2e83a52">134. Inexpedient</a></li>
<li><a href="#org16ccee1">135. Infatuated</a></li>
<li><a href="#orgc233c23">136. Infelicitous</a></li>
<li><a href="#orgc25f143">137. Influx</a></li>
<li><a href="#org8e95787">138. Infraction</a></li>
<li><a href="#org378a7a4">139. Infringe</a></li>
<li><a href="#orgf8be2d7">140. Ingress</a></li>
<li><a href="#org4b2b870">141. Iniquity</a></li>
<li><a href="#org9383c73">142. Inkling</a></li>
<li><a href="#org162e219">143. Innuendo</a></li>
<li><a href="#org2bceac3">144. Inscribe</a></li>
<li><a href="#org24d6468">145. Inscrutable</a></li>
<li><a href="#org0eb99dc">146. Insignia</a></li>
<li><a href="#orgf432277">147. Insouciant</a></li>
<li><a href="#orgc336320">148. Instill</a></li>
<li><a href="#org8d43289">149. Insuperable</a></li>
<li><a href="#org817f494">150. Insurrection</a></li>
<li><a href="#org92c89df">151. Intercede</a></li>
<li><a href="#org8aede69">152. Interloper</a></li>
<li><a href="#orgdb19a20">153. Interlude</a></li>
<li><a href="#orga1dd819">154. Intermission</a></li>
<li><a href="#org7f308ec">155. Intermittent</a></li>
<li><a href="#org9a3e0e4">156. Interpose</a></li>
<li><a href="#org45e8836">157. Interrogate</a></li>
<li><a href="#org9b6c3dd">158. Inundate</a></li>
<li><a href="#org561e8b7">159. Invective</a></li>
<li><a href="#orgaea054b">160. Inveigh</a></li>
<li><a href="#orgecd0165">161. Inveigle</a></li>
<li><a href="#orgd63847c">162. Inveterate</a></li>
<li><a href="#orgdcc6942">163. Invidious</a></li>
<li><a href="#orgb6e7bf0">164. Invoke</a></li>
<li><a href="#org7eff85c">165. Iota</a></li>
<li><a href="#orgdd14034">166. Ire</a></li>
<li><a href="#orgf68d44d">167. Irk</a></li>
<li><a href="#org7bb8cb9">168. Irksome</a></li>
<li><a href="#orgfa48101">169. Irremediable</a></li>
<li><a href="#org74c87aa">170. Itinerary</a></li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge02c9c9">1. Igneous</a></li>
<li><a href="#orgfa5b57a">2. Ignoble</a></li>
<li><a href="#org81b7225">3. Ignominious</a></li>
<li><a href="#org6cd50ca">4. Ignominy</a></li>
<li><a href="#org8fd2904">5. Imbue</a></li>
<li><a href="#org5d01279">6. Imitate</a></li>
<li><a href="#orgadfbe80">7. Immaculate</a></li>
<li><a href="#org02b19f6">8. Imminent</a></li>
<li><a href="#org73dc4ed">9. Impair</a></li>
<li><a href="#org13a4c72">10. Impart</a></li>
<li><a href="#orgf515440">11. Impartial</a></li>
<li><a href="#org9077818">12. Impassive</a></li>
<li><a href="#org8317e65">13. Impeccable</a></li>
<li><a href="#orgc4ae6d4">14. Impecunious</a></li>
<li><a href="#org29eb10c">15. Impede</a></li>
<li><a href="#org0bf6fa3">16. Impediment</a></li>
<li><a href="#org4aaf10e">17. Impending</a></li>
<li><a href="#org9688af0">18. Imperative</a></li>
<li><a href="#org210eeb6">19. Imperious</a></li>
<li><a href="#org9266a4b">20. Impermanence</a></li>
<li><a href="#org46fa566">21. Impersonal</a></li>
<li><a href="#orgf6d05e4">22. Impersonate</a></li>
<li><a href="#orgae95aa2">23. Impertinent</a></li>
<li><a href="#org520fea9">24. Imperturbable</a></li>
<li><a href="#orga294209">25. Impervious</a></li>
<li><a href="#org7dbb040">26. Impetuous</a></li>
<li><a href="#orgb5448e8">27. Impiety</a></li>
<li><a href="#orgcc2fd45">28. Impolitic</a></li>
<li><a href="#org4559d6a">29. Imponderable</a></li>
<li><a href="#org855b0a6">30. Imposter</a></li>
<li><a href="#orgfcd6805">31. Imposture</a></li>
<li><a href="#org4c03726">32. Impound</a></li>
<li><a href="#org0823074">33. Impressionable</a></li>
<li><a href="#orgbbbc80b">34. Impromptu</a></li>
<li><a href="#orgcfbf8fc">35. Impropriety</a></li>
<li><a href="#org40f84cf">36. Improvident</a></li>
<li><a href="#org00f6190">37. Improvise</a></li>
<li><a href="#orgd3b3972">38. Imprudent</a></li>
<li><a href="#org2aa8c21">39. Impudent</a></li>
<li><a href="#orge5f593b">40. Impugn</a></li>
<li><a href="#org0201892">41. Impunity</a></li>
<li><a href="#org2fc5454">42. Impute</a></li>
<li><a href="#org05070a6">43. Inadvertent</a></li>
<li><a href="#org5a87b9e">44. Inane</a></li>
<li><a href="#orgafe880b">45. Incandescent</a></li>
<li><a href="#orgac5fb13">46. Incendiary</a></li>
<li><a href="#org2eaace9">47. Incessant</a></li>
<li><a href="#org2aebb2d">48. Incident</a></li>
<li><a href="#org4adc692">49. Incidence</a></li>
<li><a href="#org326213c">50. Incoherent</a></li>
<li><a href="#org5ef1531">51. Inconsequential</a></li>
<li><a href="#org036491b">52. Inconsolable</a></li>
<li><a href="#orga123515">53. Incorporate</a></li>
<li><a href="#org31789d1">54. Incorrigible</a></li>
<li><a href="#orgaeff09c">55. Incumbent</a></li>
<li><a href="#orgb3a3ec1">56. Indefatigable</a></li>
<li><a href="#org5b5a6c4">57. Indenture</a></li>
<li><a href="#orgc290f20">58. Indigenous</a></li>
<li><a href="#org0856fe4">59. Indigent</a></li>
<li><a href="#org28080b1">60. Inept</a></li>
<li><a href="#orgb773799">61. Ineptitude</a></li>
<li><a href="#org9aab26f">62. Inexorable</a></li>
<li><a href="#org148839e">63. Infantile</a></li>
<li><a href="#org5de683e">64. Infuse</a></li>
<li><a href="#org346f856">65. Ingenuity</a></li>
<li><a href="#orgc4c90e5">66. Ingenuous</a></li>
<li><a href="#org51ba226">67. Ingest</a></li>
<li><a href="#org89a25e0">68. Ingrained</a></li>
<li><a href="#org07e1d88">69. Ingrate</a></li>
<li><a href="#org3e19c22">70. Ingratiate</a></li>
<li><a href="#org0b6d2b5">71. Inimitable</a></li>
<li><a href="#org6d4b7c6">72. Injurious</a></li>
<li><a href="#org17033f5">73. Innate</a></li>
<li><a href="#orgd4d54e9">74. Insatiable</a></li>
<li><a href="#org99dd18f">75. Insidious</a></li>
<li><a href="#orgb85e6ba">76. Insinuate</a></li>
<li><a href="#org8b9ae38">77. Insipid</a></li>
<li><a href="#org5866f32">78. Insolent</a></li>
<li><a href="#org64b3871">79. Instigate</a></li>
<li><a href="#orgd7c626d">80. Insular</a></li>
<li><a href="#org810767f">81. Intemperate</a></li>
<li><a href="#org1eecc8e">82. Interpolate</a></li>
<li><a href="#org5d9998b">83. Intimate</a></li>
<li><a href="#org4f57bc1">84. Intimation</a></li>
<li><a href="#org28094bd">85. Intimidate</a></li>
<li><a href="#orga098022">86. Intransigent</a></li>
<li><a href="#org8a202cf">87. Intrepid</a></li>
<li><a href="#org577db1e">88. Introspective</a></li>
<li><a href="#org1895385">89. Inure</a></li>
<li><a href="#orgdc7d4d6">90. Involuntary</a></li>
<li><a href="#org7d9f590">91. Irascible</a></li>
<li><a href="#orgc828c23">92. Irate</a></li>
<li><a href="#org55c1fd2">93. Iridescent</a></li>
<li><a href="#org79ed547">94. Irresolute</a></li>
<li><a href="#org2441669">95. Irreverent</a></li>
<li><a href="#orgef912a2">96. Itinerant</a></li>
<li><a href="#orge308a14">97. Illustrious</a></li>
<li><a href="#org7de188c">98. Imbecile</a></li>
<li><a href="#orgc25ae99">99. Imbibe</a></li>
<li><a href="#org590d991">100. Imbroglio</a></li>
<li><a href="#orgdd57f58">101. Immensity</a></li>
<li><a href="#org9d6332f">102. Immolation</a></li>
<li><a href="#org755b731">103. Immure</a></li>
<li><a href="#org5f92c32">104. Impale</a></li>
<li><a href="#org274a57f">105. Impasse</a></li>
<li><a href="#org3ac4282">106. Impeach</a></li>
<li><a href="#orgea8df25">107. Impel</a></li>
<li><a href="#org37ee2e5">108. Impenitent</a></li>
<li><a href="#orgc2f346d">109. Imperil</a></li>
<li><a href="#orgf9e218e">110. Impetus</a></li>
<li><a href="#org4c0ffc4">111. Impinge</a></li>
<li><a href="#org1f7621f">112. Implant</a></li>
<li><a href="#org32d3ac5">113. Implicate</a></li>
<li><a href="#org7fe0ab9">114. Implode</a></li>
<li><a href="#orgf4e0acf">115. Implored</a></li>
<li><a href="#orgdd0ed40">116. Importune</a></li>
<li><a href="#org5d0556b">117. Imprecation</a></li>
<li><a href="#org707b6b0">118. Imprint</a></li>
<li><a href="#orgcf21693">119. Incarcerate</a></li>
<li><a href="#org194c439">120. Incinerate</a></li>
<li><a href="#org18d7b21">121. Incite</a></li>
<li><a href="#orgde2c5f2">122. Inclement</a></li>
<li><a href="#org7decf6f">123. Incriminate</a></li>
<li><a href="#orga9edb0a">124. Incubus</a></li>
<li><a href="#org880357f">125. Inculcate</a></li>
<li><a href="#orgdc4bee3">126. Inculpate</a></li>
<li><a href="#org3210bc9">127. Incur</a></li>
<li><a href="#org5328151">128. Indemnify</a></li>
<li><a href="#org9e8f944">129. Indignant</a></li>
<li><a href="#orgf3f907b">130. Indignity</a></li>
<li><a href="#orgc9d2c10">131. Induction</a></li>
<li><a href="#org2d90fbe">132. Inebriated</a></li>
<li><a href="#org533b47b">133. Ineluctable</a></li>
<li><a href="#org2e83a52">134. Inexpedient</a></li>
<li><a href="#org16ccee1">135. Infatuated</a></li>
<li><a href="#orgc233c23">136. Infelicitous</a></li>
<li><a href="#orgc25f143">137. Influx</a></li>
<li><a href="#org8e95787">138. Infraction</a></li>
<li><a href="#org378a7a4">139. Infringe</a></li>
<li><a href="#orgf8be2d7">140. Ingress</a></li>
<li><a href="#org4b2b870">141. Iniquity</a></li>
<li><a href="#org9383c73">142. Inkling</a></li>
<li><a href="#org162e219">143. Innuendo</a></li>
<li><a href="#org2bceac3">144. Inscribe</a></li>
<li><a href="#org24d6468">145. Inscrutable</a></li>
<li><a href="#org0eb99dc">146. Insignia</a></li>
<li><a href="#orgf432277">147. Insouciant</a></li>
<li><a href="#orgc336320">148. Instill</a></li>
<li><a href="#org8d43289">149. Insuperable</a></li>
<li><a href="#org817f494">150. Insurrection</a></li>
<li><a href="#org92c89df">151. Intercede</a></li>
<li><a href="#org8aede69">152. Interloper</a></li>
<li><a href="#orgdb19a20">153. Interlude</a></li>
<li><a href="#orga1dd819">154. Intermission</a></li>
<li><a href="#org7f308ec">155. Intermittent</a></li>
<li><a href="#org9a3e0e4">156. Interpose</a></li>
<li><a href="#org45e8836">157. Interrogate</a></li>
<li><a href="#org9b6c3dd">158. Inundate</a></li>
<li><a href="#org561e8b7">159. Invective</a></li>
<li><a href="#orgaea054b">160. Inveigh</a></li>
<li><a href="#orgecd0165">161. Inveigle</a></li>
<li><a href="#orgd63847c">162. Inveterate</a></li>
<li><a href="#orgdcc6942">163. Invidious</a></li>
<li><a href="#orgb6e7bf0">164. Invoke</a></li>
<li><a href="#org7eff85c">165. Iota</a></li>
<li><a href="#orgdd14034">166. Ire</a></li>
<li><a href="#orgf68d44d">167. Irk</a></li>
<li><a href="#org7bb8cb9">168. Irksome</a></li>
<li><a href="#orgfa48101">169. Irremediable</a></li>
<li><a href="#org74c87aa">170. Itinerary</a></li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="org-left">Date</td>
<td class="org-left">2018-06-19 23:26:22</td>
</tr>
</tbody>
</table>
<a href="#bottom">⇩</a>
<a id="top"/>
</div>

<div id="outline-container-orge02c9c9" class="outline-2">
<h2 id="orge02c9c9"><span class="section-number-2">1</span> <a href="https://wordsinasentence.com/igneous-in-a-sentence/">Igneous</a></h2>
<div class="outline-text-2" id="text-1">
<p>
<code>solidified from lava or magma</code>
</p>

<ul class="org-ul">
<li>After the volcano erupted and lava covered the ground, many igneous rocks were created.</li>
<li>Igneous rocks such as <b>basalt</b> are the after product of a volcanic eruption.</li>
<li>Although all igneous rocks originally stem from volcanic lava, many morph into other types of rocks overtime.</li>
<li>Some igneous rocks are formed from <b>magma</b> that cools and solidifies within the crust of the earth.</li>
</ul>
</div>
</div>
