ruby/I.org
* [[https://wordsinasentence.com/ignoble-in-a-sentence/][Ignoble]]

  =not deserving respect; not honorable=

  - Because Frank has a habit of not showing up on time, he has an ignoble reputation as someone who is not very responsible.
  - The serial killer was buried in an ignoble grave in the back of the cemetery.
  - As punishment for vandalizing one of the school bathrooms, George received the ignoble task of cleaning all the bathrooms for one week.
  - Frank was a greedy man who had only ignoble motives when he helped the young heiress.
  - During his speech, the district attorney promised to rid the city of ignoble police officers guilty of abusing their power.
  - The ignoble accountant was convicted of stealing money from his firm.
  - Since the criminal showed no remorse for his ignoble deeds, the judge sentenced him to life in prison.



* [[https://wordsinasentence.com/ignominious-meaning-in-a-sentence/][Ignominious]]

  =very embarrassing; shameful or disgraceful=

  - When the boxer got knocked out in the first round, everyone knew it was the beginning of an ignominious defeat for him.
  - Since Charles struck out at bat three times, he is credited as the reason our baseball team suffered such an ignominious loss in the state playoffs.
  - Because he divorced his wife and later married her sister, Henry has an ignominious reputation among the townspeople.
  - While our computer teacher was not arrested for stealing school property, she still made an ignominious departure from the building after being interviewed by the police.
  - The basketball player’s downfall was caused by his ignominious steroid use.
  - Once upon a time, unwed pregnant women were frowned upon and viewed as ignominious members of society.
  - After being excommunicated from the church, the priest made an ignominious exit from the building.



* [[https://wordsinasentence.com/ignominy-in-a-sentence/][Ignominy]]

  =public shame or disgrace=

  - After being confronted about the theft, the official left the room in ignominy.
  - Our team has to face the ignominy of a long losing streak.
  - Because he was given a dishonorable discharge from the military, Carl had no choice but to return home in ignominy.
  - Once upon a time, if you were an unwed mother, you were viewed as a source of ignominy.
  - The incriminating pictures brought ignominy to the celebrity.
  - I cannot believe ignominy caused the man to take his own life!
  - Caleb’s many extra-marital affairs brought ignominy to his wife.



* [[https://wordsinasentence.com/imbue-in-a-sentence/][Imbue]]

  =to cause to be strongly influenced by a quality or emotion=

  - After the terrorist bombings, the government placed several of the country’s flags at the site of the ruins to imbue patriotism.
  - The purpose of singing the school song is to imbue school spirit among the students and faculty.
  - When cinnamon is added to the sweet potato batter, it will imbue the pie with a hint of spice.
  - The addition of red paint will imbue the painting’s background with an impression of rage that symbolizes the artist’s feelings about government control.
  - In the movie, the wizard will imbue two wayward travellers with the courage and love they need to pursue happy lives.
  - Painting the room yellow will imbue the area with a warm and inviting air.
  - Before the final exam, the teacher gave her students an encouraging talk to imbue them with confidence.



* [[https://wordsinasentence.com/imitate-in-a-sentence/][Imitate]]

  =to copy or simulate the function of something else=

  - Young children will often attempt to imitate their parents, which is why you shouldn’t do anything you wouldn’t want your child to do while they’re watching.
  - Many insects imitate more deadly animals in order to scare away predators, such as moths with wing markings reminiscent of owls.
  - When a TV show has great success in public media, many other producers try to imitate it with a similar product to cash in.
  - There are many musicians that have tried to imitate the unique sound of artists in the past, though they usually add their own twist as well.



* [[https://wordsinasentence.com/immaculate-in-a-sentence/][Immaculate]]

  =without any blemish or imperfection=

  - Since I am having guests over for dinner, my house must be cleaned until it is immaculate.
  - The gardener works seven days a week to keep my lawn immaculate.
  - When Ginger took her bridal pictures, she looked immaculate in her wedding gown.
  - The soldier was reprimanded for ruining his immaculate uniform.
  - With everyone’s help, we were able to pick up all the trash and make the park immaculate.
  - Since the hotel room was far from immaculate, I called the front desk and asked for a new room.
  - After the tub was scrubbed for hours, it finally looked immaculate.



* [[https://wordsinasentence.com/imminent-in-a-sentence/][Imminent]]

  =likely to occur at any moment=

  - When the Secret Service arrived, everyone knew the president’s arrival was imminent.
  - The hurricane is imminent and has homeowners rushing to board up their windows.
  - Despite what the scientist said, the volcano eruption is not imminent so do not be concerned!
  - Some people thought it was funny when the media predicted the imminent death of the drug-addicted celebrity.
  - Because the swat team just arrived on the scene, it is likely a confrontation between the robbers and the police is imminent.
  -  Without some type of government funding, the closing of the school is imminent.
  - Even though Sarah had been bit by a snake, she was not in imminent danger because the snake was not poisonous.



* [[https://wordsinasentence.com/impair-in-a-sentence/][Impair]]

  =damage or weaken something=

  - Alcohol can greatly impair your judgement.
  - Certain drugs will impair your depth perception, making it unsafe to drive.
  - Smoking cigarettes will impair your overall level of health.
  - A bad diet can impair your ability to perform athletically.
  - Most sunglasses will slightly impair your depth perception, throwing off your ability to judge distances.
  - Fear can impair your ability to react properly in an emergency.
  - Those new pills did nothing but impair his ability to think clearly.



