ruby/I.html

<div id="outline-container-orgfa5b57a" class="outline-2">
<h2 id="orgfa5b57a"><span class="section-number-2">2</span> <a href="https://wordsinasentence.com/ignoble-in-a-sentence/">Ignoble</a></h2>
<div class="outline-text-2" id="text-2">
<p>
<code>not deserving respect; not honorable</code>
</p>

<ul class="org-ul">
<li>Because Frank has a habit of not showing up on time, he has an ignoble reputation as someone who is not very responsible.</li>
<li>The serial killer was buried in an ignoble grave in the back of the cemetery.</li>
<li>As punishment for vandalizing one of the school bathrooms, George received the ignoble task of cleaning all the bathrooms for one week.</li>
<li>Frank was a greedy man who had only ignoble motives when he helped the young heiress.</li>
<li>During his speech, the district attorney promised to rid the city of ignoble police officers guilty of abusing their power.</li>
<li>The ignoble accountant was convicted of stealing money from his firm.</li>
<li>Since the criminal showed no remorse for his ignoble deeds, the judge sentenced him to life in prison.</li>
</ul>
</div>
</div>



<div id="outline-container-org81b7225" class="outline-2">
<h2 id="org81b7225"><span class="section-number-2">3</span> <a href="https://wordsinasentence.com/ignominious-meaning-in-a-sentence/">Ignominious</a></h2>
<div class="outline-text-2" id="text-3">
<p>
<code>very embarrassing; shameful or disgraceful</code>
</p>

<ul class="org-ul">
<li>When the boxer got knocked out in the first round, everyone knew it was the beginning of an ignominious defeat for him.</li>
<li>Since Charles struck out at bat three times, he is credited as the reason our baseball team suffered such an ignominious loss in the state playoffs.</li>
<li>Because he divorced his wife and later married her sister, Henry has an ignominious reputation among the townspeople.</li>
<li>While our computer teacher was not arrested for stealing school property, she still made an ignominious departure from the building after being interviewed by the police.</li>
<li>The basketball player’s downfall was caused by his ignominious steroid use.</li>
<li>Once upon a time, unwed pregnant women were frowned upon and viewed as ignominious members of society.</li>
<li>After being <b>excommunicated</b> from the church, the priest made an ignominious exit from the building.</li>
</ul>
</div>
</div>



<div id="outline-container-org6cd50ca" class="outline-2">
<h2 id="org6cd50ca"><span class="section-number-2">4</span> <a href="https://wordsinasentence.com/ignominy-in-a-sentence/">Ignominy</a></h2>
<div class="outline-text-2" id="text-4">
<p>
<code>public shame or disgrace</code>
</p>

<ul class="org-ul">
<li>After being confronted about the theft, the official left the room in ignominy.</li>
<li>Our team has to face the ignominy of a long losing streak.</li>
<li>Because he was given a dishonorable discharge from the military, Carl had no choice but to return home in ignominy.</li>
<li>Once upon a time, if you were an unwed mother, you were viewed as a source of ignominy.</li>
<li>The incriminating pictures brought ignominy to the celebrity.</li>
<li>I cannot believe ignominy caused the man to take his own life!</li>
<li>Caleb’s many extra-marital affairs brought ignominy to his wife.</li>
</ul>
</div>
</div>



<div id="outline-container-org8fd2904" class="outline-2">
<h2 id="org8fd2904"><span class="section-number-2">5</span> <a href="https://wordsinasentence.com/imbue-in-a-sentence/">Imbue</a></h2>
<div class="outline-text-2" id="text-5">
<p>
<code>to cause to be strongly influenced by a quality or emotion</code>
</p>

<ul class="org-ul">
<li>After the terrorist bombings, the government placed several of the country’s flags at the site of the ruins to imbue patriotism.</li>
<li>The purpose of singing the school song is to imbue school spirit among the students and faculty.</li>
<li>When cinnamon is added to the sweet potato batter, it will imbue the pie with a hint of spice.</li>
<li>The addition of red paint will imbue the painting’s background with an impression of rage that symbolizes the artist’s feelings about government control.</li>
<li>In the movie, the wizard will imbue two <b>wayward</b> travellers with the courage and love they need to pursue happy lives.</li>
<li>Painting the room yellow will imbue the area with a warm and inviting air.</li>
<li>Before the final exam, the teacher gave her students an encouraging talk to imbue them with confidence.</li>
</ul>
</div>
</div>



<div id="outline-container-org5d01279" class="outline-2">
<h2 id="org5d01279"><span class="section-number-2">6</span> <a href="https://wordsinasentence.com/imitate-in-a-sentence/">Imitate</a></h2>
<div class="outline-text-2" id="text-6">
<p>
<code>to copy or simulate the function of something else</code>
</p>

<ul class="org-ul">
<li>Young children will often attempt to imitate their parents, which is why you shouldn’t do anything you wouldn’t want your child to do while they’re watching.</li>
<li>Many insects imitate more deadly animals in order to scare away predators, such as moths with wing markings <b>reminiscent of</b> owls.</li>
<li>When a TV show has great success in public media, many other producers try to imitate it with a similar product to <b>cash in</b> <code>赚钱</code>.</li>
<li>There are many musicians that have tried to imitate the unique sound of artists in the past, though they usually add their own <b>twist</b> as well.</li>
</ul>
</div>
</div>



<div id="outline-container-orgadfbe80" class="outline-2">
<h2 id="orgadfbe80"><span class="section-number-2">7</span> <a href="https://wordsinasentence.com/immaculate-in-a-sentence/">Immaculate</a></h2>
<div class="outline-text-2" id="text-7">
<p>
<code>without any blemish or imperfection</code>
</p>

<ul class="org-ul">
<li>Since I am having guests over for dinner, my house must be cleaned until it is immaculate.</li>
<li>The gardener works seven days a week to keep my lawn immaculate.</li>
<li>When Ginger took her bridal pictures, she looked immaculate in her wedding gown.</li>
<li>The soldier was reprimanded for ruining his immaculate uniform.</li>
<li>With everyone’s help, we were able to pick up all the trash and make the park immaculate.</li>
<li>Since the hotel room was far from immaculate, I called the front desk and asked for a new room.</li>
<li>After the tub was scrubbed for hours, it finally looked immaculate.</li>
</ul>
</div>
</div>



<div id="outline-container-org02b19f6" class="outline-2">
<h2 id="org02b19f6"><span class="section-number-2">8</span> <a href="https://wordsinasentence.com/imminent-in-a-sentence/">Imminent</a></h2>
<div class="outline-text-2" id="text-8">
<p>
<code>likely to occur at any moment</code>
</p>

<ul class="org-ul">
<li>When the Secret Service arrived, everyone knew the president’s arrival was imminent.</li>
<li>The hurricane is imminent and has homeowners rushing to <b>board up</b> <code>用木条封闭</code> their windows.</li>
<li>Despite what the scientist said, the volcano eruption is not imminent so do not be concerned!</li>
<li>Some people thought it was funny when the media predicted the imminent death of the drug-addicted celebrity.</li>
<li>Because the swat team just arrived on the scene, it is likely a confrontation between the robbers and the police is imminent.</li>
<li>Without some type of government funding, the closing of the school is imminent.</li>
<li>Even though Sarah had been bit by a snake, she was not in imminent danger because the snake was not poisonous.</li>
</ul>
</div>
</div>



<div id="outline-container-org73dc4ed" class="outline-2">
<h2 id="org73dc4ed"><span class="section-number-2">9</span> <a href="https://wordsinasentence.com/impair-in-a-sentence/">Impair</a></h2>
<div class="outline-text-2" id="text-9">
<p>
<code>damage or weaken something</code>
</p>

<ul class="org-ul">
<li>Alcohol can greatly impair your judgement.</li>
<li>Certain drugs will impair your depth perception, making it unsafe to drive.</li>
<li>Smoking cigarettes will impair your overall level of health.</li>
<li>A bad diet can impair your ability to perform athletically.</li>
<li>Most sunglasses will slightly impair your depth perception, throwing off your ability to judge distances.</li>
<li>Fear can impair your ability to react properly in an emergency.</li>
<li>Those new pills did nothing but impair his ability to think clearly.</li>
</ul>
</div>
</div>
