ruby/I.org
* [[https://wordsinasentence.com/impart-in-a-sentence/][Impart]]

  =to distribute a portion of something=

  - A teacher’s job is to impart knowledge to her students.
  - By adding garlic to the spaghetti, the cook hopes to impart flavor to the dish.
  - Please sit down because the news I am about to impart to you is not pleasant.
  - Before the current president leaves his position, he will impart many important facts to his successor.
  - The stain will impart a beautiful brown color to the unfinished wood.
  - With a few dashes of cumin and cinnamon, the baker will impart mouthwatering flavors to the pie.
  - The genie will impart three wishes to the one who brings him forth from the bottle.



* [[https://wordsinasentence.com/impartial-in-a-sentence/][Impartial]]

  =to not offer influence to any side=

  - Since the judge is related to the defendant, it is not possible for him to be impartial during the trial.
  - The impartial moderator managed the debate and did not show favoritism to either politician.
  - Was the city council being impartial when it decided to build the sewage plant in the poor neighborhood?
  - When the contestant did not advance to the next round of the competition, she accused the judges of not being impartial.
  - There is no way Allison can be an impartial critic when her daughter is performing in the talent show.
  - As a party hostess, Jill must act impartial towards her guests and not show a preference for any one person.
  - The impartial ruling decided neither of the parties was at fault for the accident.



* [[https://wordsinasentence.com/impassive-in-a-sentence/][Impassive]]

  =having, or revealing, no emotion; expressionless=

  - Even though it was very exciting, Jon delivered the news in an impassive voice in the hope that everyone would stay calm.
  - It’s so difficult to remain impassive when you’re faced with a life or death situation.
  - The impassive report given by the officer was an extreme understatement of the horror of the accident.
  - Although robots are well-known for being completely impassive, there are many popular movies and TV shows that depict them as adorable creatures that actually do have feelings.
  - As the foreman of the jury delivered the verdict, the defendant kept his expression completely impassive so that no one could tell what he was feeling inside.
  - She tried to be friendly with the newcomer, but she found his impassive stare more than a little disturbing and excused herself  to join her friends.
  - As the guests gathered in the parlor to meet their host, the impassive housekeeper ignored their clamoring questions as she passed among them with a tray of refreshments.



* [[https://wordsinasentence.com/impeccable-in-a-sentence/][Impeccable]]

  =perfect in every way=

  - With your impeccable English skills, writing essays should be a cinch.
  - Your impeccable work ethic and great attention to detail are reasons enough for hiring you.
  - Impeccable at playing the violin at home as a child, Charles would grow up to orchestrate musicals.
  - My best friend and I arrived at the same exact time—now that is impeccable timing!
  - 'Impeccable' is not a human quality as everyone makes mistakes.
  - Without a scratch, this car is in impeccable condition!
  - If you have been pulled over for speeding, then your driving record is not impeccable.



* [[https://wordsinasentence.com/impecunious-in-a-sentence/][Impecunious]]

  =lacking money; penniless=

  - Since Janice grew up in an impecunious household, she knew a great deal about surviving on very little.
  - Impecunious students commonly find themselves in debt after overindulging in the use of credit cards.
  - Although Tom and Janice are an impecunious couple who earn very little, they always manage to take a short vacation during the summer.
  - Plans are being developed to help the impecunious people in the city who are without housing.
  - Even though the singer earned millions of dollars during her heyday, she was impecunious and homeless when she died.
  - Although Vincent died an impecunious artist without a penny to his name, his paintings are now highly valued by art collectors.
  - The impecunious immigrant came to America to earn money to send home to his starving family.



* [[https://wordsinasentence.com/impede-in-a-sentence/][Impede]]

  =to interfere with or slow the progress of=

  - If you do not eat while you are sick, the lack of nutrients will impede your recovery.
  - The purpose of the barrier is to impede entry into the museum to prevent overcrowding at the exhibits.
  - Because I do not want to impede your efforts on this project, I will step away and let someone else handle this difficult task.
  - The new beverage laws are designed to impede the actions of people who drive under the influence of alcohol.
  - If we plan the event indoors, the rain will not be able to impede our activities.
  - Wearing heavy ankle weights will impede your progress as you swim across the ocean.
  - While economic sanctions may impede trade between the two countries, they will not force either of the nations to do business within our borders.



* [[https://wordsinasentence.com/impediment-in-a-sentence/][Impediment]]

  =something that interferes with a person’s ability to complete a task=

  - My broken wrist is the impediment preventing me from finishing my new novel.
  - When Sarah learned Hank’s impediment to their marriage was his current marriage, she immediately ended their relationship.
  - The impediment that interferes with Gerald’s goal of running a successful diner is the lack of good employees.
  - In most romantic movies, there is always some sort of impediment that temporarily stops the guy from getting his dream girl.



* [[https://wordsinasentence.com/impending-in-a-sentence/][Impending]]

  =going to occur; coming=

  - When I refused to pay the fake fortuneteller, she warned me of impending doom in my future.
  - Sheila hoped Frank’s impending question was not a marriage proposal because she was not in love with him.
  - Because Jim suffers from anxiety, he frequently has fears of impending disaster.
  - The emergency alert instructed everyone to prepare for the impending tornado.



