ruby/I.html



<div id="outline-container-org13a4c72" class="outline-2">
<h2 id="org13a4c72"><span class="section-number-2">10</span> <a href="https://wordsinasentence.com/impart-in-a-sentence/">Impart</a></h2>
<div class="outline-text-2" id="text-10">
<p>
<code>to distribute a portion of something</code>
</p>

<ul class="org-ul">
<li>A teacher’s job is to impart knowledge to her students.</li>
<li>By adding garlic to the spaghetti, the cook hopes to impart flavor to the dish.</li>
<li>Please sit down because the news I am about to impart to you is not pleasant.</li>
<li>Before the current president leaves his position, he will impart many important facts to his successor.</li>
<li>The stain will impart a beautiful brown color to the unfinished wood.</li>
<li>With <b>a few dashes</b> of cumin and cinnamon, the baker will impart mouthwatering flavors to the pie.</li>
<li>The genie will impart three wishes to the one who brings him forth from the bottle.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf515440" class="outline-2">
<h2 id="orgf515440"><span class="section-number-2">11</span> <a href="https://wordsinasentence.com/impartial-in-a-sentence/">Impartial</a></h2>
<div class="outline-text-2" id="text-11">
<p>
<code>to not offer influence to any side</code>
</p>

<ul class="org-ul">
<li>Since the judge is related to the defendant, it is not possible for him to be impartial during the trial.</li>
<li>The impartial moderator managed the debate and did not show favoritism to either politician.</li>
<li>Was the city council being impartial when it decided to build the sewage plant in the poor neighborhood?</li>
<li>When the contestant did not advance to the next round of the competition, she accused the judges of not being impartial.</li>
<li>There is no way Allison can be an impartial critic when her daughter is performing in the talent show.</li>
<li>As a party hostess, Jill must act impartial towards her guests and not show a preference for any one person.</li>
<li>The impartial ruling decided neither of the parties was at fault for the accident.</li>
</ul>
</div>
</div>



<div id="outline-container-org9077818" class="outline-2">
<h2 id="org9077818"><span class="section-number-2">12</span> <a href="https://wordsinasentence.com/impassive-in-a-sentence/">Impassive</a></h2>
<div class="outline-text-2" id="text-12">
<p>
<code>having, or revealing, no emotion; expressionless</code>
</p>

<ul class="org-ul">
<li>Even though it was very exciting, Jon delivered the news in an impassive voice in the hope that everyone would stay calm.</li>
<li>It’s so difficult to remain impassive when you’re faced with a life or death situation.</li>
<li>The impassive report given by the officer was an extreme understatement of the horror of the accident.</li>
<li>Although robots are well-known for being completely impassive, there are many popular movies and TV shows that depict them as adorable creatures that actually do have feelings.</li>
<li>As the foreman of the jury delivered the verdict, the defendant kept his expression completely impassive so that no one could tell what he was feeling inside.</li>
<li>She tried to be friendly with the newcomer, but she found his impassive stare more than a little disturbing and <b>excused herself to</b> join her friends.</li>
<li>As the guests gathered in the parlor to meet their host, the impassive housekeeper ignored their clamoring questions as she passed among them with a tray of refreshments.</li>
</ul>
</div>
</div>



<div id="outline-container-org8317e65" class="outline-2">
<h2 id="org8317e65"><span class="section-number-2">13</span> <a href="https://wordsinasentence.com/impeccable-in-a-sentence/">Impeccable</a></h2>
<div class="outline-text-2" id="text-13">
<p>
<code>perfect in every way</code>
</p>

<ul class="org-ul">
<li>With your impeccable English skills, writing essays should be a <b>cinch</b>.</li>
<li>Your impeccable work ethic and great attention to detail are reasons enough for hiring you.</li>
<li>Impeccable at playing the violin at home as a child, Charles would grow up to orchestrate musicals.</li>
<li>My best friend and I arrived at the same exact time—now that is impeccable timing!</li>
<li>'Impeccable' is not a human quality as everyone makes mistakes.</li>
<li>Without a scratch, this car is in impeccable condition!</li>
<li>If you have been pulled over for speeding, then your driving record is not impeccable.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc4ae6d4" class="outline-2">
<h2 id="orgc4ae6d4"><span class="section-number-2">14</span> <a href="https://wordsinasentence.com/impecunious-in-a-sentence/">Impecunious</a></h2>
<div class="outline-text-2" id="text-14">
<p>
<code>lacking money; penniless</code>
</p>

<ul class="org-ul">
<li>Since Janice grew up in an impecunious household, she knew a great deal about surviving on very little.</li>
<li>Impecunious students commonly find themselves in debt after overindulging in the use of credit cards.</li>
<li>Although Tom and Janice are an impecunious couple who earn very little, they always manage to take a short vacation during the summer.</li>
<li>Plans are being developed to help the impecunious people in the city who are without housing.</li>
<li>Even though the singer earned millions of dollars during her <b>heyday</b>, she was impecunious and homeless when she died.</li>
<li>Although Vincent died an impecunious artist without a penny <b>to his name</b> <code>属于自己</code>, his paintings are now highly valued by art collectors.</li>
<li>The impecunious immigrant came to America to earn money to send home to his starving family.</li>
</ul>
</div>
</div>



<div id="outline-container-org29eb10c" class="outline-2">
<h2 id="org29eb10c"><span class="section-number-2">15</span> <a href="https://wordsinasentence.com/impede-in-a-sentence/">Impede</a></h2>
<div class="outline-text-2" id="text-15">
<p>
<code>to interfere with or slow the progress of</code>
</p>

<ul class="org-ul">
<li>If you do not eat while you are sick, the lack of nutrients will impede your recovery.</li>
<li>The purpose of the barrier is to impede entry into the museum to prevent overcrowding at the exhibits.</li>
<li>Because I do not want to impede your efforts on this project, I will step away and let someone else handle this difficult task.</li>
<li>The new beverage laws are designed to impede the actions of people who drive under the influence of alcohol.</li>
<li>If we plan the event indoors, the rain will not be able to impede our activities.</li>
<li>Wearing heavy ankle weights will impede your progress as you swim across the ocean.</li>
<li>While economic sanctions may impede trade between the two countries, they will not force either of the nations to do business within our borders.</li>
</ul>
</div>
</div>



<div id="outline-container-org0bf6fa3" class="outline-2">
<h2 id="org0bf6fa3"><span class="section-number-2">16</span> <a href="https://wordsinasentence.com/impediment-in-a-sentence/">Impediment</a></h2>
<div class="outline-text-2" id="text-16">
<p>
<code>something that interferes with a person’s ability to complete a task</code>
</p>

<ul class="org-ul">
<li>My broken wrist is the impediment preventing me from finishing my new novel.</li>
<li>When Sarah learned Hank’s impediment to their marriage was his current marriage, she immediately ended their relationship.</li>
<li>The impediment that interferes with Gerald’s goal of running a successful diner is the lack of good employees.</li>
<li>In most romantic movies, there is always some sort of impediment that temporarily stops the guy from getting his dream girl.</li>
</ul>
</div>
</div>
