ruby/I.org
* [[https://wordsinasentence.com/imperative-in-a-sentence/][Imperative]]

  =essential=

  - If you’re serious about getting healthy, it’s imperative that you follow a healthy lifestyle, make the right food choices, and exercise regularly.
  - The school district’s new policy makes it imperative for every child to be familiar with the escape routes on school buses.
  - Self-discipline and persistence are two of the imperative qualities to have for anyone who is serious about being successful in life.
  - The publicist commented that the imperative restrictions placed on the press would only make the public view the celebrity as a spoiled brat.
  - I’ll tell you what happened in the committee meeting, but it’s imperative that you handle the information discreetly.
  - If you have a blowout on the highway, it’s imperative that you reduce speed and maintain control without stomping on the brake pedal.
  - Although it’s not imperative to dress up for the occasion, you should wear something neat and tasteful.



* [[https://wordsinasentence.com/imperious-in-a-sentence/][Imperious]]

  =domineering; expecting ones' orders to be followed=

  - The principal is an imperious woman who expects to be obeyed.
  - When Mark got promoted to the rank of captain, he became very imperious.
  - In an imperious tone, the police officer ordered the driver to step out of the car.
  - If my son thinks his imperious ways will be tolerated in my home, then he has a lot to learn!
  - The A-list actress has an imperious air and assumes everyone will heed her every whim.
  - Although I was sick, my imperious supervisor ordered me in to work.
  - Because Amy is an imperious person, she has the tendency to tell everyone what to do.



* [[https://wordsinasentence.com/impermanence-in-a-sentence/][Impermanence]]

  =the state of being temporary=

  - The impermanence of the new the car’s smell caused the woman to buy air fresheners.
  - His job’s impermanence led the man to seek out new opportunities.
  - Forgetting weather’s impermanence, the man became depressed after several days of rain.
  - The impermanence of life made the woman worry about death and what was yet to come.



* [[https://wordsinasentence.com/impersonal-in-a-sentence/][Impersonal]]

  =having no interest in other people and lacking warmth or emotion; cold=

  - Breaking up with me over text was a very impersonal way to end our relationship.
  - Considering I was an employee for 12 years, the letter I received letting me know I was fired was impersonal.
  - My blind date was rather impersonal as he didn’t seem interested in getting to know me.
  - My good friends were very impersonal towards the other guests at my party, only socializing with one another.



* [[https://wordsinasentence.com/impersonate-in-a-sentence/][Impersonate]]

  =to deliberately act or appear like someone else=

  - Most people try to impersonate Elvis Presley by wearing a sparkling jumpsuit, dark sunglasses, and jet black hair, in addition to singing one of his songs.
  - Cassie convinced her friend to impersonate her teacher’s voice on the phone in order to fool her parents into believing that they were speaking to Cassie’s teacher about her grades in school.
  - A strange man decided to impersonate a police officer so that he could pull over unsuspecting drivers and rob them since they would believe he was a police officer.
  - Since I could successfully impersonate my boss’s voice over the phone, I decided to call everyone at work and tell them they had the day off as a joke.



* [[https://wordsinasentence.com/impertinent-in-a-sentence/][Impertinent]]

  =behaving without proper respect; rude=

  - Although she thought she was just being funny, her teacher didn’t agree and sent her to the principal’s office for being impertinent.
  - While he never intended his remark to be impertinent, he found that a lot of people had been offended by what he said.
  - Because the young man would only give an impertinent answer to his questions, the attorney decided not to take him on as a client.
  - While Natalie searched frantically for her mysterious present, Ely just watched from the doorway with an impertinent smirk on his face.
  - Although Alexis had been enjoying the young man’s company, his impertinent suggestion prompted her to leave the bar.
  - As the site’s webmaster, it is her job to monitor the online forum for impertinent comments.
  - If Evan didn’t have such an impertinent attitude with waiters, Alyssa wouldn’t have minded going out to dinner with him.



* [[https://wordsinasentence.com/imperturbable-in-a-sentence/][Imperturbable]]

  =not disturbed or excited easily=

  - The imperturbable actress carried on with her performance even when her costar forgot his lines.
  - Surrounded by flames and carrying a small child, the imperturbable fireman kept his cool and found his way out of the burning apartment.
  -  The imperturbable spy refused to give out secret information during his interrogation.
  - During the bomb threat, the teacher was imperturbable and did not let her students know how worried she was.
  - The beauty queen was imperturbable and wore a smile on her face even when members of the press asked about her painful childhood.
  - During the riots, the police unit stood in a straight line and remained imperturbable throughout the protestor taunts.
  - The fact the woman appeared imperturbable about her husband’s murder made the detectives suspicious.



* [[https://wordsinasentence.com/impervious-in-a-sentence/][Impervious]]

  =not allowing something to enter or pass through=

  - Let us hope these thin walls are impervious to the freezing cold tonight!
  - Since the bank installed an impervious safe, it has not been robbed.
  - The broken window is not impervious to the rain.
  - As evidenced by the recent bombings, not even the nation’s capital is impervious to terrorism.
  - Does wearing the protective clothing during x-rays make your body impervious to radiation?
  - The chemical treatment makes the fireman’s uniform impervious to flames.
  - When John drinks too much alcohol, he is impervious to logic.



