ruby/I.html



<div id="outline-container-org4aaf10e" class="outline-2">
<h2 id="org4aaf10e"><span class="section-number-2">17</span> <a href="https://wordsinasentence.com/impending-in-a-sentence/">Impending</a></h2>
<div class="outline-text-2" id="text-17">
<p>
<code>going to occur; coming</code>
</p>

<ul class="org-ul">
<li>When I refused to pay the fake fortuneteller, she warned me of impending doom in my future.</li>
<li>Sheila hoped Frank’s impending question was not a marriage proposal because she was not in love with him.</li>
<li>Because Jim suffers from anxiety, he frequently has fears of impending disaster.</li>
<li>The emergency alert instructed everyone to prepare for the impending tornado.</li>
</ul>
</div>
</div>



<div id="outline-container-org9688af0" class="outline-2">
<h2 id="org9688af0"><span class="section-number-2">18</span> <a href="https://wordsinasentence.com/imperative-in-a-sentence/">Imperative</a></h2>
<div class="outline-text-2" id="text-18">
<p>
<code>essential</code>
</p>

<ul class="org-ul">
<li>If you’re serious about getting healthy, it’s imperative that you follow a healthy lifestyle, make the right food choices, and exercise regularly.</li>
<li>The school district’s new policy makes it imperative for every child to be familiar with the escape routes on school buses.</li>
<li>Self-discipline and persistence are two of the imperative qualities to have for anyone who is serious about being successful in life.</li>
<li>The publicist commented that the imperative restrictions placed on the press would only make the public view the celebrity as a spoiled brat.</li>
<li>I’ll tell you what happened in the committee meeting, but it’s imperative that you handle the information discreetly.</li>
<li>If you have a <b>blowout</b> <code>爆胎</code> on the highway, it’s imperative that you reduce speed and maintain control without stomping on the brake pedal.</li>
<li>Although it’s not imperative to dress up for the occasion, you should wear something neat and tasteful.</li>
</ul>
</div>
</div>



<div id="outline-container-org210eeb6" class="outline-2">
<h2 id="org210eeb6"><span class="section-number-2">19</span> <a href="https://wordsinasentence.com/imperious-in-a-sentence/">Imperious</a></h2>
<div class="outline-text-2" id="text-19">
<p>
<code>domineering; expecting ones' orders to be followed</code>
</p>

<ul class="org-ul">
<li>The principal is an imperious woman who expects to be obeyed.</li>
<li>When Mark got promoted to the rank of captain, he became very imperious.</li>
<li>In an imperious tone, the police officer ordered the driver to step out of the car.</li>
<li>If my son thinks his imperious ways will be tolerated in my home, then he has a lot to learn!</li>
<li>The A-list actress has an imperious air and assumes everyone will <b>heed</b> her every whim.</li>
<li>Although I was sick, my imperious supervisor ordered me in to work.</li>
<li>Because Amy is an imperious person, she has the tendency to tell everyone what to do.</li>
</ul>
</div>
</div>



<div id="outline-container-org9266a4b" class="outline-2">
<h2 id="org9266a4b"><span class="section-number-2">20</span> <a href="https://wordsinasentence.com/impermanence-in-a-sentence/">Impermanence</a></h2>
<div class="outline-text-2" id="text-20">
<p>
<code>the state of being temporary</code>
</p>

<ul class="org-ul">
<li>The impermanence of the new car’s smell caused the woman to buy air fresheners.</li>
<li>His job’s impermanence led the man to seek out new opportunities.</li>
<li>Forgetting weather’s impermanence, the man became depressed after several days of rain.</li>
<li>The impermanence of life made the woman worry about death and what was yet to come.</li>
</ul>
</div>
</div>



<div id="outline-container-org46fa566" class="outline-2">
<h2 id="org46fa566"><span class="section-number-2">21</span> <a href="https://wordsinasentence.com/impersonal-in-a-sentence/">Impersonal</a></h2>
<div class="outline-text-2" id="text-21">
<p>
<code>having no interest in other people and lacking warmth or emotion; cold</code>
</p>

<ul class="org-ul">
<li>Breaking up with me over text was a very impersonal way to end our relationship.</li>
<li>Considering I was an employee for 12 years, the letter I received letting me know I was fired was impersonal.</li>
<li>My blind date was rather impersonal as he didn’t seem interested in getting to know me.</li>
<li>My good friends were very impersonal towards the other guests at my party, only socializing with one another.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf6d05e4" class="outline-2">
<h2 id="orgf6d05e4"><span class="section-number-2">22</span> <a href="https://wordsinasentence.com/impersonate-in-a-sentence/">Impersonate</a></h2>
<div class="outline-text-2" id="text-22">
<p>
<code>to deliberately act or appear like someone else</code>
</p>

<ul class="org-ul">
<li>Most people try to impersonate Elvis Presley by wearing a sparkling jumpsuit, dark sunglasses, and jet black hair, in addition to singing one of his songs.</li>
<li>Cassie convinced her friend to impersonate her teacher’s voice on the phone in order to fool her parents into believing that they were speaking to Cassie’s teacher about her grades in school.</li>
<li>A strange man decided to impersonate a police officer so that he could pull over unsuspecting drivers and rob them since they would believe he was a police officer.</li>
<li>Since I could successfully impersonate my boss’s voice over the phone, I decided to call everyone at work and tell them they had the day off as a joke.</li>
</ul>
</div>
</div>



<div id="outline-container-orgae95aa2" class="outline-2">
<h2 id="orgae95aa2"><span class="section-number-2">23</span> <a href="https://wordsinasentence.com/impertinent-in-a-sentence/">Impertinent</a></h2>
<div class="outline-text-2" id="text-23">
<p>
<code>behaving without proper respect; rude</code>
</p>

<ul class="org-ul">
<li>Although she thought she was just being funny, her teacher didn’t agree and sent her to the principal’s office for being impertinent.</li>
<li>While he never intended his remark to be impertinent, he found that a lot of people had been offended by what he said.</li>
<li>Because the young man would only give an impertinent answer to his questions, the attorney decided not to take him on as a client.</li>
<li>While Natalie searched frantically for her mysterious present, Ely just watched from the doorway with an impertinent smirk on his face.</li>
<li>Although Alexis had been enjoying the young man’s company, his impertinent suggestion prompted her to leave the bar.</li>
<li>As the site’s webmaster, it is her job to monitor the online forum for impertinent comments.</li>
<li>If Evan didn’t have such an impertinent attitude with waiters, Alyssa wouldn’t have minded going out to dinner with him.</li>
</ul>
</div>
</div>



<div id="outline-container-org520fea9" class="outline-2">
<h2 id="org520fea9"><span class="section-number-2">24</span> <a href="https://wordsinasentence.com/imperturbable-in-a-sentence/">Imperturbable</a></h2>
<div class="outline-text-2" id="text-24">
<p>
<code>not disturbed or excited easily</code>
</p>

<ul class="org-ul">
<li>The imperturbable actress carried on with her performance even when her costar forgot his lines.</li>
<li>Surrounded by flames and carrying a small child, the imperturbable fireman kept his cool and found his way out of the burning apartment.</li>
<li>The imperturbable spy refused to give out secret information during his interrogation.</li>
<li>During the bomb threat, the teacher was imperturbable and did not let her students know how worried she was.</li>
<li>The beauty queen was imperturbable and wore a smile on her face even when members of the press asked about her painful childhood.</li>
<li>During the riots, the police unit stood in a straight line and remained imperturbable throughout the protestor taunts.</li>
<li>The fact the woman appeared imperturbable about her husband’s murder made the detectives suspicious.</li>
</ul>
</div>
</div>



<div id="outline-container-orga294209" class="outline-2">
<h2 id="orga294209"><span class="section-number-2">25</span> <a href="https://wordsinasentence.com/impervious-in-a-sentence/">Impervious</a></h2>
<div class="outline-text-2" id="text-25">
<p>
<code>not allowing something to enter or pass through</code>
</p>

<ul class="org-ul">
<li>Let us hope these thin walls are impervious to the freezing cold tonight!</li>
<li>Since the bank installed an impervious safe, it has not been robbed.</li>
<li>The broken window is not impervious to the rain.</li>
<li>As evidenced by the recent bombings, not even the nation’s capital is impervious to terrorism.</li>
<li>Does wearing the protective clothing during x-rays make your body impervious to radiation?</li>
<li>The chemical treatment makes the fireman’s uniform impervious to flames.</li>
<li>When John drinks too much alcohol, he is impervious to logic.</li>
</ul>
</div>
</div>
