ruby/I.org
* [[https://wordsinasentence.com/impetuous-in-a-sentence/][Impetuous]]

  =acting without thinking—done impulsively; sudden decision=

  - His impetuous behavior landed him in prison.
  - Because James is only seventeen, he tends to be impetuous at times.
  - Marrying someone you hardly know is an impetuous decision!
  - While I may have been impetuous as a teenager, I have become a patient adult.
  - Even though Warren was rumored to be impetuous, he actually put a great deal of thought into making important decisions.
  - The author describes the heroine as an impetuous young woman who would do anything to become famous.
  - When Constance drank too much, she made impetuous choices which often got her into trouble.



* [[https://wordsinasentence.com/impiety-in-a-sentence/][Impiety]]

  =lack of respect for God=

  - Speaking with impiety of holy things was a crime in the city-state, but few were ever prosecuted.
  - Admitting his transgression, the man confessed that he once showed impiety in regards to prayer.
  - With an air of impiety, the woman scoffed at the religious texts which she considered fiction.
  - Although he was raised in the church, the impiety of the pastor’s son showed in his use of God’s name in vain.



* [[https://wordsinasentence.com/impolitic-in-a-sentence/][Impolitic]]

  =foolish=

  - I realized it was an impolitic idea to talk on my cell phone and walk through a curvy path in the woods since I am aware of my clumsiness and no sense of direction.
  - An impolitic decision to text and drive a car at the same time is dangerous because texting could distract you and cause a severe accident.
  - When the deceased’s cousin wore a bright red outfit with a bright hot pink hat to the funeral, the rest of the family didn’t get upset but figured it was just the cousin’s impolitic way of getting attention.
  - It is not only an impolitic action to yell fire in a crowded theater, but it could also get you in trouble since it will could cause injuries.



* [[https://wordsinasentence.com/imponderable-in-a-sentence/][Imponderable]]

  =difficult or impossible to comprehend or evaluate=

  - She wanted to enter the contest but guessing the amount of jelly beans in the barrel was imponderable.
  - I focused on the imponderable math problem for several hours before I realized that it was unsolvable.
  - Imponderable at best, the word problem confused even the gifted students.
  - Asking an imponderable question, the game show host was sure that he had stumped the contestant.


* [[https://wordsinasentence.com/imposter-in-a-sentence/][Imposter]]

  =a person who pretends to be someone else in order to trick and deceive people=

  - The imposter mimicked our dad’s voice to perfection.
  - Bruce is an imposter who deceives others by claiming to be one of their relatives.
  - I ripped off the imposter's mask, exposing him as a fraud.
  - Jane is an imposter who always hides her identity.



* [[https://wordsinasentence.com/imposture-in-a-sentence/][Imposture]]

  =the act of deceiving while using a fake identity=

  - The scam artist’s imposture involved convincing elderly people he could increase their retirement incomes for a small fee.
  - If the heiress has been taken in by John’s imposture, she may be in danger of losing her fortune to a conman.
  - William knew if he did not continue his imposture he would be executed for pretending to be the dictator’s long-lost brother.
  - As soon as the immigration officer saw the fake passport, he knew the traveler was taking part in an imposture.



* [[https://wordsinasentence.com/impound-in-a-sentence/][Impound]]

  =to remove and keep property by law=

  - After stopping payments on their new car, the bank would impound their car in a secured lot until the couple would pay the overdue amount.
  - It was likely that the court would decide to impound the important documents from the troubled company after a whistleblower declared the company was lying to its stakeholders.
  - Rental furniture companies may have to require a payment plan or impound the furniture in their store until the money is compensated.
  - Fred’s face changed from shock to anger when he received a notice to impound his television set on the basis of a loan repayment.



* [[https://wordsinasentence.com/impressionable-in-a-sentence/][Impressionable]]

  =swayed easily=

  - It was easy for the older boys to convince the impressionable young boy to shoplift.
  - According to research, the terrorist organization seeks out impressionable young minds when recruiting members.
  - Pedophiles are known to look for impressionable children they can easily manipulate.
  - As a marketing executive, Keith knows the importance of targeting impressionable kids.



* [[https://wordsinasentence.com/impromptu-in-a-sentence/][Impromptu]]

  =without preparation=

  - I’m not sure how many people will be able to attend the impromptu party.
  - Because Jane had an impromptu wedding, she didn’t send out invitations.
  - The singer was more than willing to perform an impromptu song at his friend’s concert.
  - At the site of the deadly crash, residents have created an impromptu shrine using flowers and teddy bears.



* [[https://wordsinasentence.com/impropriety-in-a-sentence/][Impropriety]]

  =an inappropriate deed or action=

  - The teacher was arrested for performing a sexual impropriety with a female student.
  - Soon the committee will decide if the politician committed an impropriety when he accepted money from the lobbyist.
  - As the head of the internal affairs unit, John was asked to investigate the police chief for an act of impropriety.
  - Since Bill was running for president, he had to avoid any instances of impropriety that would place him in a bad light.
  - Sadly, the senator is just the latest public official to be accused of sexual impropriety with an intern.
  - When the judge learned his impropriety had made the news, he decided to resign from the *bench*.
  - Jim’s parents kicked him out of their house when they learned about his behavioral impropriety.



