ruby/I.html



<div id="outline-container-org7dbb040" class="outline-2">
<h2 id="org7dbb040"><span class="section-number-2">26</span> <a href="https://wordsinasentence.com/impetuous-in-a-sentence/">Impetuous</a></h2>
<div class="outline-text-2" id="text-26">
<p>
<code>acting without thinking—done impulsively; sudden decision</code>
</p>

<ul class="org-ul">
<li>His impetuous behavior landed him in prison.</li>
<li>Because James is only seventeen, he tends to be impetuous at times.</li>
<li>Marrying someone you hardly know is an impetuous decision!</li>
<li>While I may have been impetuous as a teenager, I have become a patient adult.</li>
<li>Even though Warren was rumored to be impetuous, he actually put a great deal of thought into making important decisions.</li>
<li>The author describes the heroine as an impetuous young woman who would do anything to become famous.</li>
<li>When Constance drank too much, she made impetuous choices which often got her into trouble.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb5448e8" class="outline-2">
<h2 id="orgb5448e8"><span class="section-number-2">27</span> <a href="https://wordsinasentence.com/impiety-in-a-sentence/">Impiety</a></h2>
<div class="outline-text-2" id="text-27">
<p>
<code>lack of respect for God</code>
</p>

<ul class="org-ul">
<li>Speaking with impiety of holy things was a crime in the city-state, but few were ever prosecuted.</li>
<li>Admitting his transgression, the man confessed that he once showed impiety in regards to prayer.</li>
<li>With an air of impiety, the woman scoffed at the religious texts which she considered fiction.</li>
<li>Although he was raised in the church, the impiety of the pastor’s son showed in his use of God’s name in vain.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcc2fd45" class="outline-2">
<h2 id="orgcc2fd45"><span class="section-number-2">28</span> <a href="https://wordsinasentence.com/impolitic-in-a-sentence/">Impolitic</a></h2>
<div class="outline-text-2" id="text-28">
<p>
<code>foolish</code>
</p>

<ul class="org-ul">
<li>I realized it was an impolitic idea to talk on my cell phone and walk through a curvy path in the woods since I am aware of my clumsiness and no sense of direction.</li>
<li>An impolitic decision to text and drive a car at the same time is dangerous because texting could distract you and cause a severe accident.</li>
<li>When the deceased’s cousin wore a bright red outfit with a bright hot pink hat to the funeral, the rest of the family didn’t get upset but figured it was just the cousin’s impolitic way of getting attention.</li>
<li>It is not only an impolitic action to yell fire in a crowded theater, but it could also get you in trouble since it will could cause injuries.</li>
</ul>
</div>
</div>



<div id="outline-container-org4559d6a" class="outline-2">
<h2 id="org4559d6a"><span class="section-number-2">29</span> <a href="https://wordsinasentence.com/imponderable-in-a-sentence/">Imponderable</a></h2>
<div class="outline-text-2" id="text-29">
<p>
<code>difficult or impossible to comprehend or evaluate</code>
</p>

<ul class="org-ul">
<li>She wanted to enter the contest but guessing the amount of jelly beans in the barrel was imponderable.</li>
<li>I focused on the imponderable math problem for several hours before I realized that it was unsolvable.</li>
<li>Imponderable at best, the word problem confused even the gifted students.</li>
<li>Asking an imponderable question, the game show host was sure that he had stumped the contestant.</li>
</ul>
</div>
</div>


<div id="outline-container-org855b0a6" class="outline-2">
<h2 id="org855b0a6"><span class="section-number-2">30</span> <a href="https://wordsinasentence.com/imposter-in-a-sentence/">Imposter</a></h2>
<div class="outline-text-2" id="text-30">
<p>
<code>a person who pretends to be someone else in order to trick and deceive people</code>
</p>

<ul class="org-ul">
<li>The imposter mimicked our dad’s voice to perfection.</li>
<li>Bruce is an imposter who deceives others by claiming to be one of their relatives.</li>
<li>I ripped off the imposter's mask, exposing him as a fraud.</li>
<li>Jane is an imposter who always hides her identity.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfcd6805" class="outline-2">
<h2 id="orgfcd6805"><span class="section-number-2">31</span> <a href="https://wordsinasentence.com/imposture-in-a-sentence/">Imposture</a></h2>
<div class="outline-text-2" id="text-31">
<p>
<code>the act of deceiving while using a fake identity</code>
</p>

<ul class="org-ul">
<li>The scam artist’s imposture involved convincing elderly people he could increase their retirement incomes for a small fee.</li>
<li>If the heiress has been <b>taken in</b> <code>被骗</code> by John’s imposture, she may be in danger of losing her fortune to a conman.</li>
<li>William knew if he did not continue his imposture he would be executed for pretending to be the dictator’s long-lost brother.</li>
<li>As soon as the immigration officer saw the fake passport, he knew the traveler was taking part in an imposture.</li>
</ul>
</div>
</div>



<div id="outline-container-org4c03726" class="outline-2">
<h2 id="org4c03726"><span class="section-number-2">32</span> <a href="https://wordsinasentence.com/impound-in-a-sentence/">Impound</a></h2>
<div class="outline-text-2" id="text-32">
<p>
<code>to remove and keep property by law</code>
</p>

<ul class="org-ul">
<li>After stopping payments on their new car, the bank would impound their car in a secured lot until the couple would pay the overdue amount.</li>
<li>It was likely that the court would decide to impound the important documents from the troubled company after a <b>whistleblower</b> <code>告密者</code> declared the company was lying to its stakeholders.</li>
<li>Rental furniture companies may have to require a payment plan or impound the furniture in their store until the money is compensated.</li>
<li>Fred’s face changed from shock to anger when he received a notice to impound his television set on the basis of a loan repayment.</li>
</ul>
</div>
</div>



<div id="outline-container-org0823074" class="outline-2">
<h2 id="org0823074"><span class="section-number-2">33</span> <a href="https://wordsinasentence.com/impressionable-in-a-sentence/">Impressionable</a></h2>
<div class="outline-text-2" id="text-33">
<p>
<code>swayed easily</code>
</p>

<ul class="org-ul">
<li>It was easy for the older boys to convince the impressionable young boy to shoplift.</li>
<li>According to research, the terrorist organization seeks out impressionable young minds when recruiting members.</li>
<li>Pedophiles are known to look for impressionable children they can easily manipulate.</li>
<li>As a marketing executive, Keith knows the importance of targeting impressionable kids.</li>
</ul>
</div>
</div>



<div id="outline-container-orgbbbc80b" class="outline-2">
<h2 id="orgbbbc80b"><span class="section-number-2">34</span> <a href="https://wordsinasentence.com/impromptu-in-a-sentence/">Impromptu</a></h2>
<div class="outline-text-2" id="text-34">
<p>
<code>without preparation</code>
</p>

<ul class="org-ul">
<li>I’m not sure how many people will be able to attend the impromptu party.</li>
<li>Because Jane had an impromptu wedding, she didn’t send out invitations.</li>
<li>The singer was more than willing to perform an impromptu song at his friend’s concert.</li>
<li>At the site of the deadly crash, residents have created an impromptu shrine using flowers and teddy bears.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcfbf8fc" class="outline-2">
<h2 id="orgcfbf8fc"><span class="section-number-2">35</span> <a href="https://wordsinasentence.com/impropriety-in-a-sentence/">Impropriety</a></h2>
<div class="outline-text-2" id="text-35">
<p>
<code>an inappropriate deed or action</code>
</p>

<ul class="org-ul">
<li>The teacher was arrested for performing a sexual impropriety with a female student.</li>
<li>Soon the committee will decide if the politician committed an impropriety when he accepted money from the lobbyist.</li>
<li>As the head of the internal affairs unit, John was asked to investigate the police chief for an act of impropriety.</li>
<li>Since Bill was running for president, he had to avoid any instances of impropriety that would place him in a bad light.</li>
<li>Sadly, the senator is just the latest public official to be accused of sexual impropriety with an intern.</li>
<li>When the judge learned his impropriety had made the news, he decided to resign from the <b>bench</b>.</li>
<li>Jim’s parents kicked him out of their house when they learned about his behavioral impropriety.</li>
</ul>
</div>
</div>
