ruby/I.org
* [[https://wordsinasentence.com/improvident-in-a-sentence/][Improvident]]

  =not preparing for the financial future; reckless=

  - Jessie handles all of the household financial matters because of his wife’s improvident spending habits.
  - Because Tom was improvident in his younger years, he now lives on a fixed income.
  - The improvident loan officer foolishly approved loans for hundreds of applicants with poor credit histories.
  - As an improvident young woman, Helen never thought about saving for her retirement.
  - My improvident sister often spends her bill money on clothes and shoes.
  - Since your income is so low, it would be improvident of you to purchase a new car right now.
  - John’s improvident decision led him to invest in a business before performing adequate research.



* [[https://wordsinasentence.com/improvise-in-a-sentence/][Improvise]]

  =to create something as needed=

  - Since I forgot my lines, I tried to improvise the role during the audition.
  - The miners had to improvise a way out of the cave when the walls collapsed.
  - When the teleprompter stopped working, the news anchor had to improvise the last portion of the broadcast.
  - Jane did not have enough eggs for the recipe so she decided to improvise by adding another ingredient.



* [[https://wordsinasentence.com/imprudent-in-a-sentence/][Imprudent]]

  =quick to act without thoughts of the consequences=

  - Phil’s imprudent turn on the highway caused a six-car accident.
  - When Ann booked the wedding chapel before receiving the proposal, everyone laughed at her imprudent decision.
  - Jackson’s imprudent attitude led him to think he could out *run the police* =作为一个警察=.
  - If Danielle does not stop being imprudent, she is going to get in serious legal trouble.
  - Patty’s imprudent choice to leave her younger sister home alone led her parents to revoke her driving privileges.
  - Because the wealthy playboy believed his father could get him out of anything, he never worried about his imprudent actions.
  - The company is looking for employees who carefully consider their options instead of acting in an imprudent manner.



* [[https://wordsinasentence.com/impudent-in-a-sentence/][Impudent]]

  =very rude; not showing respect for other people=

  - If the panhandler hadn’t been so impudent, I might have given him a couple of bucks.
  - Even though Mary needed a new vacuum cleaner, the impudent attitude of the sales clerk made her decide to leave the store.
  - Matt is an impudent scoundrel who doesn’t seem to respect rules or people.
  - He never admitted that he had eaten the leftover pizza, but I could tell from his impudent smirk that he was the guilty party.
  - In spite of the incessant stream of impudent questions, Mrs. Brown managed to hold on to her composure and finish the lesson on sex education.
  - The impudent court jester was able to get away with insulting the royal family when anyone else would have lost their head.
  - His story was a lot of impudent nonsense, but at least it was entertaining.



* [[https://wordsinasentence.com/impugn-in-a-sentence/][Impugn]]

  =to attack as false or questionable=

  - The mayor leaked news of the arrest to the media to impugn his opponent’s character.
  - How dare you impugn the integrity of our local councilman simply because of a Twitter rumor!
  - When the prosecutor tried to impugn the defendant’s character, the defense lawyer jumped to his feet and made an objection.
  - Everyone was shocked when the student tried to impugn his lab teacher’s findings.
  - Although I had my ticket in my hand, the annoying attendant tried to impugn my entrance into the theater.
  - The confident politician felt no need to impugn the motives of his election challengers.
  - Since my daughter has not passed a single math test this year, I strongly impugn her teacher’s instructional skills.



* [[https://wordsinasentence.com/impunity-in-a-sentence/][Impunity]]

  =free from punishment; exempt from the consequences=

  - In exchange for her testimony, the accomplice received impunity from prosecution.
  - Despite the heinous nature of the crimes they committed, the old men received impunity from the court because of their ages.
  - Often, foreign ambassadors feel they can do whatever they want because of the impunity afforded to them by visiting governments.
  - I am appalled by the fact the man who killed his girlfriend was allowed to walk away with impunity!
  - Because the internet is basically a lawless civilization, many people commit crimes online with impunity.
  - If you are religious, you probably believe God will withdraw impunity in the end and punish all the wicked in their final days.
  - International groups such as the United Nations work hard to make sure political leaders do not receive impunity for horrible acts.



* [[https://wordsinasentence.com/impute-in-a-sentence/][Impute]]

  =to lay the responsibility or blame on someone else=

  - It was wrong of me to impute you for the failure of the dinner party when I was the one who did not properly plan the event.
  - Although Jake cannot impute anyone else for the robbery, he will not admit to committing the crime himself.
  - On Monday, Ellen will impute her failure to complete the project on her malfunctioning computer.
  - Even though my sister had broken the window, she tried to impute the damage onto me.
  - When the singer was asked about her awful performance, she tried to impute her mistakes to nervousness.
  - The foolish drunk driver tried to impute the accident on the bartender who made the strong drinks.
  - When my daughter received a failing grade in her math class, she attempted to impute her instructor’s teaching skills.



* [[https://wordsinasentence.com/inadvertent-in-a-sentence/][Inadvertent]]

  =not intentional; not on purpose; not conscious=

  - Because the principal neglected to turn off the microphone on the PA system, there was an inadvertent transmission of some very inappropriate language throughout the school.
  - After Mark made an inadvertent *disclosure* =秘闻= of the winner of the Super Bowl, I didn’t even bother to watch the recording I had so carefully planned.
  - I wonder how many inadvertent inventions were developed in the process of trying to discover something totally different.
  - Probably the most horrific consequences of violence are the inadvertent injuries or deaths of innocent bystanders.
  - Compared to all the bystanders who just stood by doing nothing, Don became an inadvertent hero by running up to the wrecked car and pulling out the frightened toddler.
  - Dr. Black recommended that I use one of those compartmented containers for my pills to reduce the risk of taking an inadvertent overdose.
  - After working on it for five hours, thank goodness I caught myself before I made an inadvertent deletion of the whole report.


