ruby/I.html



<div id="outline-container-org40f84cf" class="outline-2">
<h2 id="org40f84cf"><span class="section-number-2">36</span> <a href="https://wordsinasentence.com/improvident-in-a-sentence/">Improvident</a></h2>
<div class="outline-text-2" id="text-36">
<p>
<code>not preparing for the financial future; reckless</code>
</p>

<ul class="org-ul">
<li>Jessie handles all of the household financial matters because of his wife’s improvident spending habits.</li>
<li>Because Tom was improvident in his younger years, he now lives on a fixed income.</li>
<li>The improvident loan officer foolishly approved loans for hundreds of applicants with poor credit histories.</li>
<li>As an improvident young woman, Helen never thought about saving for her retirement.</li>
<li>My improvident sister often spends her bill money on clothes and shoes.</li>
<li>Since your income is so low, it would be improvident of you to purchase a new car right now.</li>
<li>John’s improvident decision led him to invest in a business before performing adequate research.</li>
</ul>
</div>
</div>



<div id="outline-container-org00f6190" class="outline-2">
<h2 id="org00f6190"><span class="section-number-2">37</span> <a href="https://wordsinasentence.com/improvise-in-a-sentence/">Improvise</a></h2>
<div class="outline-text-2" id="text-37">
<p>
<code>to create something as needed</code>
</p>

<ul class="org-ul">
<li>Since I forgot my lines, I tried to improvise the role during the audition.</li>
<li>The miners had to improvise a way out of the cave when the walls collapsed.</li>
<li>When the teleprompter stopped working, the news anchor had to improvise the last portion of the broadcast.</li>
<li>Jane did not have enough eggs for the recipe so she decided to improvise by adding another ingredient.</li>
</ul>
</div>
</div>



<div id="outline-container-orgd3b3972" class="outline-2">
<h2 id="orgd3b3972"><span class="section-number-2">38</span> <a href="https://wordsinasentence.com/imprudent-in-a-sentence/">Imprudent</a></h2>
<div class="outline-text-2" id="text-38">
<p>
<code>quick to act without thoughts of the consequences</code>
</p>

<ul class="org-ul">
<li>Phil’s imprudent turn on the highway caused a six-car accident.</li>
<li>When Ann booked the wedding chapel before receiving the proposal, everyone laughed at her imprudent decision.</li>
<li>Jackson’s imprudent attitude led him to think he could out <b>run the police</b> <code>作为一个警察</code>.</li>
<li>If Danielle does not stop being imprudent, she is going to get in serious legal trouble.</li>
<li>Patty’s imprudent choice to leave her younger sister home alone led her parents to revoke her driving privileges.</li>
<li>Because the wealthy playboy believed his father could get him out of anything, he never worried about his imprudent actions.</li>
<li>The company is looking for employees who carefully consider their options instead of acting in an imprudent manner.</li>
</ul>
</div>
</div>



<div id="outline-container-org2aa8c21" class="outline-2">
<h2 id="org2aa8c21"><span class="section-number-2">39</span> <a href="https://wordsinasentence.com/impudent-in-a-sentence/">Impudent</a></h2>
<div class="outline-text-2" id="text-39">
<p>
<code>very rude; not showing respect for other people</code>
</p>

<ul class="org-ul">
<li>If the panhandler hadn’t been so impudent, I might have given him a couple of bucks.</li>
<li>Even though Mary needed a new vacuum cleaner, the impudent attitude of the sales clerk made her decide to leave the store.</li>
<li>Matt is an impudent scoundrel who doesn’t seem to respect rules or people.</li>
<li>He never admitted that he had eaten the leftover pizza, but I could tell from his impudent smirk that he was the guilty party.</li>
<li>In spite of the incessant stream of impudent questions, Mrs. Brown managed to hold on to her composure and finish the lesson on sex education.</li>
<li>The impudent court jester was able to get away with insulting the royal family when anyone else would have lost their head.</li>
<li>His story was a lot of impudent nonsense, but at least it was entertaining.</li>
</ul>
</div>
</div>



<div id="outline-container-orge5f593b" class="outline-2">
<h2 id="orge5f593b"><span class="section-number-2">40</span> <a href="https://wordsinasentence.com/impugn-in-a-sentence/">Impugn</a></h2>
<div class="outline-text-2" id="text-40">
<p>
<code>to attack as false or questionable</code>
</p>

<ul class="org-ul">
<li>The mayor leaked news of the arrest to the media to impugn his opponent’s character.</li>
<li>How dare you impugn the integrity of our local councilman simply because of a Twitter rumor!</li>
<li>When the prosecutor tried to impugn the defendant’s character, the defense lawyer jumped to his feet and made an objection.</li>
<li>Everyone was shocked when the student tried to impugn his lab teacher’s findings.</li>
<li>Although I had my ticket in my hand, the annoying attendant tried to impugn my entrance into the theater.</li>
<li>The confident politician felt no need to impugn the motives of his election challengers.</li>
<li>Since my daughter has not passed a single math test this year, I strongly impugn her teacher’s instructional skills.</li>
</ul>
</div>
</div>



<div id="outline-container-org0201892" class="outline-2">
<h2 id="org0201892"><span class="section-number-2">41</span> <a href="https://wordsinasentence.com/impunity-in-a-sentence/">Impunity</a></h2>
<div class="outline-text-2" id="text-41">
<p>
<code>free from punishment; exempt from the consequences</code>
</p>

<ul class="org-ul">
<li>In exchange for her testimony, the accomplice received impunity from prosecution.</li>
<li>Despite the heinous nature of the crimes they committed, the old men received impunity from the court because of their ages.</li>
<li>Often, foreign ambassadors feel they can do whatever they want because of the impunity afforded to them by visiting governments.</li>
<li>I am appalled by the fact the man who killed his girlfriend was allowed to walk away with impunity!</li>
<li>Because the internet is basically a lawless civilization, many people commit crimes online with impunity.</li>
<li>If you are religious, you probably believe God will withdraw impunity in the end and punish all the wicked in their final days.</li>
<li>International groups such as the United Nations work hard to make sure political leaders do not receive impunity for horrible acts.</li>
</ul>
</div>
</div>



<div id="outline-container-org2fc5454" class="outline-2">
<h2 id="org2fc5454"><span class="section-number-2">42</span> <a href="https://wordsinasentence.com/impute-in-a-sentence/">Impute</a></h2>
<div class="outline-text-2" id="text-42">
<p>
<code>to lay the responsibility or blame on someone else</code>
</p>

<ul class="org-ul">
<li>It was wrong of me to impute you for the failure of the dinner party when I was the one who did not properly plan the event.</li>
<li>Although Jake cannot impute anyone else for the robbery, he will not admit to committing the crime himself.</li>
<li>On Monday, Ellen will impute her failure to complete the project on her malfunctioning computer.</li>
<li>Even though my sister had broken the window, she tried to impute the damage onto me.</li>
<li>When the singer was asked about her awful performance, she tried to impute her mistakes to nervousness.</li>
<li>The foolish drunk driver tried to impute the accident on the bartender who made the strong drinks.</li>
<li>When my daughter received a failing grade in her math class, she attempted to impute her instructor’s teaching skills.</li>
</ul>
</div>
</div>



<div id="outline-container-org05070a6" class="outline-2">
<h2 id="org05070a6"><span class="section-number-2">43</span> <a href="https://wordsinasentence.com/inadvertent-in-a-sentence/">Inadvertent</a></h2>
<div class="outline-text-2" id="text-43">
<p>
<code>not intentional; not on purpose; not conscious</code>
</p>

<ul class="org-ul">
<li>Because the principal neglected to turn off the microphone on the PA system, there was an inadvertent transmission of some very inappropriate language throughout the school.</li>
<li>After Mark made an inadvertent <b>disclosure</b> <code>秘闻</code> of the winner of the Super Bowl, I didn’t even bother to watch the recording I had so carefully planned.</li>
<li>I wonder how many inadvertent inventions were developed in the process of trying to discover something totally different.</li>
<li>Probably the most horrific consequences of violence are the inadvertent injuries or deaths of innocent bystanders.</li>
<li>Compared to all the bystanders who just stood by doing nothing, Don became an inadvertent hero by running up to the wrecked car and pulling out the frightened toddler.</li>
<li>Dr. Black recommended that I use one of those compartmented containers for my pills to reduce the risk of taking an inadvertent overdose.</li>
<li>After working on it for five hours, thank goodness I caught myself before I made an inadvertent deletion of the whole report.</li>
</ul>
</div>
</div>
