ruby/I.org
* [[https://wordsinasentence.com/inane-in-a-sentence/][Inane]]

  =lacking sense; stupid=

  - When my sisters and I get together, we tend to do inane things like dressing up as cartoon characters.
  - Even though Cara is a math genius, she acts inane in class because she likes getting extra attention from the handsome math professor.
  - Your idea about eating plastic fruit is totally inane.
  - Although Jason has a college degree, he still behaves in an inane manner at times.
  - My teacher is really good about ignoring inane comments from the clowns in our class.
  - Even though a lot of people think Margaret is inane, she is really extremely intelligent.
  - Whenever my *lovestruck* brother looks at his girlfriend, he has an inane grin on his face.




* [[https://wordsinasentence.com/incandescent-in-a-sentence/][Incandescent]]

  =extremely bright=

  - Our incandescent Christmas lights illuminate the living room.
  - To preserve your eyesight, you should avoid looking directly at the incandescent sun.
  - Incandescent bulbs produce light when a current heats a filament and gives off a glow.
  - Before we put the incandescent lights in the front yard, we could barely see anything at night.



* [[https://wordsinasentence.com/incendiary-in-a-sentence/][Incendiary]]

  =explosive=

  - Because Dad had come home in one of his incendiary moods, we kids hid in our rooms to avoid causing him to blow up.
  - Following the attack, the survivors were rushed to the base hospital with severe burns from the incendiary weapons.
  - If the reporter didn’t mean to cause such an uproar among the public, he shouldn’t have written such an incendiary article about the city leaders.
  - Although the investigation indicated the arsonist must have used some kind of incendiary device to start the fire, the police could find no traces of it.
  - When someone brought up the existence of Satan during the discussion, an incendiary argument erupted during which there were heated exchanges on both sides of the issue.
  - At the end of the movie Easy A, Emma Stone’s character gave an incendiary performance to ignite the curiosity of the students so that they would watch her podcast.
  - As a highly strategic politician, he is known to pepper his speeches with incendiary language to arouse his listeners’ emotions.



* [[https://wordsinasentence.com/incessant-in-a-sentence/][Incessant]]

  =without interruption; not letting up=

  - The incessant crying of a baby drives me nuts!
  - My sister's incessant phone conversation with her boyfriend may never end.
  - With this incessant rainfall, we might get flooded out.
  - End the incessant crime with a neighborhood watch program.
  - I have hours upon hours of movies for incessant entertainment!
  - Breathing must be incessant to stay alive.
  - That soap opera has been on air for an incessant amount of time, but lasting shows eventually come to an end.



* [[https://wordsinasentence.com/incident-in-a-sentence/][Incident]]

  =a happening or event=

  - The police will file a report on the incident.
  - After the fighting incident, Rick was suspended from school.
  - Several fraternity members were arrested after the hazing incident.
  - Do you think the missile incident is going to trigger a war between the countries?


* [[https://wordsinasentence.com/incidence-in-a-sentence/][Incidence]]

  =the number of times something happens, usually of something bad=

  - Eric’s family has a high incidence of death due to their genetic coding.
  - Cory’s cancer is rare, with an incidence of one in 300,000 people.
  - Overweight people tend to have a high incidence of sleep apnea.
  - The incidence of hay fever skyrocketed, forcing the school to close its doors.


* [[https://wordsinasentence.com/incoherent-in-a-sentence/][Incoherent]]

  =not logical or easily understood=

  - After drinking too much at the party, Larry became incoherent and made very little sense.
  - The speaker spoke so rapidly that his words were incoherent to most in the audience.
  - Because my aunt suffered a stroke, she is mostly incoherent and unable to express herself well.
  - The workings of the government are usually incoherent to the general public.
  - After seeing the murders, Scarlett was completely incoherent when she spoke to the police officers.
  - During his performance, Hank was so nervous that his song was incoherent.
  - Because Michelle had stayed awake for four days, her ramblings were somewhat incoherent.



* [[https://wordsinasentence.com/inconsequential-in-a-sentence/][Inconsequential]]

  =not important or significant=

  - When you walk with your head down and eyes lowered, you come across as being inconsequential.
  - At the end of the day, everything is inconsequential except for family.
  - Worrying about inconsequential tasks will prevent you from doing projects which really matter.
  - It was decided that Pluto was too inconsequential to be a planet.
  - Because the suspect’s charge was inconsequential, the judge let him out on bail.
  - Compared to the seven car pileup on the highway yesterday, my little fender bender is inconsequential.
  - While you may consider my feelings to be inconsequential, they are very important to me.



* [[https://wordsinasentence.com/inconsolable-in-a-sentence/][Inconsolable]]

  =not capable of being consoled=

  - The old man was inconsolable at his wife’s funeral.
  - After our kitten died, my youngest son was inconsolable for weeks.
  - The gymnast was inconsolable after learning she didn’t make the Olympic team.
  - When my daughter is grieving and inconsolable, she doesn’t enjoy any of her normal activities.



* [[https://wordsinasentence.com/incorporate-in-a-sentence/][Incorporate]]

  =to include or mix=

  - In order to provide a complete report, Henry and his staff incorporate the graphs and charts into the written text.
  - Always incorporate both proper nouns and action verbs into a fictional story so that it will be seem more realistic.
  - According to culinary guidelines, a chef should never incorporate cheese into a fish dish.
  - While tutoring a foreign student, I try to incorporate as many slang words as possible so she fully understands how Americans speak.



