ruby/I.html


<div id="outline-container-org5a87b9e" class="outline-2">
<h2 id="org5a87b9e"><span class="section-number-2">44</span> <a href="https://wordsinasentence.com/inane-in-a-sentence/">Inane</a></h2>
<div class="outline-text-2" id="text-44">
<p>
<code>lacking sense; stupid</code>
</p>

<ul class="org-ul">
<li>When my sisters and I get together, we tend to do inane things like dressing up as cartoon characters.</li>
<li>Even though Cara is a math genius, she acts inane in class because she likes getting extra attention from the handsome math professor.</li>
<li>Your idea about eating plastic fruit is totally inane.</li>
<li>Although Jason has a college degree, he still behaves in an inane manner at times.</li>
<li>My teacher is really good about ignoring inane comments from the clowns in our class.</li>
<li>Even though a lot of people think Margaret is inane, she is really extremely intelligent.</li>
<li>Whenever my <b>lovestruck</b> brother looks at his girlfriend, he has an inane grin on his face.</li>
</ul>
</div>
</div>




<div id="outline-container-orgafe880b" class="outline-2">
<h2 id="orgafe880b"><span class="section-number-2">45</span> <a href="https://wordsinasentence.com/incandescent-in-a-sentence/">Incandescent</a></h2>
<div class="outline-text-2" id="text-45">
<p>
<code>extremely bright</code>
</p>

<ul class="org-ul">
<li>Our incandescent Christmas lights illuminate the living room.</li>
<li>To preserve your eyesight, you should avoid looking directly at the incandescent sun.</li>
<li>Incandescent bulbs produce light when a current heats a filament and gives off a glow.</li>
<li>Before we put the incandescent lights in the front yard, we could barely see anything at night.</li>
</ul>
</div>
</div>



<div id="outline-container-orgac5fb13" class="outline-2">
<h2 id="orgac5fb13"><span class="section-number-2">46</span> <a href="https://wordsinasentence.com/incendiary-in-a-sentence/">Incendiary</a></h2>
<div class="outline-text-2" id="text-46">
<p>
<code>explosive</code>
</p>

<ul class="org-ul">
<li>Because Dad had come home in one of his incendiary moods, we kids hid in our rooms to avoid causing him to blow up.</li>
<li>Following the attack, the survivors were rushed to the base hospital with severe burns from the incendiary weapons.</li>
<li>If the reporter didn’t mean to cause such an uproar among the public, he shouldn’t have written such an incendiary article about the city leaders.</li>
<li>Although the investigation indicated the arsonist must have used some kind of incendiary device to start the fire, the police could find no traces of it.</li>
<li>When someone brought up the existence of Satan during the discussion, an incendiary argument erupted during which there were heated exchanges on both sides of the issue.</li>
<li>At the end of the movie Easy A, Emma Stone’s character gave an incendiary performance to ignite the curiosity of the students so that they would watch her podcast.</li>
<li>As a highly strategic politician, he is known to pepper his speeches with incendiary language to arouse his listeners’ emotions.</li>
</ul>
</div>
</div>



<div id="outline-container-org2eaace9" class="outline-2">
<h2 id="org2eaace9"><span class="section-number-2">47</span> <a href="https://wordsinasentence.com/incessant-in-a-sentence/">Incessant</a></h2>
<div class="outline-text-2" id="text-47">
<p>
<code>without interruption; not letting up</code>
</p>

<ul class="org-ul">
<li>The incessant crying of a baby <b>drives me nuts</b>!</li>
<li>My sister's incessant phone conversation with her boyfriend may never end.</li>
<li>With this incessant rainfall, we might get flooded out.</li>
<li>End the incessant crime with a neighborhood watch program.</li>
<li>I have hours upon hours of movies for incessant entertainment!</li>
<li>Breathing must be incessant to stay alive.</li>
<li>That soap opera has been on air for an incessant amount of time, but lasting shows eventually come to an end.</li>
</ul>
</div>
</div>



<div id="outline-container-org2aebb2d" class="outline-2">
<h2 id="org2aebb2d"><span class="section-number-2">48</span> <a href="https://wordsinasentence.com/incident-in-a-sentence/">Incident</a></h2>
<div class="outline-text-2" id="text-48">
<p>
<code>a happening or event</code>
</p>

<ul class="org-ul">
<li>The police will file a report on the incident.</li>
<li>After the fighting incident, Rick was suspended from school.</li>
<li>Several fraternity members were arrested after the <b>hazing</b> <code>捉弄</code> incident.</li>
<li>Do you think the missile incident is going to trigger a war between the countries?</li>
</ul>
</div>
</div>


<div id="outline-container-org4adc692" class="outline-2">
<h2 id="org4adc692"><span class="section-number-2">49</span> <a href="https://wordsinasentence.com/incidence-in-a-sentence/">Incidence</a></h2>
<div class="outline-text-2" id="text-49">
<p>
<code>the number of times something happens, usually of something bad</code>
</p>

<ul class="org-ul">
<li>Eric’s family has a high incidence of death due to their genetic coding.</li>
<li>Cory’s cancer is rare, with an incidence of one in 300,000 people.</li>
<li>Overweight people tend to have a high incidence of sleep apnea.</li>
<li>The incidence of hay fever skyrocketed, forcing the school to close its doors.</li>
</ul>
</div>
</div>


<div id="outline-container-org326213c" class="outline-2">
<h2 id="org326213c"><span class="section-number-2">50</span> <a href="https://wordsinasentence.com/incoherent-in-a-sentence/">Incoherent</a></h2>
<div class="outline-text-2" id="text-50">
<p>
<code>not logical or easily understood</code>
</p>

<ul class="org-ul">
<li>After drinking too much at the party, Larry became incoherent and made very little sense.</li>
<li>The speaker spoke so rapidly that his words were incoherent to most in the audience.</li>
<li>Because my aunt suffered a stroke, she is mostly incoherent and unable to express herself well.</li>
<li>The workings of the government are usually incoherent to the general public.</li>
<li>After seeing the murders, Scarlett was completely incoherent when she spoke to the police officers.</li>
<li>During his performance, Hank was so nervous that his song was incoherent.</li>
<li>Because Michelle had stayed awake for four days, her ramblings were somewhat incoherent.</li>
</ul>
</div>
</div>



<div id="outline-container-org5ef1531" class="outline-2">
<h2 id="org5ef1531"><span class="section-number-2">51</span> <a href="https://wordsinasentence.com/inconsequential-in-a-sentence/">Inconsequential</a></h2>
<div class="outline-text-2" id="text-51">
<p>
<code>not important or significant</code>
</p>

<ul class="org-ul">
<li>When you walk with your head down and eyes lowered, you come across as being inconsequential.</li>
<li>At the end of the day, everything is inconsequential except for family.</li>
<li>Worrying about inconsequential tasks will prevent you from doing projects which really matter.</li>
<li>It was decided that Pluto was too inconsequential to be a planet.</li>
<li>Because the suspect’s charge was inconsequential, the judge let him out on bail.</li>
<li>Compared to the seven car pileup on the highway yesterday, my little <b>fender bender</b> <code>小交通事故</code> is inconsequential.</li>
<li>While you may consider my feelings to be inconsequential, they are very important to me.</li>
</ul>
</div>
</div>



<div id="outline-container-org036491b" class="outline-2">
<h2 id="org036491b"><span class="section-number-2">52</span> <a href="https://wordsinasentence.com/inconsolable-in-a-sentence/">Inconsolable</a></h2>
<div class="outline-text-2" id="text-52">
<p>
<code>not capable of being consoled</code>
</p>

<ul class="org-ul">
<li>The old man was inconsolable at his wife’s funeral.</li>
<li>After our kitten died, my youngest son was inconsolable for weeks.</li>
<li>The gymnast was inconsolable after learning she didn’t make the Olympic team.</li>
<li>When my daughter is grieving and inconsolable, she doesn’t enjoy any of her normal activities.</li>
</ul>
</div>
</div>



<div id="outline-container-orga123515" class="outline-2">
<h2 id="orga123515"><span class="section-number-2">53</span> <a href="https://wordsinasentence.com/incorporate-in-a-sentence/">Incorporate</a></h2>
<div class="outline-text-2" id="text-53">
<p>
<code>to include or mix</code>
</p>

<ul class="org-ul">
<li>In order to provide a complete report, Henry and his staff incorporate the graphs and charts into the written text.</li>
<li>Always incorporate both proper nouns and action verbs into a fictional story so that it will be seem more realistic.</li>
<li>According to culinary guidelines, a chef should never incorporate cheese into a fish dish.</li>
<li>While tutoring a foreign student, I try to incorporate as many slang words as possible so she fully understands how Americans speak.</li>
</ul>
</div>
</div>
