ruby/I.org
* [[https://wordsinasentence.com/incorrigible-in-a-sentence/][Incorrigible]]

  =not capable of being reformed=

  - Because my daughter’s behavior is incorrigible, she might be grounded for at least a year.
  - Even after spending a year in jail, the young man remains incorrigible and unafraid of the law.
  - Jake’s teachers described him as an incorrigible young man who was always getting into trouble.
  - Incorrigible kids sometimes become adults in prison.
  - Are you so incorrigible that you cannot be good for two minutes?
  - Santa Claus never brings presents to incorrigible children.
  - My daughter is not having a birthday party because of her incorrigible behavior.




* [[https://wordsinasentence.com/incumbent-in-a-sentence/][Incumbent]]

  =the person or group that currently has the title or position=

  - After twenty years in office, the incumbent politician is finally retiring from politics.
  - The incumbent president of the company is resigning from office so a younger person can take control of the business.
  - If the incumbent governor dies, his lieutenant governor will take over his office.
  - The incumbent city councilman barely retained his seat in the election.
  - As the incumbent committee chairman, it is my responsibility to choose my replacement from among the other committee members.
  - Because I do not have season tickets, I have to wait until the incumbent ticket holders purchase their playoff seats before I can buy my own.
  - Since the voter turnout was low, all of the incumbent politicians will remain in office for the next two years.



* [[https://wordsinasentence.com/indefatigable-in-a-sentence/][Indefatigable]]

  =never showing signs of getting tired=

  - The director of the homeless shelter is an indefatigable woman who works almost eighteen hours every day.
  - If it were not for the indefatigable actions of the teacher’s union, the public schools in our city would have closed down a long time ago.
  - After losing her son in a car accident, April became an indefatigable promoter of teen driver training.
  - Because of Helen’s indefatigable efforts, the children’s charity was able to raise over a million dollars for a new library.
  - Even when he was threatened, the civil rights leader still had indefatigable work ethics.
  - Because my mother never slows down, everyone considers her to be indefatigable.
  - In order to be a model, you need to have indefatigable patience.


* [[https://wordsinasentence.com/indenture-in-a-sentence/][Indenture]]

  =a legal and binding contract=

  - The attorney had his client to sign the indenture before officially beginning work on his case.
  - A copy of the trust indenture can be found in a file with the company’s other legal contracts.
  - Proposing amendments to the initial contract, the CEO hoped to make the indenture more favorable towards his company.
  - Although the couple signed the indenture before marrying, the husband hoped the prenuptial agreement would be ruled void during divorce proceedings.



* [[https://wordsinasentence.com/indigenous-in-a-sentence/][Indigenous]]

  =produced, living, or existing naturally=

  -  The class of students enjoyed learning about unusual animals that are indigenous and found naturally in the wild in North America.
  - Because all of the ingredients of the product are found in the walls of desert caves, the final product is considered to be indigenous to the desert.
  - The marine scientists were confused when they found a species of fish that was not indigenous to the ocean water.
  - Since the native tribes had no means of travelling, all of the food they ate was indigenous to their own communities.
  - As a tourist, I make a point of visiting the first citizens of a country, the indigenous people, so I can learn about the ways of the land.
  - Millions of miles away from other cities, the secluded town could only exist on items indigenous within its area.
  - Before Ted went overseas, he went to the trouble of learning the indigenous customs and languages of the countries he planned to visit.


* [[https://wordsinasentence.com/indigent-in-a-sentence/][Indigent]]

  =extremely poor=

  - The indigent man could not afford food or clothing.
  - In many indigent countries, people often go days without eating.
  - The government has a healthcare program for indigent individuals who cannot obtain their own medical plan.
  - Because Jack works for a lot of indigent clients, he does not earn a lot of money as an attorney.
  - Indigent people will often wait in line for hours to get food from the soup kitchens.
  - Since Dr. Smith is more concerned about making money than caring for ill individuals, he will not see indigent patients.
  - The indigent family was evicted from their home because they could not pay the rent.



* [[https://wordsinasentence.com/inept-in-a-sentence/][Inept]]

  =having or showing no skill=

  - The teenager was an inept driver who could not back out of his driveway without hitting something.
  - Although Janet had gone to cooking school for two years, she was still an inept cook.
  - The inept detective could not see the most obvious clues.
  - Because Marvin was an inept plumber, he rarely got paid for his services.
  - Mrs. Smith is an inept math instructor who cannot even teach the basic principles of the subject.
  - Since Jackie is socially inept, she does not go to many parties.
  - The president’s rivals said his military proposal showed how inept he was at planning wartime strategy.



* [[https://wordsinasentence.com/ineptitude-in-a-sentence/][Ineptitude]]

  =the quality of being unfit or inept=

  - Because of Bill’s ineptitude, he lost his job.
  - Clara’s ineptitude as a teacher has left her students completely unprepared for the state exam.
  - Since the doctor’s ineptitude led to my husband’s death, I filed a lawsuit against him.
  - The lawyer lost the case because of his ineptitude.



* [[https://wordsinasentence.com/inexorable-meaning-in-a-sentence/][Inexorable]]

  =not able to be persuaded or stopped by any means; stubborn=

  - Of course, the public is enraged by the inexorable rise in gas prices.
  - Following her husband's sudden death, Elaine went into an inexorable depressive state.
  - The inexorable truth is that Shelley is going to die within six months because she has cancer.
  - Because James hit a police officer while driving drunk, he knows it is an inexorable fact he will serve jail time.
  - As economists look at the gloomy statistics, they recognize an inexorable debt increase.
  - Mary did not want to watch the movie because she knew the plot contained an inexorable tragedy.
  - In his desire to make sure he was ready for the triathlon, Jason was inexorable when it came to following his training routine.



