ruby/I.html



<div id="outline-container-org31789d1" class="outline-2">
<h2 id="org31789d1"><span class="section-number-2">54</span> <a href="https://wordsinasentence.com/incorrigible-in-a-sentence/">Incorrigible</a></h2>
<div class="outline-text-2" id="text-54">
<p>
<code>not capable of being reformed</code>
</p>

<ul class="org-ul">
<li>Because my daughter’s behavior is incorrigible, she might be grounded for at least a year.</li>
<li>Even after spending a year in jail, the young man remains incorrigible and unafraid of the law.</li>
<li>Jake’s teachers described him as an incorrigible young man who was always getting into trouble.</li>
<li>Incorrigible kids sometimes become adults in prison.</li>
<li>Are you so incorrigible that you cannot be good for two minutes?</li>
<li>Santa Claus never brings presents to incorrigible children.</li>
<li>My daughter is not having a birthday party because of her incorrigible behavior.</li>
</ul>
</div>
</div>




<div id="outline-container-orgaeff09c" class="outline-2">
<h2 id="orgaeff09c"><span class="section-number-2">55</span> <a href="https://wordsinasentence.com/incumbent-in-a-sentence/">Incumbent</a></h2>
<div class="outline-text-2" id="text-55">
<p>
<code>the person or group that currently has the title or position</code>
</p>

<ul class="org-ul">
<li>After twenty years in office, the incumbent politician is finally retiring from politics.</li>
<li>The incumbent president of the company is resigning from office so a younger person can take control of the business.</li>
<li>If the incumbent governor dies, his lieutenant governor will take over his office.</li>
<li>The incumbent city councilman barely retained his seat in the election.</li>
<li>As the incumbent committee chairman, it is my responsibility to choose my replacement from among the other committee members.</li>
<li>Because I do not have season tickets, I have to wait until the incumbent ticket holders purchase their playoff seats before I can buy my own.</li>
<li>Since the voter turnout was low, all of the incumbent politicians will remain in office for the next two years.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb3a3ec1" class="outline-2">
<h2 id="orgb3a3ec1"><span class="section-number-2">56</span> <a href="https://wordsinasentence.com/indefatigable-in-a-sentence/">Indefatigable</a></h2>
<div class="outline-text-2" id="text-56">
<p>
<code>never showing signs of getting tired</code>
</p>

<ul class="org-ul">
<li>The director of the homeless shelter is an indefatigable woman who works almost eighteen hours every day.</li>
<li>If it were not for the indefatigable actions of the teacher’s union, the public schools in our city would have closed down a long time ago.</li>
<li>After losing her son in a car accident, April became an indefatigable promoter of teen driver training.</li>
<li>Because of Helen’s indefatigable efforts, the children’s charity was able to raise over a million dollars for a new library.</li>
<li>Even when he was threatened, the civil rights leader still had indefatigable work ethics.</li>
<li>Because my mother never slows down, everyone considers her to be indefatigable.</li>
<li>In order to be a model, you need to have indefatigable patience.</li>
</ul>
</div>
</div>


<div id="outline-container-org5b5a6c4" class="outline-2">
<h2 id="org5b5a6c4"><span class="section-number-2">57</span> <a href="https://wordsinasentence.com/indenture-in-a-sentence/">Indenture</a></h2>
<div class="outline-text-2" id="text-57">
<p>
<code>a legal and binding contract</code>
</p>

<ul class="org-ul">
<li>The attorney had his client to sign the indenture before officially beginning work on his case.</li>
<li>A copy of the trust indenture can be found in a file with the company’s other legal contracts.</li>
<li>Proposing amendments to the initial contract, the CEO hoped to make the indenture more favorable towards his company.</li>
<li>Although the couple signed the indenture before marrying, the husband hoped the <b>prenuptial</b> agreement would be ruled void during divorce proceedings.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc290f20" class="outline-2">
<h2 id="orgc290f20"><span class="section-number-2">58</span> <a href="https://wordsinasentence.com/indigenous-in-a-sentence/">Indigenous</a></h2>
<div class="outline-text-2" id="text-58">
<p>
<code>produced, living, or existing naturally</code>
</p>

<ul class="org-ul">
<li>The class of students enjoyed learning about unusual animals that are indigenous and found naturally in the wild in North America.</li>
<li>Because all of the ingredients of the product are found in the walls of desert caves, the final product is considered to be indigenous to the desert.</li>
<li>The marine scientists were confused when they found a species of fish that was not indigenous to the ocean water.</li>
<li>Since the native tribes had no means of travelling, all of the food they ate was indigenous to their own communities.</li>
<li>As a tourist, I make a point of visiting the first citizens of a country, the indigenous people, so I can learn about the ways of the land.</li>
<li>Millions of miles away from other cities, the secluded town could only exist on items indigenous within its area.</li>
<li>Before Ted went overseas, he went to the trouble of learning the indigenous customs and languages of the countries he planned to visit.</li>
</ul>
</div>
</div>


<div id="outline-container-org0856fe4" class="outline-2">
<h2 id="org0856fe4"><span class="section-number-2">59</span> <a href="https://wordsinasentence.com/indigent-in-a-sentence/">Indigent</a></h2>
<div class="outline-text-2" id="text-59">
<p>
<code>extremely poor</code>
</p>

<ul class="org-ul">
<li>The indigent man could not afford food or clothing.</li>
<li>In many indigent countries, people often go days without eating.</li>
<li>The government has a healthcare program for indigent individuals who cannot obtain their own medical plan.</li>
<li>Because Jack works for a lot of indigent clients, he does not earn a lot of money as an attorney.</li>
<li>Indigent people will often wait in line for hours to get food from the soup kitchens.</li>
<li>Since Dr. Smith is more concerned about making money than caring for ill individuals, he will not see indigent patients.</li>
<li>The indigent family was evicted from their home because they could not pay the rent.</li>
</ul>
</div>
</div>



<div id="outline-container-org28080b1" class="outline-2">
<h2 id="org28080b1"><span class="section-number-2">60</span> <a href="https://wordsinasentence.com/inept-in-a-sentence/">Inept</a></h2>
<div class="outline-text-2" id="text-60">
<p>
<code>having or showing no skill</code>
</p>

<ul class="org-ul">
<li>The teenager was an inept driver who could not back out of his driveway without hitting something.</li>
<li>Although Janet had gone to cooking school for two years, she was still an inept cook.</li>
<li>The inept detective could not see the most obvious clues.</li>
<li>Because Marvin was an inept plumber, he rarely got paid for his services.</li>
<li>Mrs. Smith is an inept math instructor who cannot even teach the basic principles of the subject.</li>
<li>Since Jackie is socially inept, she does not go to many parties.</li>
<li>The president’s rivals said his military proposal showed how inept he was at planning wartime strategy.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb773799" class="outline-2">
<h2 id="orgb773799"><span class="section-number-2">61</span> <a href="https://wordsinasentence.com/ineptitude-in-a-sentence/">Ineptitude</a></h2>
<div class="outline-text-2" id="text-61">
<p>
<code>the quality of being unfit or inept</code>
</p>

<ul class="org-ul">
<li>Because of Bill’s ineptitude, he lost his job.</li>
<li>Clara’s ineptitude as a teacher has left her students completely unprepared for the state exam.</li>
<li>Since the doctor’s ineptitude led to my husband’s death, I filed a lawsuit against him.</li>
<li>The lawyer lost the case because of his ineptitude.</li>
</ul>
</div>
</div>



<div id="outline-container-org9aab26f" class="outline-2">
<h2 id="org9aab26f"><span class="section-number-2">62</span> <a href="https://wordsinasentence.com/inexorable-meaning-in-a-sentence/">Inexorable</a></h2>
<div class="outline-text-2" id="text-62">
<p>
<code>not able to be persuaded or stopped by any means; stubborn</code>
</p>

<ul class="org-ul">
<li>Of course, the public is enraged by the inexorable rise in gas prices.</li>
<li>Following her husband's sudden death, Elaine went into an inexorable depressive state.</li>
<li>The inexorable truth is that Shelley is going to die within six months because she has cancer.</li>
<li>Because James hit a police officer while driving drunk, he knows it is an inexorable fact he will serve jail time.</li>
<li>As economists look at the gloomy statistics, they recognize an inexorable debt increase.</li>
<li>Mary did not want to watch the movie because she knew the plot contained an inexorable tragedy.</li>
<li>In his desire to make sure he was ready for the triathlon, Jason was inexorable when it came to following his training routine.</li>
</ul>
</div>
</div>
