ruby/I.org
* [[https://wordsinasentence.com/infantile-in-a-sentence/][Infantile]]

  =pertaining to infants=

  - Two adults began to squabble in a most infantile way, displaying behavior that was very inappropriate for their age.
  - Her pure blue infantile eyes looked up at me from the crib, making me feel fuzzy inside.
  - I hate listening to that morning radio show because people call in with comments that are so infantile and immature.
  - It seems obvious to me that the infantile cry is so unnerving for the purpose of grabbing the attention of an adult.



* [[https://wordsinasentence.com/infuse-in-a-sentence/][Infuse]]

  =to fill with a certain quality=

  - Cook the rice until you thoroughly infuse it with the taste of the herbs and spices you added.
  - Drop the pellet in and watch the dye infuse the water with color as you stir.
  - The subject’s hair was tested to see if the new conditioner could infuse all the way to the core.
  - I thought eating spinach would infuse my muscles with super strength like Popeye the Sailor Man when I was a kid.



* [[https://wordsinasentence.com/ingenuity-in-a-sentence/][Ingenuity]]

  =the capacity to find solutions for tough problems=

  - When Jack fixed the jeep, his friends were impressed with his mechanical ingenuity.
  - With ingenuity and imagination, the builder came up with a way to build the cabin on the very top of the mountain.
  - The wise hunter had the ingenuity to survive in the forest for three days without any camping supplies.
  - Because we do not have a lot of money, my mom often uses her ingenuity to make a single can of meat feed a growing family of five.
  - The doctor used his ingenuity to perform a complicated surgery while on a deserted island.
  - When Phil and Tara were stranded in the middle of the ocean, they had to use their ingenuity to signal for help.
  - Phone manufacturers are always looking for designers with ingenuity to create groundbreaking mobile phones.



* [[https://wordsinasentence.com/ingenuous-in-a-sentence/][Ingenuous]]

  =innocent; naive=

  - Jessica’s ingenuous nature made her an easy target for the con man.
  - While I do not consider myself ingenuous, I do not mind giving everyone at least one chance to do good.
  - The little boy’s ingenuous habit of constantly telling the truth made him unpopular at school.
  - To the defendant’s surprise, the judge found her innocent of the kidnapping charges because she was ingenuous and knew nothing about her boyfriend’s plans.
  - Everyone was surprised when the ingenuous librarian wore a prostitute costume to the Halloween party.
  - Although I am not usually a fan of the photographer’s work, these photographs do a fantastic job of capturing an ingenuous child during a peaceful sleep.
  - It was refreshing to see an ingenuous teenager watching cartoons in a room full of worldly teenagers who thought they were too old to do the same.



* [[https://wordsinasentence.com/ingest-in-a-sentence/][Ingest]]

  =to eat or drink something by swallowing or by taking it through the skin=

  - Trained assassins and military personnel used to hide cyanide pills on their back teeth so that in the event of capture, they could bite down and ingest the poison quick enough to die.
  - Because the athlete failed to ingest enough water, he quickly became dehydrated and lethargic.
  - If you accidentally ingest a toxic substance you should immediately call Poison Control or seek emergency assistance.
  - Snakes are able to ingest prey twice the size of their body by paralyzing them with their bite.



* [[https://wordsinasentence.com/ingrained-in-a-sentence/][Ingrained]]

  =established; firmly fixed=

  - Being right-handed was ingrained in me so that it was very difficult to write with my left hand.
  - My morning routine was ingrained in me so much so that if I missed a step, it threw off my entire day.
  - The new teacher wanted her rules and procedures ingrained in her students in order to promote a smoothly run classroom.
  - When I learned my times table, my mother played a song to help me memorize the numbers until they were ingrained in my memory.



* [[https://wordsinasentence.com/ingrate-in-a-sentence/][Ingrate]]

  =an ungrateful person=

  - When you do not appreciate your gifts, you are being an ingrate.
  - The bride was an ingrate who did not send out thank-you notes for her wedding presents.
  - As soon as James unwrapped his gift, he showed he was an ingrate by giving the item to someone else.
  - Katy is an ingrate who refuses to acknowledge any present that costs less than five hundred dollars.
  - After Liam won the team leader of the month award, he showed he was an ingrate by neglecting to thank his coworkers for their contributions.
  - My friend Janice never thanks me for paying for lunch so I view her as a bit of an ingrate.
  - Since April left the dinner party without thanking our hosts, she is considered to be an ingrate.



* [[https://wordsinasentence.com/ingratiate-in-a-sentence/][Ingratiate]]

  =to try to get someone's approval by doing or saying things that will please them=

  - Since the new teacher failed to ingratiate herself with the students, she found it hard to maintain an orderly classroom.
  - The con artist hoped to ingratiate himself into the wealthy widow’s life.
  - While I do like you a great deal, I am not willing to ingratiate myself into your life by telling you a bunch of lies.
  - Because Sarah wanted a raise, she decided to ingratiate herself with her boss by offering to work on the weekends.
  - If you are trying to ingratiate yourself to me by offering me chocolate, it is not going to work!
  - Although the prisoner did everything he could to ingratiate himself with the parole board, his parole was still denied.
  - To win the business contract, the vendor had to ingratiate himself with the office manager.


* [[https://wordsinasentence.com/inimitable-in-a-sentence/][Inimitable]]

  =something so special or unique, it's impossible to copy or imitate=

  - Every once in a while, a band comes along that is so unique they are completely inimitable.
  - Though he had lost the company a large sum of money, the owner would not fire him because he knew his talent was inimitable.
  - The basketball player knew his talents were inimitable, which caused his teammates to begin hating him.
  - Few writers can match the inimitable talent of Earnest Hemmingway.
  - The recipe was inimitable and even though she could taste certain ingredients she could not figure it out.
  - Try as he might, the magician found that his competitor’s routine was inimitable, leaving him unable to duplicate the trick.
  - Her talent was inimitable, which is why the show was canceled upon news of her death.



