ruby/I.html



<div id="outline-container-org148839e" class="outline-2">
<h2 id="org148839e"><span class="section-number-2">63</span> <a href="https://wordsinasentence.com/infantile-in-a-sentence/">Infantile</a></h2>
<div class="outline-text-2" id="text-63">
<p>
<code>pertaining to infants</code>
</p>

<ul class="org-ul">
<li>Two adults began to squabble in a most infantile way, displaying behavior that was very inappropriate for their age.</li>
<li>Her pure blue infantile eyes looked up at me from the crib, making me feel fuzzy inside.</li>
<li>I hate listening to that morning radio show because people call in with comments that are so infantile and immature.</li>
<li>It seems obvious to me that the infantile cry is so unnerving for the purpose of grabbing the attention of an adult.</li>
</ul>
</div>
</div>



<div id="outline-container-org5de683e" class="outline-2">
<h2 id="org5de683e"><span class="section-number-2">64</span> <a href="https://wordsinasentence.com/infuse-in-a-sentence/">Infuse</a></h2>
<div class="outline-text-2" id="text-64">
<p>
<code>to fill with a certain quality</code>
</p>

<ul class="org-ul">
<li>Cook the rice until you thoroughly infuse it with the taste of the herbs and spices you added.</li>
<li>Drop the <b>pellet</b> in and watch the dye infuse the water with color as you stir.</li>
<li>The subject’s hair was tested to see if the new conditioner could infuse all the way to the core.</li>
<li>I thought eating spinach would infuse my muscles with super strength like Popeye the Sailor Man when I was a kid.</li>
</ul>
</div>
</div>



<div id="outline-container-org346f856" class="outline-2">
<h2 id="org346f856"><span class="section-number-2">65</span> <a href="https://wordsinasentence.com/ingenuity-in-a-sentence/">Ingenuity</a></h2>
<div class="outline-text-2" id="text-65">
<p>
<code>the capacity to find solutions for tough problems</code>
</p>

<ul class="org-ul">
<li>When Jack fixed the jeep, his friends were impressed with his mechanical ingenuity.</li>
<li>With ingenuity and imagination, the builder came up with a way to build the cabin on the very top of the mountain.</li>
<li>The wise hunter had the ingenuity to survive in the forest for three days without any camping supplies.</li>
<li>Because we do not have a lot of money, my mom often uses her ingenuity to make a single can of meat feed a growing family of five.</li>
<li>The doctor used his ingenuity to perform a complicated surgery while on a deserted island.</li>
<li>When Phil and Tara were stranded in the middle of the ocean, they had to use their ingenuity to signal for help.</li>
<li>Phone manufacturers are always looking for designers with ingenuity to create groundbreaking mobile phones.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc4c90e5" class="outline-2">
<h2 id="orgc4c90e5"><span class="section-number-2">66</span> <a href="https://wordsinasentence.com/ingenuous-in-a-sentence/">Ingenuous</a></h2>
<div class="outline-text-2" id="text-66">
<p>
<code>innocent; naive</code>
</p>

<ul class="org-ul">
<li>Jessica’s ingenuous nature made her an easy target for the con man.</li>
<li>While I do not consider myself ingenuous, I do not mind giving everyone at least one chance to do good.</li>
<li>The little boy’s ingenuous habit of constantly telling the truth made him unpopular at school.</li>
<li>To the defendant’s surprise, the judge found her innocent of the kidnapping charges because she was ingenuous and knew nothing about her boyfriend’s plans.</li>
<li>Everyone was surprised when the ingenuous librarian wore a prostitute costume to the Halloween party.</li>
<li>Although I am not usually a fan of the photographer’s work, these photographs do a fantastic job of capturing an ingenuous child during a peaceful sleep.</li>
<li>It was refreshing to see an ingenuous teenager watching cartoons in a room full of worldly teenagers who thought they were too old to do the same.</li>
</ul>
</div>
</div>



<div id="outline-container-org51ba226" class="outline-2">
<h2 id="org51ba226"><span class="section-number-2">67</span> <a href="https://wordsinasentence.com/ingest-in-a-sentence/">Ingest</a></h2>
<div class="outline-text-2" id="text-67">
<p>
<code>to eat or drink something by swallowing or by taking it through the skin</code>
</p>

<ul class="org-ul">
<li>Trained assassins and military personnel used to hide <b>cyanide</b> pills on their back teeth so that in the event of capture, they could bite down and ingest the poison quick enough to die.</li>
<li>Because the athlete failed to ingest enough water, he quickly became dehydrated and lethargic.</li>
<li>If you accidentally ingest a toxic substance you should immediately call Poison Control or seek emergency assistance.</li>
<li>Snakes are able to ingest prey twice the size of their body by paralyzing them with their bite.</li>
</ul>
</div>
</div>



<div id="outline-container-org89a25e0" class="outline-2">
<h2 id="org89a25e0"><span class="section-number-2">68</span> <a href="https://wordsinasentence.com/ingrained-in-a-sentence/">Ingrained</a></h2>
<div class="outline-text-2" id="text-68">
<p>
<code>established; firmly fixed</code>
</p>

<ul class="org-ul">
<li>Being right-handed was ingrained in me so that it was very difficult to write with my left hand.</li>
<li>My morning routine was ingrained in me so much so that if I missed a step, it threw off my entire day.</li>
<li>The new teacher wanted her rules and procedures ingrained in her students in order to promote a smoothly run classroom.</li>
<li>When I learned my <b>times table</b> <code>乘法表</code>, my mother played a song to help me memorize the numbers until they were ingrained in my memory.</li>
</ul>
</div>
</div>



<div id="outline-container-org07e1d88" class="outline-2">
<h2 id="org07e1d88"><span class="section-number-2">69</span> <a href="https://wordsinasentence.com/ingrate-in-a-sentence/">Ingrate</a></h2>
<div class="outline-text-2" id="text-69">
<p>
<code>an ungrateful person</code>
</p>

<ul class="org-ul">
<li>When you do not appreciate your gifts, you are being an ingrate.</li>
<li>The bride was an ingrate who did not send out thank-you notes for her wedding presents.</li>
<li>As soon as James unwrapped his gift, he showed he was an ingrate by giving the item to someone else.</li>
<li>Katy is an ingrate who refuses to acknowledge any present that costs less than five hundred dollars.</li>
<li>After Liam won the team leader of the month award, he showed he was an ingrate by neglecting to thank his coworkers for their contributions.</li>
<li>My friend Janice never thanks me for paying for lunch so I view her as a bit of an ingrate.</li>
<li>Since April left the dinner party without thanking our hosts, she is considered to be an ingrate.</li>
</ul>
</div>
</div>



<div id="outline-container-org3e19c22" class="outline-2">
<h2 id="org3e19c22"><span class="section-number-2">70</span> <a href="https://wordsinasentence.com/ingratiate-in-a-sentence/">Ingratiate</a></h2>
<div class="outline-text-2" id="text-70">
<p>
<code>to try to get someone's approval by doing or saying things that will please them</code>
</p>

<p>
<code>*ingratiate oneself with somebody*</code>
</p>

<ul class="org-ul">
<li>Since the new teacher failed to ingratiate herself with the students, she found it hard to maintain an orderly classroom.</li>
<li>The con artist hoped to ingratiate himself into the wealthy widow’s life.</li>
<li>While I do like you a great deal, I am not willing to ingratiate myself into your life by telling you a bunch of lies.</li>
<li>Because Sarah wanted a raise, she decided to ingratiate herself with her boss by offering to work on the weekends.</li>
<li>If you are trying to ingratiate yourself to me by offering me chocolate, it is not going to work!</li>
<li>Although the prisoner did everything he could to ingratiate himself with the parole board, his parole was still denied.</li>
<li>To win the business contract, the vendor had to ingratiate himself with the office manager.</li>
</ul>
</div>
</div>


<div id="outline-container-org0b6d2b5" class="outline-2">
<h2 id="org0b6d2b5"><span class="section-number-2">71</span> <a href="https://wordsinasentence.com/inimitable-in-a-sentence/">Inimitable</a></h2>
<div class="outline-text-2" id="text-71">
<p>
<code>something so special or unique, it's impossible to copy or imitate</code>
</p>

<ul class="org-ul">
<li>Every once in a while, a band comes along that is so unique they are completely inimitable.</li>
<li>Though he had lost the company a large sum of money, the owner would not fire him because he knew his talent was inimitable.</li>
<li>The basketball player knew his talents were inimitable, which caused his teammates to begin hating him.</li>
<li>Few writers can match the inimitable talent of Earnest Hemmingway.</li>
<li>The recipe was inimitable and even though she could taste certain ingredients she could not figure it out.</li>
<li>Try as he might, the magician found that his competitor’s routine was inimitable, leaving him unable to duplicate the trick.</li>
<li>Her talent was inimitable, which is why the show was canceled upon news of her death.</li>
</ul>
</div>
</div>
