ruby/I.org
* [[https://wordsinasentence.com/injurious-in-a-sentence/][Injurious]]

  =causing injury=

  - Illegal drugs are injurious to your health.
  - The injurious stunt needed to be performed by trained professionals.
  - The perpetrator faced serious jail time because the attack proved injurious to his victim.
  - If you are not properly warmed up, performing any sport can become injurious.



* [[https://wordsinasentence.com/innate-in-a-sentence/][Innate]]

  =a quality or ability which you are born with, or which is present naturally=

  - Unlike both of her sisters who adore children, Elise does not have an innate desire to raise a family.
  - While I am naturally shy, my sister has the innate ability to charm everyone she meets.
  - Marilyn’s innate piano talent allowed her to play complicated pieces before she was six years of age.
  - Although some medical conditions are caused by factors outside the human body, others occur as a result of innate genetic defects.
  - Because an innate behavior occurs naturally, it can not be unlearned as easily as a taught behavior.
  - Few people can see the innate value of cotton until is converted into a finished product like a jacket or a blanket.
  -  Even though humans are born with a certain amount of innate immunity to diseases, they still require preventative medical care to ward off other conditions.



* [[https://wordsinasentence.com/insatiable-in-a-sentence/][Insatiable]]

  =never have enough of something=

  - After being lost in the desert for days, the dehydrated man figured that all the water in the world would not quench his insatiable thirst.
  - Exploring all of the caves in the western hemisphere did not even cure the adventurer’s insatiable curiosity for the unknown.
  - Barbara’s husband confronted his wife about her insatiable shopping habits which he knew would continue to increase their debt.
  - A teenage boy’s insatiable hunger always makes the parents wonder how he can eat so much food and still want more.



* [[https://wordsinasentence.com/insidious-in-a-sentence/][Insidious]]

  =something that is slowly and secretly causing harm=

  - The insidious playboy planned to con the heiress out of her fortune.
  - While Helen may seem like a nice woman, I believe she has an insidious side to her.
  - The car dealership used attractive insidious models to lure in buyers.
  - Although the medicine made Gabriel feel better at first, its effect was insidious and only lasted a short time.
  - Alcohol is an insidious beverage that convinces people to do silly things.
  - Because I was so trusting, I did not realize the insidious man was using me to get information about the bank where I worked.
  - The insidious witch put out cookies and candy to entrap naïve children.



* Insinuate

  - During the debate, the senator tried to insinuate his opponent was not qualified for office.
  - Many dictators use propaganda to insinuate fear among the public.
  - By searching my locker, you are trying to insinuate I stole the money!
  - Because Lamar was quite ambitious, he did everything possible to insinuate himself into his foreman’s favor.
  - Longing to be popular, the girl made several attempts to insinuate herself into the crowd of popular kids.
  - It would not surprise me if my mother tried to insinuate her preferences into my brother’s wedding plans.
  - Because my sister is a talented singer, she is often approached by agents who try to insinuate themselves into her career.

* [[https://wordsinasentence.com/insipid-in-a-sentence/][Insipid]]

  =dull or boring=

  - When you present, please do not be an insipid speaker who makes everyone fall asleep!
  - The soup lacks the right seasoning and tastes insipid.
  - Unless your goal is to watch an insipid movie that will bore you to death, do not go and see Hank Wolf’s latest film.
  - The little boy did not enjoy having to sit still during the insipid church service.
  - As Ryan is such an outgoing young man, he shocked everyone when he announced his engagement to his insipid coworker who rarely speaks.
  - Even the greatest actor in the world could not make this insipid role exciting!
  - Alone in the middle of the ocean, the survivor could think of nothing that would make the insipid days seem shorter.



* [[https://wordsinasentence.com/insolent-in-a-sentence/][Insolent]]

  =rude or impolite=

  - When the insolent young man yelled my name, I ignored him and walked towards my car.
  - The captain put the insolent soldier on report.
  - Because William was insolent to the principal, he got suspended from school for three days.
  - Betsy is an insolent girl who acts as though she has no manners at all.
  - At the party, Henry offended everyone with his insolent conduct.
  - The school bully constantly makes insolent remarks to younger students.
  - After I responded to the judge in an insolent voice, I was asked to leave the courtroom.



* [[https://wordsinasentence.com/instigate-in-a-sentence/][Instigate]]

  =to trigger something=

  - Justine hoped to instigate Will and Gail's separation by spreading false rumors about Will’s late nights at work.
  - Hopefully, the red band campaign will instigate a greater awareness of cancer prevention.
  - The road construction will definitely instigate major traffic delays during rush hour.
  - Because poor people often cannot afford things they need, poverty is a factor that is known to instigate crime.



* [[https://wordsinasentence.com/insular-in-a-sentence/][Insular]]

  =not interested in meeting anyone outside your own group or country, or not interested in learning new ideas or ways of doing things=

  - Because the insular man had lived on a deserted island for several years, he was not very good at making conversation.
  - The people who live on the mountain have insular personalities because they are not used to being around other members of society.
  - My grandparents’ insular attitudes make them very uninterested in what is going on outside their own lives.
  - Although I do not socialize a great deal, I do not have any insular traits as of a result of my self-imposed isolation.
  - Because you are a world traveler, you should not have such insular views.
  - The reclusive writer enjoyed his privacy and was content in his insular lifestyle.
  - Since the creation of the internet, few people are able to remain completely insular.



