ruby/I.org
* [[https://wordsinasentence.com/intemperate-in-a-sentence/][Intemperate]]

  =having problems with exercising control=

  - John has intemperate mood swings he cannot seem to control.
  - When Barbara drinks, she becomes intemperate and cannot regulate her actions.
  - Kelly’s intemperate behavior is closely related to her incurable habit of shoplifting.
  - Because Wayne has a mental disorder that makes him intemperate, his uncontrollable conduct is usually overlooked.



* [[https://wordsinasentence.com/interpolate-in-a-sentence/][Interpolate]]

  =to change something by adding material to it=

  - Since the author would often interpolate the stories of others by adding his own text, the critics did not view him as a real writer.
  - Today many singers interpolate their own words and music into classic songs in order to create new tunes.
  - Depending on how well my novel flows, my editor may interpolate additional descriptive sentences to give the tale more imagery.
  - With the addition of a few online quotes, Edward was able to completely interpolate his debate speech.



* [[https://wordsinasentence.com/intimate-in-a-sentence/][Intimate]]

  =not public; private=

  - Because I am a private person, I do not like to share intimate details about my home life.
  - My husband and I requested a secluded room in the restaurant so we could have an intimate dinner.
  - When the candles were lit, they gave the room an intimate mood.
  - Not only are Rick and I coworkers, but we also have an intimate relationship that we keep to ourselves.



* [[https://wordsinasentence.com/intimation-in-a-sentence/][Intimation]]

  =a sign or suggestion that something is likely to happen=

  - Because they destroyed so many lives, the recent bombings are a brutal intimation of immortality.
  - I hoped my girlfriend would accept the key as intimation that I wanted her to move in with me.
  - While it was not formally announced, an intimation was made that Jeff would receive the promotion.
  - When my friend died in a car crash, I saw it as intimation that nobody could live forever.
  - Jasmine could not believe her husband’s intimation that she was cheating on him.
  - Even though no statement had been released to the media, intimation has been made regarding the capture of the suspect.
  - Nate’s first intimation of illness came when he vomited all over the kitchen floor.



* [[https://wordsinasentence.com/intimidate-in-a-sentence/][Intimidate]]

  =to make afraid=

  - The mob tries to intimidate shop owners into paying protection fees.
  - Because Jim often attempts to intimidate younger children, he is considered a bully.
  - The dictator tries to intimidate his enemies with verbal threats.
  - While in court, the defendant tried to intimidate the jury with menacing looks.



* [[https://wordsinasentence.com/intransigent-in-a-sentence/][Intransigent]]

  =uncompromising=

  - Even though the divorce proceedings should be over, they are still dragging on because of the intransigent parties involved.
  - People have a hard time getting along with Ben because he is such an intransigent leader.
  - When it comes to the safety of my children, I must always take an intransigent position to protect them.
  - Jason has an intransigent nature which makes it very hard for him to find a good restaurant.
  - Since Harvey can make a lot of money on this deal, I do not understand why he is being so intransigent on the contract terms.
  - Nobody wants to work in a group with Jack because he is intransigent and unwilling to be a team player.
  - When it came to their willingness to extend my curfew, my parents were intransigent and would not budge.



* [[https://wordsinasentence.com/intrepid-in-a-sentence/][Intrepid]]

  =very brave=

  - To be an astronaut, you must be an intrepid person who craves adventure and is not afraid of heights.
  - The intrepid kitten walked slowly in front of the two big dogs.
  - Even when the storm was directly over her house, the intrepid old woman did not panic.
  - The intrepid adventurer climbed the rocky mountain without fear.
  - Unlike her sister Mary, Sally was intrepid and had no problem going into the haunted house.
  - Only intrepid people sign up to be on that reality show where people are stranded on a deserted island.
  - The intrepid young boy walked through the forest alone to get his injured father medical aid.



* [[https://wordsinasentence.com/introspective-in-a-sentence/][Introspective]]

  =tending to examine your own feelings, thoughts, or ideas=

  - If you are too introspective, you may talk yourself out of doing something wonderful.
  - The introspective artist was always questioning his own painting skills.
  - Because Gerry had an introspective personality, she had a hard time conversing with others.
  - The ringing of the cellphone interrupted my introspective moment at the lake.
  - Since I am a person who wants to know everything, I find it difficult to get along with introspective people who keep their feelings to themselves.
  - Because the singer personally wrote all the songs on her album, she considers this record to be her most introspective release.
  - My husband is so introspective it often seems as though he is only concerned about his own feelings.



* [[https://wordsinasentence.com/inure-in-a-sentence/][Inure]]

  =to become immune to unpleasant events or situations=

  - Raising three dramatic daughters will inure you to temper tantrums.
  - After a while, the guards were able to inure themselves to the voices of the prisoners begging for freedom.
  - Even the veteran detective could not inure himself to the sight of a murdered child.
  - Soon, the girls became inure to the cruel treatment of their kidnapper and started to think of him as their savior.



* [[https://wordsinasentence.com/involuntary-in-a-sentence/][Involuntary]]

  =done without thought or without planning=

  - My involuntary response was to jump back from the snake.
  - For most humans, breathing is an involuntary act.
  - The little boy’s immediate and involuntary reaction was to move his hand away from the hot stove.
  - When my manager announced involuntary layoffs for numerous people in our company, I became very nervous.



