ruby/I.html



<div id="outline-container-org810767f" class="outline-2">
<h2 id="org810767f"><span class="section-number-2">81</span> <a href="https://wordsinasentence.com/intemperate-in-a-sentence/">Intemperate</a></h2>
<div class="outline-text-2" id="text-81">
<p>
<code>having problems with exercising control</code>
</p>

<ul class="org-ul">
<li>John has intemperate mood swings he cannot seem to control.</li>
<li>When Barbara drinks, she becomes intemperate and cannot regulate her actions.</li>
<li>Kelly’s intemperate behavior is closely related to her incurable habit of shoplifting.</li>
<li>Because Wayne has a mental disorder that makes him intemperate, his uncontrollable conduct is usually overlooked.</li>
</ul>
</div>
</div>



<div id="outline-container-org1eecc8e" class="outline-2">
<h2 id="org1eecc8e"><span class="section-number-2">82</span> <a href="https://wordsinasentence.com/interpolate-in-a-sentence/">Interpolate</a></h2>
<div class="outline-text-2" id="text-82">
<p>
<code>to change something by adding material to it</code>
</p>

<ul class="org-ul">
<li>Since the author would often interpolate the stories of others by adding his own text, the critics did not view him as a real writer.</li>
<li>Today many singers interpolate their own words and music into classic songs in order to create new tunes.</li>
<li>Depending on how well my novel flows, my editor may interpolate additional descriptive sentences to give the tale more imagery.</li>
<li>With the addition of a few online quotes, Edward was able to completely interpolate his debate speech.</li>
</ul>
</div>
</div>



<div id="outline-container-org5d9998b" class="outline-2">
<h2 id="org5d9998b"><span class="section-number-2">83</span> <a href="https://wordsinasentence.com/intimate-in-a-sentence/">Intimate</a></h2>
<div class="outline-text-2" id="text-83">
<p>
<code>not public; private</code>
</p>

<ul class="org-ul">
<li>Because I am a private person, I do not like to share intimate details about my home life.</li>
<li>My husband and I requested a secluded room in the restaurant so we could have an intimate dinner.</li>
<li>When the candles were lit, they gave the room an intimate mood.</li>
<li>Not only are Rick and I coworkers, but we also have an intimate relationship that we keep to ourselves.</li>
</ul>
</div>
</div>



<div id="outline-container-org4f57bc1" class="outline-2">
<h2 id="org4f57bc1"><span class="section-number-2">84</span> <a href="https://wordsinasentence.com/intimation-in-a-sentence/">Intimation</a></h2>
<div class="outline-text-2" id="text-84">
<p>
<code>a sign or suggestion that something is likely to happen</code>
</p>

<ul class="org-ul">
<li>Because they destroyed so many lives, the recent bombings are a brutal intimation of immortality.</li>
<li>I hoped my girlfriend would accept the key as intimation that I wanted her to move in with me.</li>
<li>While it was not formally announced, an intimation was made that Jeff would receive the promotion.</li>
<li>When my friend died in a car crash, I saw it as intimation that nobody could live forever.</li>
<li>Jasmine could not believe her husband’s intimation that she was cheating on him.</li>
<li>Even though no statement had been released to the media, intimation has been made regarding the capture of the suspect.</li>
<li>Nate’s first intimation of illness came when he vomited all over the kitchen floor.</li>
</ul>
</div>
</div>



<div id="outline-container-org28094bd" class="outline-2">
<h2 id="org28094bd"><span class="section-number-2">85</span> <a href="https://wordsinasentence.com/intimidate-in-a-sentence/">Intimidate</a></h2>
<div class="outline-text-2" id="text-85">
<p>
<code>to make afraid</code>
</p>

<ul class="org-ul">
<li>The mob tries to intimidate shop owners into paying protection fees.</li>
<li>Because Jim often attempts to intimidate younger children, he is considered a bully.</li>
<li>The dictator tries to intimidate his enemies with verbal threats.</li>
<li>While in court, the defendant tried to intimidate the jury with menacing looks.</li>
</ul>
</div>
</div>



<div id="outline-container-orga098022" class="outline-2">
<h2 id="orga098022"><span class="section-number-2">86</span> <a href="https://wordsinasentence.com/intransigent-in-a-sentence/">Intransigent</a></h2>
<div class="outline-text-2" id="text-86">
<p>
<code>uncompromising</code>
</p>

<ul class="org-ul">
<li>Even though the divorce proceedings should be over, they are still dragging on because of the intransigent parties involved.</li>
<li>People have a hard time getting along with Ben because he is such an intransigent leader.</li>
<li>When it comes to the safety of my children, I must always take an intransigent position to protect them.</li>
<li>Jason has an intransigent nature which makes it very hard for him to find a good restaurant.</li>
<li>Since Harvey can make a lot of money on this deal, I do not understand why he is being so intransigent on the contract terms.</li>
<li>Nobody wants to work in a group with Jack because he is intransigent and unwilling to be a team player.</li>
<li>When it came to their willingness to extend my curfew, my parents were intransigent and would not budge.</li>
</ul>
</div>
</div>



<div id="outline-container-org8a202cf" class="outline-2">
<h2 id="org8a202cf"><span class="section-number-2">87</span> <a href="https://wordsinasentence.com/intrepid-in-a-sentence/">Intrepid</a></h2>
<div class="outline-text-2" id="text-87">
<p>
<code>very brave</code>
</p>

<ul class="org-ul">
<li>To be an astronaut, you must be an intrepid person who craves adventure and is not afraid of heights.</li>
<li>The intrepid kitten walked slowly in front of the two big dogs.</li>
<li>Even when the storm was directly over her house, the intrepid old woman did not panic.</li>
<li>The intrepid adventurer climbed the rocky mountain without fear.</li>
<li>Unlike her sister Mary, Sally was intrepid and had no problem going into the haunted house.</li>
<li>Only intrepid people sign up to be on that reality show where people are stranded on a deserted island.</li>
<li>The intrepid young boy walked through the forest alone to get his injured father medical aid.</li>
</ul>
</div>
</div>



<div id="outline-container-org577db1e" class="outline-2">
<h2 id="org577db1e"><span class="section-number-2">88</span> <a href="https://wordsinasentence.com/introspective-in-a-sentence/">Introspective</a></h2>
<div class="outline-text-2" id="text-88">
<p>
<code>tending to examine your own feelings, thoughts, or ideas</code>
</p>

<ul class="org-ul">
<li>If you are too introspective, you may talk yourself out of doing something wonderful.</li>
<li>The introspective artist was always questioning his own painting skills.</li>
<li>Because Gerry had an introspective personality, she had a hard time conversing with others.</li>
<li>The ringing of the cellphone interrupted my introspective moment at the lake.</li>
<li>Since I am a person who wants to know everything, I find it difficult to get along with introspective people who keep their feelings to themselves.</li>
<li>Because the singer personally wrote all the songs on her album, she considers this record to be her most introspective release.</li>
<li>My husband is so introspective it often seems as though he is only concerned about his own feelings.</li>
</ul>
</div>
</div>



<div id="outline-container-org1895385" class="outline-2">
<h2 id="org1895385"><span class="section-number-2">89</span> <a href="https://wordsinasentence.com/inure-in-a-sentence/">Inure</a></h2>
<div class="outline-text-2" id="text-89">
<p>
<code>to become immune to unpleasant events or situations</code>
</p>

<ul class="org-ul">
<li>Raising three dramatic daughters will inure you to temper tantrums.</li>
<li>After a while, the guards were able to inure themselves to the voices of the prisoners begging for freedom.</li>
<li>Even the veteran detective could not inure himself to the sight of a murdered child.</li>
<li>Soon, the girls became inure to the cruel treatment of their kidnapper and started to think of him as their savior.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdc7d4d6" class="outline-2">
<h2 id="orgdc7d4d6"><span class="section-number-2">90</span> <a href="https://wordsinasentence.com/involuntary-in-a-sentence/">Involuntary</a></h2>
<div class="outline-text-2" id="text-90">
<p>
<code>done without thought or without planning</code>
</p>

<ul class="org-ul">
<li>My involuntary response was to jump back from the snake.</li>
<li>For most humans, breathing is an involuntary act.</li>
<li>The little boy’s immediate and involuntary reaction was to move his hand away from the hot stove.</li>
<li>When my manager announced involuntary layoffs for numerous people in our company, I became very nervous.</li>
</ul>
</div>
</div>
