ruby/I.org
* [[https://wordsinasentence.com/irascible-in-a-sentence/][Irascible]]

  =easily made angry=

  - It does not take much to aggravate my irascible neighbor who is annoyed by any little noise.
  - Because Charles is very irascible, you have to be mindful of what you say to him.
  - While Jill’s husband, Jack, is irascible, Jill is always calm and relaxed.
  - Bill’s dog is irascible and has to be kept on a leash at all times.
  - He was an irascible leader who was quick to start wars with neighboring countries.
  - Our teacher was irascible today and kicked several students out of the classroom.
  - Even though my father was irascible at times, he was also a very caring man.



* [[https://wordsinasentence.com/irate-in-a-sentence/][Irate]]

  =tremendously angry=

  - Jim was irate when he found his wife in bed with another woman.
  - Because I am irate, I am going to walk away and calm down before I speak to you.
  - The irate judge had the unruly defendant removed from the courtroom.
  - The irate woman vandalized her boyfriend’s car when she learned he was cheating on her.



* [[https://wordsinasentence.com/iridescent-in-a-sentence/][Iridescent]]

  =exhibiting a wide range of brilliant colors like a rainbow=

  - The singer’s iridescent necklace glowed brightly under the spotlight.
  - When the jeweler looked at the iridescent gems, he was made speechless by their brilliant colors.
  - The parrot’s feathers appear even more iridescent on camera.
  - While we were underwater, we saw iridescent organisms that looked like small balls of glitter.
  - The iridescent makeup comes in a wide variety of colorful hues.
  - While exploring the rainforest, I was captivated by the iridescent plants that give the area its vibrant colors.
  - The bubbles we blew looked iridescent as they floated through the air.



* [[https://wordsinasentence.com/irresolute-in-a-sentence/][Irresolute]]

  =not certain about something=

  - As the troubled young girl faced her school principal, she was irresolute and did not know what to expect as a consequence for her behavior.
  - The movie’s irresolute ending left viewers wondering what happened to the heroine and her true love.
  - Since the candidate was not prepared for his interview, his answers came across as irresolute and did not sit well with his potential employer who was looking for a confident worker.
  - Jane was irresolute about the directions so she used a map app on her phone to make sure she did not get lost.
  - When the debater pondered the question for a long time without speaking, he gave the impression he was irresolute about his response.
  - The irresolute woman looked at the menu for thirty minutes before placing her order.
  - If the puppy is irresolute about the new food, it may sniff it for a few seconds before eating.



* [[https://wordsinasentence.com/irreverent-in-a-sentence/][Irreverent]]

  =displaying little respect to a person, thing, or idea=

  - When the knight did not bow before his queen, he acted in an irreverent manner.
  - Purposefully dropping the country’s flag would be an irreverent act.
  - Because the student addressed the principal in an irreverent tone, he received two days of detention.
  - While delivering his sermon, the minister found the teens’ chatter to be very irreverent.
  - Because the senator was unversed in foreign cultures, he made a huge mistake when he greeted an official in an irreverent way.
  - The irreverent pop star stood on the sacred shrine.
  - During the interview, the aggressive reporter behaved in an irreverent fashion towards the president.



* [[https://wordsinasentence.com/itinerant-in-a-sentence/][Itinerant]]

  =moving around from location to location=

  - The documentary follows the life of an itinerant homeless man who never sleeps in a location more than once.
  - Because Stan is an itinerant farm worker who follows the crops, he will not be in our neighborhood much longer.
  - Jane is an itinerant teacher who travels between schools teaching special education students.
  - Although my father is in the military, he is not an itinerant traveller because he has been stationed at the same base for twenty years.
  - The itinerant sailor gave up his life on the ocean when he fell in love with a beautiful waitress in a small town.
  - Because the traveling salesman hated his itinerant lifestyle, he was happy to be nearing his age of retirement.
  - Elana’s book discusses the itinerant life she has lived as a gypsy.



* [[https://wordsinasentence.com/illustrious-in-a-sentence/][Illustrious]]

  =respectable because of one’s accomplishments=

  - The leader of the country will recognize the illustrious scientist in a private ceremony.
  - As a member of an illustrious family of doctors, John is considered to be one of the city’s most eligible bachelors.
  - The Hollywood cemetery is filled with the remains of some of the entertainment world’s most illustrious celebrities.
  - Because Sarah has never made a grade lower than an A, her teachers voted her the most illustrious member of the senior class.
  - A number of illustrious football players have played for the prestigious university.
  - Looking back at William’s illustrious achievements, it is not surprising he became one of our country’s presidents.
  - The illustrious young man earned a perfect score on the college entrance exam.



* [[https://wordsinasentence.com/imbecile-in-a-sentence/][Imbecile]]

  =a word used to describe a person who behaves in a stupid or foolish manner=

  - The teacher was reprimanded for referring to one of her students as an imbecile because he constantly asked silly questions.
  - Because Carol’s husband is an imbecile, he is always doing stupid things like forgetting to feed their children.
  - Why does Jim behave like an imbecile when he has such a high IQ?
  - When Alan gets drunk, he starts to act like an imbecile.



