ruby/I.html



<div id="outline-container-org7d9f590" class="outline-2">
<h2 id="org7d9f590"><span class="section-number-2">91</span> <a href="https://wordsinasentence.com/irascible-in-a-sentence/">Irascible</a></h2>
<div class="outline-text-2" id="text-91">
<p>
<code>easily made angry</code>
</p>

<ul class="org-ul">
<li>It does not take much to aggravate my irascible neighbor who is annoyed by any little noise.</li>
<li>Because Charles is very irascible, you have to be mindful of what you say to him.</li>
<li>While Jill’s husband, Jack, is irascible, Jill is always calm and relaxed.</li>
<li>Bill’s dog is irascible and has to be kept on a leash at all times.</li>
<li>He was an irascible leader who was quick to start wars with neighboring countries.</li>
<li>Our teacher was irascible today and kicked several students out of the classroom.</li>
<li>Even though my father was irascible at times, he was also a very caring man.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc828c23" class="outline-2">
<h2 id="orgc828c23"><span class="section-number-2">92</span> <a href="https://wordsinasentence.com/irate-in-a-sentence/">Irate</a></h2>
<div class="outline-text-2" id="text-92">
<p>
<code>tremendously angry</code>
</p>

<ul class="org-ul">
<li>Jim was irate when he found his wife in bed with another woman.</li>
<li>Because I am irate, I am going to walk away and calm down before I speak to you.</li>
<li>The irate judge had the unruly defendant removed from the courtroom.</li>
<li>The irate woman vandalized her boyfriend’s car when she learned he was cheating on her.</li>
</ul>
</div>
</div>



<div id="outline-container-org55c1fd2" class="outline-2">
<h2 id="org55c1fd2"><span class="section-number-2">93</span> <a href="https://wordsinasentence.com/iridescent-in-a-sentence/">Iridescent</a></h2>
<div class="outline-text-2" id="text-93">
<p>
<code>exhibiting a wide range of brilliant colors like a rainbow</code>
</p>

<ul class="org-ul">
<li>The singer’s iridescent necklace glowed brightly under the spotlight.</li>
<li>When the jeweler looked at the iridescent gems, he was made speechless by their brilliant colors.</li>
<li>The parrot’s feathers appear even more iridescent on camera.</li>
<li>While we were underwater, we saw iridescent organisms that looked like small balls of glitter.</li>
<li>The iridescent makeup comes in a wide variety of colorful hues.</li>
<li>While exploring the rainforest, I was captivated by the iridescent plants that give the area its vibrant colors.</li>
<li>The bubbles we blew looked iridescent as they floated through the air.</li>
</ul>
</div>
</div>



<div id="outline-container-org79ed547" class="outline-2">
<h2 id="org79ed547"><span class="section-number-2">94</span> <a href="https://wordsinasentence.com/irresolute-in-a-sentence/">Irresolute</a></h2>
<div class="outline-text-2" id="text-94">
<p>
<code>not certain about something</code>
</p>

<ul class="org-ul">
<li>As the troubled young girl faced her school principal, she was irresolute and did not know what to expect as a consequence for her behavior.</li>
<li>The movie’s irresolute ending left viewers wondering what happened to the heroine and her true love.</li>
<li>Since the candidate was not prepared for his interview, his answers came across as irresolute and did not sit well with his potential employer who was looking for a confident worker.</li>
<li>Jane was irresolute about the directions so she used a map app on her phone to make sure she did not get lost.</li>
<li>When the debater pondered the question for a long time without speaking, he gave the impression he was irresolute about his response.</li>
<li>The irresolute woman looked at the menu for thirty minutes before placing her order.</li>
<li>If the puppy is irresolute about the new food, it may sniff it for a few seconds before eating.</li>
</ul>
</div>
</div>



<div id="outline-container-org2441669" class="outline-2">
<h2 id="org2441669"><span class="section-number-2">95</span> <a href="https://wordsinasentence.com/irreverent-in-a-sentence/">Irreverent</a></h2>
<div class="outline-text-2" id="text-95">
<p>
<code>displaying little respect to a person, thing, or idea</code>
</p>

<ul class="org-ul">
<li>When the knight did not bow before his queen, he acted in an irreverent manner.</li>
<li>Purposefully dropping the country’s flag would be an irreverent act.</li>
<li>Because the student addressed the principal in an irreverent tone, he received two days of detention.</li>
<li>While delivering his sermon, the minister found the teens’ chatter to be very irreverent.</li>
<li>Because the senator was unversed in foreign cultures, he made a huge mistake when he greeted an official in an irreverent way.</li>
<li>The irreverent pop star stood on the sacred shrine.</li>
<li>During the interview, the aggressive reporter behaved in an irreverent fashion towards the president.</li>
</ul>
</div>
</div>



<div id="outline-container-orgef912a2" class="outline-2">
<h2 id="orgef912a2"><span class="section-number-2">96</span> <a href="https://wordsinasentence.com/itinerant-in-a-sentence/">Itinerant</a></h2>
<div class="outline-text-2" id="text-96">
<p>
<code>moving around from location to location</code>
</p>

<ul class="org-ul">
<li>The documentary follows the life of an itinerant homeless man who never sleeps in a location more than once.</li>
<li>Because Stan is an itinerant farm worker who follows the crops, he will not be in our neighborhood much longer.</li>
<li>Jane is an itinerant teacher who travels between schools teaching special education students.</li>
<li>Although my father is in the military, he is not an itinerant traveller because he has been stationed at the same base for twenty years.</li>
<li>The itinerant sailor gave up his life on the ocean when he fell in love with a beautiful waitress in a small town.</li>
<li>Because the traveling salesman hated his itinerant lifestyle, he was happy to be nearing his age of retirement.</li>
<li>Elana’s book discusses the itinerant life she has lived as a gypsy.</li>
</ul>
</div>
</div>



<div id="outline-container-orge308a14" class="outline-2">
<h2 id="orge308a14"><span class="section-number-2">97</span> <a href="https://wordsinasentence.com/illustrious-in-a-sentence/">Illustrious</a></h2>
<div class="outline-text-2" id="text-97">
<p>
<code>respectable because of one’s accomplishments</code>
</p>

<ul class="org-ul">
<li>The leader of the country will recognize the illustrious scientist in a private ceremony.</li>
<li>As a member of an illustrious family of doctors, John is considered to be one of the city’s most eligible bachelors.</li>
<li>The Hollywood cemetery is filled with the remains of some of the entertainment world’s most illustrious celebrities.</li>
<li>Because Sarah has never made a grade lower than an A, her teachers voted her the most illustrious member of the senior class.</li>
<li>A number of illustrious football players have played for the prestigious university.</li>
<li>Looking back at William’s illustrious achievements, it is not surprising he became one of our country’s presidents.</li>
<li>The illustrious young man earned a perfect score on the college entrance exam.</li>
</ul>
</div>
</div>



<div id="outline-container-org7de188c" class="outline-2">
<h2 id="org7de188c"><span class="section-number-2">98</span> <a href="https://wordsinasentence.com/imbecile-in-a-sentence/">Imbecile</a></h2>
<div class="outline-text-2" id="text-98">
<p>
<code>a word used to describe a person who behaves in a stupid or foolish manner</code>
</p>

<ul class="org-ul">
<li>The teacher was reprimanded for referring to one of her students as an imbecile because he constantly asked silly questions.</li>
<li>Because Carol’s husband is an imbecile, he is always doing stupid things like forgetting to feed their children.</li>
<li>Why does Jim behave like an imbecile when he has such a high IQ?</li>
<li>When Alan gets drunk, he starts to act like an imbecile.</li>
</ul>
</div>
</div>
