ruby/I.org
* [[https://wordsinasentence.com/imbibe-in-a-sentence/][Imbibe]]

  =to drink (used frequently of alcoholic beverages)=

  - Best practice dictates that anyone who intends to imbibe alcoholic beverages should make sure to have dependable transportation to get home.
  - Despite being unable to imbibe cocktails with her friends, Mariel probably had the most fun at the wedding reception.
  - Every morning, I like to delay the start of the work day, go outside on the terrace, and imbibe large quantities of sunshine and fresh air.
  - If I imbibe too much soda, I find that I am troubled with extreme bouts of hiccupping.
  - A well-planned garden ensures that all plants are located where they can have maximum opportunities to imbibe water, nutrients, and sunshine.
  - Parents who allow their underage children to imbibe will be prosecuted In the event of alcohol-related accidents.
  - Since you already have a DUI offense on your record, can you really afford to imbibe more than one beer tonight?



* [[https://wordsinasentence.com/imbroglio-in-a-sentence/][Imbroglio]]

  =a confusing situation=

  - Will the treaty end this imbroglio that has kept the two countries at war for over sixty years?
  - The hostages found themselves in an imbroglio when the two kidnappers began to fight.
  - How can we end this imbroglio caused by the resort double booking our cabin?
  - In the senior dormitory, the resident assistant is currently dealing with an imbroglio between two students who both claim the other is stealing her shower shoes.
  - The romantic imbroglio began when the parents met Sarah and assumed she was their dead son’s fiancée.
  - Hopefully the mediator can finally bring an end to the imbroglio that has delayed the couples’ divorce for five years.
  - Perhaps the professor’s explanation will allow me to make sense of this scientific imbroglio.



* [[https://wordsinasentence.com/immensity-in-a-sentence/][Immensity]]

  =great size=

  - While hiking on a month-long mountainous trip, Davy felt the immensity of the wilderness.
  - After Bill stole his friend’s money, he recognized the immensity of the problem when his friend couldn’t buy food for his family.
  - The geography teacher wanted to show the immensity of Asia by having his students draw the continent in comparison to the other continents.
  - The immensity of the fire’s damage left the homeowners without a home, money, or their possessions.



* [[https://wordsinasentence.com/immolation-in-a-sentence/][Immolation]]

  =the act of killing or sacrificing somebody=

  - Eating nothing but candy is a sure path towards immolation of your health.
  - His lack of care for his fish led to their eventual immolation.
  - His family had an intervention, warning him that he was on the path to self-immolation.
  - With no family or friends left alive, he wished for self-immolation.
  - His depression drove the man to self-immolation.
  - Printing of fiat currency is a certain way for a state to head towards self-immolation.
  - For a mother, there is no greater immolation than letting go of your child.



* [[https://wordsinasentence.com/immure-in-a-sentence/][Immure]]

  =to lock up behind walls=

  - Caught robbing a bank, Jason knew the police would immure him in a jail cell for an extended period of time.
  - The asylum would immure my daughter in a barred cell until she proved she was safe to herself and others.
  - To stop my nephew from using drugs, I had to immure him in his bedroom so that he could not escape and could be rehabilitated at home.
  - During World War II, my grandfather would become immure by the Japanese in a prisoner-of-war camp and would not be released for 3 ½ years.



* [[https://wordsinasentence.com/impale-in-a-sentence/][Impale]]

  =to pierce with something sharp=

  - During the horror movie, the knife would impale the girl through the heart killing her instantly.
  - When I donated blood, the nurse was so rough and impatient that she seemed to impale the needle in my arm with great force.
  - As the car crashed through the picket fence, one of the pickets would impale the driver in the chest resulting in extreme blood loss.
  - Using a bow and arrow, the Native Americans would impale the buffalo with an arrow through the head so the animal would die quickly.



* [[https://wordsinasentence.com/impasse-in-a-sentence/][Impasse]]

  =a situation that prevents advancement=

  - Yesterday, the two parties did not make any progress on the contract terms because they had reached an impasse.
  - Because of the impasse between workers and management, the factory has been closed for two weeks.
  - The jury ended in an impasse when the members could not break a tie vote on the defendant’s guilt.
  - Since the snow has covered the mountain and the lake has frozen over, we have reached an impasse and must sleep in our car until the weather becomes warmer.
  - The kidnapper refused to talk to the hostage negotiator during the impasse.
  - Since neither the husband nor the wife is willing to make a compromise, the divorce hearing is at an impasse.
  - Even if it takes all night, we must work through the financial impasse that is preventing our teachers from returning to their classrooms.



* [[https://wordsinasentence.com/impeach-in-a-sentence/][Impeach]]

  =to charge a public official with a crime=

  - Without sufficient evidence, you cannot hope to impeach a public official.
  - After discovering that her employee was stealing, she went on to formally impeach the man.
  - Believing that he had exaggerated his qualifications, the students look to impeach their professor.
  - Before you go to impeach someone, make sure you have the evidence ready to show.
  - He looked to impeach his boss on suspicion of embezzlement.
  - If you want to impeach someone, you need to follow proper legal procedure.
  - His suspicious behavior made it easy to impeach him.



* [[https://wordsinasentence.com/impel-in-a-sentence/][Impel]]

  =to drive an individual to perform in a certain way=

  - The manufacturer hopes its commercial will impel us to purchase its new product.
  - Unfortunately, there is nothing we can do to impel Frank to go to rehab.
  - A mother’s maternal instinct will impel her to give her life for her child.
  - Even though Peter is not feeling well, his hunger will soon impel him to drive to the grocery store.
  - Everyone wanted to know what would impel the minister to kill his five children.
  - If the weather becomes stormy, it will impel us to move our picnic indoors.
  - On Halloween, children will try to impel strangers into giving them treats.



