ruby/I.html



<div id="outline-container-orgc25ae99" class="outline-2">
<h2 id="orgc25ae99"><span class="section-number-2">99</span> <a href="https://wordsinasentence.com/imbibe-in-a-sentence/">Imbibe</a></h2>
<div class="outline-text-2" id="text-99">
<p>
<code>to drink (used frequently of alcoholic beverages)</code>
</p>

<ul class="org-ul">
<li>Best practice dictates that anyone who intends to imbibe alcoholic beverages should make sure to have dependable transportation to get home.</li>
<li>Despite being unable to imbibe cocktails with her friends, Mariel probably had the most fun at the wedding reception.</li>
<li>Every morning, I like to delay the start of the work day, go outside on the terrace, and imbibe large quantities of sunshine and fresh air.</li>
<li>If I imbibe too much soda, I find that I am troubled with extreme bouts of hiccupping.</li>
<li>A well-planned garden ensures that all plants are located where they can have maximum opportunities to imbibe water, nutrients, and sunshine.</li>
<li>Parents who allow their underage children to imbibe will be prosecuted In the event of alcohol-related accidents.</li>
<li>Since you already have a DUI offense on your record, can you really afford to imbibe more than one beer tonight?</li>
</ul>
</div>
</div>



<div id="outline-container-org590d991" class="outline-2">
<h2 id="org590d991"><span class="section-number-2">100</span> <a href="https://wordsinasentence.com/imbroglio-in-a-sentence/">Imbroglio</a></h2>
<div class="outline-text-2" id="text-100">
<p>
<code>a confusing situation</code>
</p>

<ul class="org-ul">
<li>Will the treaty end this imbroglio that has kept the two countries at war for over sixty years?</li>
<li>The hostages found themselves in an imbroglio when the two kidnappers began to fight.</li>
<li>How can we end this imbroglio caused by the resort double booking our cabin?</li>
<li>In the senior dormitory, the resident assistant is currently dealing with an imbroglio between two students who both claim the other is stealing her shower shoes.</li>
<li>The romantic imbroglio began when the parents met Sarah and assumed she was their dead son’s fiancée.</li>
<li>Hopefully the mediator can finally bring an end to the imbroglio that has delayed the couples’ divorce for five years.</li>
<li>Perhaps the professor’s explanation will allow me to make sense of this scientific imbroglio.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdd57f58" class="outline-2">
<h2 id="orgdd57f58"><span class="section-number-2">101</span> <a href="https://wordsinasentence.com/immensity-in-a-sentence/">Immensity</a></h2>
<div class="outline-text-2" id="text-101">
<p>
<code>great size</code>
</p>

<ul class="org-ul">
<li>While hiking on a month-long mountainous trip, Davy felt the immensity of the wilderness.</li>
<li>After Bill stole his friend’s money, he recognized the immensity of the problem when his friend couldn’t buy food for his family.</li>
<li>The geography teacher wanted to show the immensity of Asia by having his students draw the continent in comparison to the other continents.</li>
<li>The immensity of the fire’s damage left the homeowners without a home, money, or their possessions.</li>
</ul>
</div>
</div>



<div id="outline-container-org9d6332f" class="outline-2">
<h2 id="org9d6332f"><span class="section-number-2">102</span> <a href="https://wordsinasentence.com/immolation-in-a-sentence/">Immolation</a></h2>
<div class="outline-text-2" id="text-102">
<p>
<code>the act of killing or sacrificing somebody</code>
</p>

<ul class="org-ul">
<li>Eating nothing but candy is a sure path towards immolation of your health.</li>
<li>His lack of care for his fish led to their eventual immolation.</li>
<li>His family had an intervention, warning him that he was on the path to self-immolation.</li>
<li>With no family or friends left alive, he wished for self-immolation.</li>
<li>His depression drove the man to self-immolation.</li>
<li>Printing of <b>fiat currency</b> <code>法定货币</code> is a certain way for a state to head towards self-immolation.</li>
<li>For a mother, there is no greater immolation than letting go of your child.</li>
</ul>
</div>
</div>



<div id="outline-container-org755b731" class="outline-2">
<h2 id="org755b731"><span class="section-number-2">103</span> <a href="https://wordsinasentence.com/immure-in-a-sentence/">Immure</a></h2>
<div class="outline-text-2" id="text-103">
<p>
<code>to lock up behind walls</code>
</p>

<ul class="org-ul">
<li>Caught robbing a bank, Jason knew the police would immure him in a jail cell for an extended period of time.</li>
<li>The asylum would immure my daughter in a barred cell until she proved she was safe to herself and others.</li>
<li>To stop my nephew from using drugs, I had to immure him in his bedroom so that he could not escape and could be rehabilitated at home.</li>
<li>During World War II, my grandfather would become immure by the Japanese in a prisoner-of-war camp and would not be released for 3 ½ years.</li>
</ul>
</div>
</div>



<div id="outline-container-org5f92c32" class="outline-2">
<h2 id="org5f92c32"><span class="section-number-2">104</span> <a href="https://wordsinasentence.com/impale-in-a-sentence/">Impale</a></h2>
<div class="outline-text-2" id="text-104">
<p>
<code>to pierce with something sharp</code>
</p>

<ul class="org-ul">
<li>During the horror movie, the knife would impale the girl through the heart killing her instantly.</li>
<li>When I donated blood, the nurse was so rough and impatient that she seemed to impale the needle in my arm with great force.</li>
<li>As the car crashed through the <b>picket fence</b> <code>木珊栏</code>, one of the pickets would impale the driver in the chest resulting in extreme blood loss.</li>
<li>Using a bow and arrow, the Native Americans would impale the buffalo with an arrow through the head so the animal would die quickly.</li>
</ul>
</div>
</div>



<div id="outline-container-org274a57f" class="outline-2">
<h2 id="org274a57f"><span class="section-number-2">105</span> <a href="https://wordsinasentence.com/impasse-in-a-sentence/">Impasse</a></h2>
<div class="outline-text-2" id="text-105">
<p>
<code>a situation that prevents advancement</code>
</p>

<ul class="org-ul">
<li>Yesterday, the two parties did not make any progress on the contract terms because they had reached an impasse.</li>
<li>Because of the impasse between workers and management, the factory has been closed for two weeks.</li>
<li>The jury ended in an impasse when the members could not break a tie vote on the defendant’s guilt.</li>
<li>Since the snow has covered the mountain and the lake has frozen over, we have reached an impasse and must sleep in our car until the weather becomes warmer.</li>
<li>The kidnapper refused to talk to the hostage negotiator during the impasse.</li>
<li>Since neither the husband nor the wife is willing to make a compromise, the divorce hearing is at an impasse.</li>
<li>Even if it takes all night, we must work through the financial impasse that is preventing our teachers from returning to their classrooms.</li>
</ul>
</div>
</div>



<div id="outline-container-org3ac4282" class="outline-2">
<h2 id="org3ac4282"><span class="section-number-2">106</span> <a href="https://wordsinasentence.com/impeach-in-a-sentence/">Impeach</a></h2>
<div class="outline-text-2" id="text-106">
<p>
<code>to charge a public official with a crime</code>
</p>

<ul class="org-ul">
<li>Without sufficient evidence, you cannot hope to impeach a public official.</li>
<li>After discovering that her employee was stealing, she went on to formally impeach the man.</li>
<li>Believing that he had exaggerated his qualifications, the students look to impeach their professor.</li>
<li>Before you go to impeach someone, make sure you have the evidence ready to show.</li>
<li>He looked to impeach his boss on suspicion of embezzlement.</li>
<li>If you want to impeach someone, you need to follow proper legal procedure.</li>
<li>His suspicious behavior made it easy to impeach him.</li>
</ul>
</div>
</div>



<div id="outline-container-orgea8df25" class="outline-2">
<h2 id="orgea8df25"><span class="section-number-2">107</span> <a href="https://wordsinasentence.com/impel-in-a-sentence/">Impel</a></h2>
<div class="outline-text-2" id="text-107">
<p>
<code>to drive an individual to perform in a certain way</code>
</p>

<ul class="org-ul">
<li>The manufacturer hopes its commercial will impel us to purchase its new product.</li>
<li>Unfortunately, there is nothing we can do to impel Frank to go to rehab.</li>
<li>A mother’s maternal instinct will impel her to give her life for her child.</li>
<li>Even though Peter is not feeling well, his hunger will soon impel him to drive to the grocery store.</li>
<li>Everyone wanted to know what would impel the minister to kill his five children.</li>
<li>If the weather becomes stormy, it will impel us to move our picnic indoors.</li>
<li>On Halloween, children will try to impel strangers into giving them treats.</li>
</ul>
</div>
</div>
