ruby/I.org
* [[https://wordsinasentence.com/impending-in-a-sentence/][Impending]]

  =going to occur; coming=

  - When I refused to pay the fake fortuneteller, she warned me of impending doom in my future.
  - Sheila hoped Frank’s impending question was not a marriage proposal because she was not in love with him.
  - Because Jim suffers from anxiety, he frequently has fears of impending disaster.
  - The emergency alert instructed everyone to prepare for the impending tornado.



* [[https://wordsinasentence.com/impenitent-in-a-sentence/][Impenitent]]

  =unapologetic; remorseless=

  - Even after being sentenced to life in prison, the impenitent man was not sorry for his crimes.
  - A smile across her face showed that the impenitent crook did not feel guilty.
  - Although he was really impenitent, the man pretended that he regretted stealing the check.
  - The impenitent criminal felt no shame, but admitted guilt so that he could avoid jail.



* [[https://wordsinasentence.com/imperil-in-a-sentence/][Imperil]]

  =to be in danger of something or someone=

  - Although most people do see the threat, littering in the ocean can imperil many different marine life like dolphins due to their ingestion of plastic litter.
  - The quick-spreading wildfires imperil the citizens of Gatlinburg since they are trapped by the fire in their homes.
  - Guns that are kept in an unlocked container imperil the family if guns get into the hands of toddlers.
  - Having a few hot-tempered hostages only seemed to further imperil the already drastic robbery situation with the gun-wielding captors.



* [[https://wordsinasentence.com/impertinent-in-a-sentence/][Impertinent]]

  =behaving without proper respect; rude=

  - Although she thought she was just being funny, her teacher didn’t agree and sent her to the principal’s office for being impertinent.
  - While he never intended his remark to be impertinent, he found that a lot of people had been offended by what he said.
  - Because the young man would only give an impertinent answer to his questions, the attorney decided not to take him on as a client.
  - While Natalie searched frantically for her mysterious present, Ely just watched from the doorway with an impertinent smirk on his face.
  - Although Alexis had been enjoying the young man’s company, his impertinent suggestion prompted her to leave the bar.
  - As the site’s webmaster, it is her job to monitor the online forum for impertinent comments.
  - If Evan didn’t have such an impertinent attitude with waiters, Alyssa wouldn’t have minded going out to dinner with him.



* [[https://wordsinasentence.com/impetus-in-a-sentence/][Impetus]]

  =a force that causes something to be done or to become more active=

  - The high crime rate was the impetus for the hiring of one hundred new police officers in our city.
  - Because the new president was once a military commander, he has a great deal of experience being an impetus for change.
  - The lack of donations is the impetus causing many non-profit agencies to reduce services offered to the public.
  - While my daughter normally hates to do her chores, her desire to earn extra money for a cellphone has become her impetus to be more helpful around the house.
  - In the film, the leading character’s need to rescue his son is the impetus that drives the movie’s plot.
  - My doctor’s announcement that I had high blood pressure was the impetus that caused me to join a gym.
  - After the hurricane, the city managers viewed the devastating damage as an impetus to improve barriers between the ocean and the land.



* [[https://wordsinasentence.com/impinge-in-a-sentence/][Impinge]]

  =to produce an effect, usually an unwanted one=

  - Hopefully the bad weather will move in a different direction and not impinge upon our plans for an outdoor reception.
  - You are free to pursue all the things that make you happy as long as you do not impinge on the freedoms of others during your pursuit.
  - If the forest fire is not put out within a couple of days, it could impinge upon the town of Las Calbos and destroy hundreds of homes.
  - Jack’s excessive gambling has started to impinge upon his ability to pay bills.



* [[https://wordsinasentence.com/implant-sentence/][Implant]]

  =to embed or establish something in a fixed position=

  - When the stubborn child would get upset with his mother for not getting his wish, he would implant his foot firmly on the rug with a scowl on his face.
  - As a busy student with little free time, Sylvia’s way of cramming for an exam would be to implant as much information in her brain right before the test.
  - The teenager did not know what to do but to implant the telephone number into her head since her cell phone had gone missing.
  - Blocking the door with my foot was not going to be enough to keep the intruder out of the room, so I decided to implant the heaviest piece of furniture next to the door.



* [[https://wordsinasentence.com/implicate-in-a-sentence/][Implicate]]

  =to hint a person or object is responsible for something, often an illegal deed=

  - If the evidence is found, it will implicate the person behind the brutal act.
  - The lab results implicate a high amount of cholesterol as the cause of my uncle’s heart problem.
  - When my best friend tried to implicate me in the robbery in order to save herself, I knew we were no longer friends.
  - The police did not arrest the suspect because they had nothing that could implicate him in the crime.
  - Because Hank knew the knife would implicate him as the killer, he threw the weapon into the lake.
  - The large pool of blood on the floor seems to implicate a violent altercation took place here.
  - As a loving sister, Karen chose to take responsibility for the broken vase rather than implicate her younger brother.



* [[https://wordsinasentence.com/implode-in-a-sentence/][Implode]]

  =to explode inward=

  - Everyone was shocked to see the loving couple’s relationship implode and end in divorce.
  - It seemed that the angry team would implode, exploding into a million different pieces that would leave us without an NFL squad.
  - Many people though the earth would implode at the end of 1999 and were shocked to wake up the next day.
  - Arguments on the inside caused the black market to implode and crumble.



* [[https://wordsinasentence.com/implored-in-a-sentence/][Implored]]

  =sincerely begged=

  - The little boy implored his kidnapper to let him go.
  - When Beth could not pay her utility bill in full, she implored the company to allow her to set up a payment plan.
  - Jim refused to take his medicine even after the doctor implored him to do so.
  - While the president addressed the country, he implored the people to wait for justice to do its work.
  - The famous actress implored the media to not harass her children when they were out in public.
  - When Helen remarried, she implored her children to be nice to their stepfather.
  - The bus driver implored the students to take their seats.



