ruby/I.html



<div id="outline-container-org37ee2e5" class="outline-2">
<h2 id="org37ee2e5"><span class="section-number-2">108</span> <a href="https://wordsinasentence.com/impenitent-in-a-sentence/">Impenitent</a></h2>
<div class="outline-text-2" id="text-108">
<p>
<code>unapologetic; remorseless</code>
</p>

<ul class="org-ul">
<li>Even after being sentenced to life in prison, the impenitent man was not sorry for his crimes.</li>
<li>A smile across her face showed that the impenitent crook did not feel guilty.</li>
<li>Although he was really impenitent, the man pretended that he regretted stealing the check.</li>
<li>The impenitent criminal felt no shame, but admitted guilt so that he could avoid jail.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc2f346d" class="outline-2">
<h2 id="orgc2f346d"><span class="section-number-2">109</span> <a href="https://wordsinasentence.com/imperil-in-a-sentence/">Imperil</a></h2>
<div class="outline-text-2" id="text-109">
<p>
<code>to be in danger of something or someone</code>
</p>

<ul class="org-ul">
<li>Although most people do see the threat, littering in the ocean can imperil many different marine life like dolphins due to their ingestion of plastic litter.</li>
<li>The quick-spreading wildfires imperil the citizens of Gatlinburg since they are trapped by the fire in their homes.</li>
<li>Guns that are kept in an unlocked container imperil the family if guns get into the hands of toddlers.</li>
<li>Having a few hot-tempered hostages only seemed to further imperil the already drastic robbery situation with the gun-wielding captors.</li>
</ul>
</div>
</div>


<div id="outline-container-orgf9e218e" class="outline-2">
<h2 id="orgf9e218e"><span class="section-number-2">110</span> <a href="https://wordsinasentence.com/impetus-in-a-sentence/">Impetus</a></h2>
<div class="outline-text-2" id="text-110">
<p>
<code>a force that causes something to be done or to become more active</code>
</p>

<ul class="org-ul">
<li>The high crime rate was the impetus for the hiring of one hundred new police officers in our city.</li>
<li>Because the new president was once a military commander, he has a great deal of experience being an impetus for change.</li>
<li>The lack of donations is the impetus causing many non-profit agencies to reduce services offered to the public.</li>
<li>While my daughter normally hates to do her chores, her desire to earn extra money for a cellphone has become her impetus to be more helpful around the house.</li>
<li>In the film, the leading character’s need to rescue his son is the impetus that drives the movie’s plot.</li>
<li>My doctor’s announcement that I had high blood pressure was the impetus that caused me to join a gym.</li>
<li>After the hurricane, the city managers viewed the devastating damage as an impetus to improve barriers between the ocean and the land.</li>
</ul>
</div>
</div>



<div id="outline-container-org4c0ffc4" class="outline-2">
<h2 id="org4c0ffc4"><span class="section-number-2">111</span> <a href="https://wordsinasentence.com/impinge-in-a-sentence/">Impinge</a></h2>
<div class="outline-text-2" id="text-111">
<p>
<code>to produce an effect, usually an unwanted one</code>
</p>

<ul class="org-ul">
<li>Hopefully the bad weather will move in a different direction and not impinge upon our plans for an outdoor reception.</li>
<li>You are free to pursue all the things that make you happy as long as you do not impinge on the freedoms of others during your pursuit.</li>
<li>If the forest fire is not put out within a couple of days, it could impinge upon the town of Las Calbos and destroy hundreds of homes.</li>
<li>Jack’s excessive gambling has started to impinge upon his ability to pay bills.</li>
</ul>
</div>
</div>



<div id="outline-container-org1f7621f" class="outline-2">
<h2 id="org1f7621f"><span class="section-number-2">112</span> <a href="https://wordsinasentence.com/implant-sentence/">Implant</a></h2>
<div class="outline-text-2" id="text-112">
<p>
<code>to embed or establish something in a fixed position</code>
</p>

<ul class="org-ul">
<li>When the stubborn child would get upset with his mother for not getting his wish, he would implant his foot firmly on the rug with a scowl on his face.</li>
<li>As a busy student with little free time, Sylvia’s way of <b>cramming</b> for an exam would be to implant as much information in her brain right before the test.</li>
<li>The teenager did not know what to do but to implant the telephone number into her head since her cell phone had gone missing.</li>
<li>Blocking the door with my foot was not going to be enough to keep the intruder out of the room, so I decided to implant the heaviest piece of furniture next to the door.</li>
</ul>
</div>
</div>



<div id="outline-container-org32d3ac5" class="outline-2">
<h2 id="org32d3ac5"><span class="section-number-2">113</span> <a href="https://wordsinasentence.com/implicate-in-a-sentence/">Implicate</a></h2>
<div class="outline-text-2" id="text-113">
<p>
<code>to hint a person or object is responsible for something, often an illegal deed</code>
</p>

<ul class="org-ul">
<li>If the evidence is found, it will implicate the person behind the brutal act.</li>
<li>The lab results implicate a high amount of cholesterol as the cause of my uncle’s heart problem.</li>
<li>When my best friend tried to implicate me in the robbery in order to save herself, I knew we were no longer friends.</li>
<li>The police did not arrest the suspect because they had nothing that could implicate him in the crime.</li>
<li>Because Hank knew the knife would implicate him as the killer, he threw the weapon into the lake.</li>
<li>The large pool of blood on the floor seems to implicate a violent altercation took place here.</li>
<li>As a loving sister, Karen chose to take responsibility for the broken vase rather than implicate her younger brother.</li>
</ul>
</div>
</div>



<div id="outline-container-org7fe0ab9" class="outline-2">
<h2 id="org7fe0ab9"><span class="section-number-2">114</span> <a href="https://wordsinasentence.com/implode-in-a-sentence/">Implode</a></h2>
<div class="outline-text-2" id="text-114">
<p>
<code>to explode inward</code>
</p>

<ul class="org-ul">
<li>Everyone was shocked to see the loving couple’s relationship implode and end in divorce.</li>
<li>It seemed that the angry team would implode, exploding into a million different pieces that would leave us without an NFL squad.</li>
<li>Many people thought the earth would implode at the end of 1999 and were shocked to wake up the next day.</li>
<li>Arguments on the inside caused the black market to implode and crumble.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf4e0acf" class="outline-2">
<h2 id="orgf4e0acf"><span class="section-number-2">115</span> <a href="https://wordsinasentence.com/implored-in-a-sentence/">Implored</a></h2>
<div class="outline-text-2" id="text-115">
<p>
<code>sincerely begged</code>
</p>

<ul class="org-ul">
<li>The little boy implored his kidnapper to let him go.</li>
<li>When Beth could not pay her utility bill in full, she implored the company to allow her to set up a payment plan.</li>
<li>Jim refused to take his medicine even after the doctor implored him to do so.</li>
<li>While the president addressed the country, he implored the people to wait for justice to do its work.</li>
<li>The famous actress implored the media to not harass her children when they were out in public.</li>
<li>When Helen remarried, she implored her children to be nice to their stepfather.</li>
<li>The bus driver implored the students to take their seats.</li>
</ul>
</div>
</div>
