ruby/I.org
* [[https://wordsinasentence.com/importune-in-a-sentence/][Importune]]

  =to request (someone) pressingly and persistently for or to do something=

  - Even after I had politely declined and shut the door, I could hear the salesman continuing to importune me to let him demonstrate the expensive vacuum cleaner.
  - Realizing that the boss was in one of his rare good moods, I seized the opportunity to importune him for a raise.
  - Sometimes fundraisers will appeal to your emotions to importune for donations.
  - Most politicians importune voters for money as well as support.
  - Demetri jumped at the opportunity to importune his neighbors to pitch in and build a playground for the children.
  - We will continue to importune City Council to put a stop sign on the corner; hopefully, it will be taken care of before something tragic occurs.
  - Every Christmas, malls are crowded with children who importune Santa for their heart’s desire as they try to convince him that they have been good all year.



* [[https://wordsinasentence.com/imprecation-in-a-sentence/][Imprecation]]

  =a stated curse that bears a person ill-will=

  - The witch muttered an imprecation at the man who mistreated her.
  - Before the woman was burned at the stake, she uttered an imprecation against her accusers.
  - The woman screamed an imprecation at the police officer who tossed her to the ground.
  - Since I don’t believe in magic, the wizard’s imprecation didn’t scare me.



* [[https://wordsinasentence.com/imprint-in-a-sentence/][Imprint]]

  =to mark or stamp something using pressure=

  - Wedding planners were able to imprint the address on all of the invitations.
  - The horse tried to run when the hot branding iron began to imprint into its hide.
  - Without a way to imprint the logo on the bags, the team began to brainstorm other marketing ideas.
  - The worker’s job was to imprint the company emblem onto the back of all pottery.



* [[https://wordsinasentence.com/incarcerate-in-a-sentence/][Incarcerate]]

  =to lock a person up as a consequence for his or her actions=

  - The police are going to incarcerate the teen who keeps committing acts of violence.
  - If Jim doesn’t stop drinking and driving, the judge will have to incarcerate him.
  - The detective promised the Smiths she would incarcerate their daughter’s killer.
  - Because the king is opposed to executions, he’ll incarcerate the traitor for life.



* [[https://wordsinasentence.com/incinerate-in-a-sentence/][Incinerate]]

  =destroy by burning=

  - If an atom bomb was dropped over Manhattan, the whole city would incinerate in a flash.
  - The thieves decided to incinerate the building after leaving fingerprints on the wall.
  - In the news today, two California wildfires incinerate 400 homes and displace 15,000 residents.
  - The plan was to incinerate Tyler’s garage, and reduce it to rubble.



* [[https://wordsinasentence.com/incite-in-a-sentence/][Incite]]

  =to stir up or excite=

  - The racist man tried to incite hatred in his children by telling them falsehoods about minority groups.
  - During the pep rally, the cheerleaders worked hard to incite school spirit.
  - The Christian network will not air any programs that incite violence or hate.
  - Did you know you could be arrested for trying to incite an uprising against the government?
  - The dictator’s lavish party only served to incite the hatred of the starving people.
  - Since I was angry with my husband, I went out of my way to incite an argument with him.
  - The purpose of the terror alerts is not to incite panic but rather to make people more cautious.



* [[https://wordsinasentence.com/inclement-in-a-sentence/][Inclement]]

  =unpleasant weather in being stormy, rainy, or snowy=

  - Inclement weather is causing us to postpone our picnic.
  - During hurricane season, cruises are often cancelled because of inclement conditions.
  - Jason and Heather have no plans to let inclement weather affect their outdoor wedding ceremony.
  - If you are concerned about inclement weather on your trip, please take a small umbrella in your suitcase.
  - Unaware the weather would soon turn inclement, Harry left home without a raincoat or umbrella.
  - Ron loves baseball so much he is willing to remain in the stands and cheer for his favorite team even during inclement weather.
  - Because of today’s inclement conditions, the children were not allowed to go outside during recess.



* [[https://wordsinasentence.com/incriminate-in-a-sentence/][Incriminate]]

  =to suggest an individual has done something inappropriate or illegal=

  - The man refused to talk because he did not want to incriminate himself in court.
  - Before I can incriminate my rival as the school vandal, I need to put the spray cans in her car.
  - My dishonest boss tried to incriminate me for his thievery.
  - As long as the mobster never told his wife about his illegal deeds, he knew she could never incriminate him.



* [[https://wordsinasentence.com/incubus-in-a-sentence/][Incubus]]

  =a demon or evil spirit supposed to descend upon sleeping women in order to have sex with them=

  - In the myth, the incubus surprised sleeping women with sexual advances.
  - Incubus is a mythological creature that’s sole goal is to rape women who are resting.
  - After having sex with the evil incubus several times, the woman eventually succumbed to a painful death.
  - In ancient texts, a demon called an incubus would sleep with women and sometimes impregnate them.



* [[https://wordsinasentence.com/inculcate-in-a-sentence/][Inculcate]]

  =to frequently instill an idea or belief firmly in someone's mind=

  - In order to inculcate a love of reading, the teacher encourages her students to read different types of literature.
  - My father spent most of his life trying to inculcate me with his values!
  - When my puppy chewed up my slippers, I realized how difficult it was to inculcate obedience in a young dog.
  - Do you feel our professors should inculcate us with their political views?
  - The goal of the cult leader was to inculcate millions of followers with his teachings.
  - In order to inculcate patriotism, the president held ten press conferences last month.
  - Although Pat had no interest in playing the piano, her mother still sought to inculcate her on the proper playing technique.



