ruby/I.html



<div id="outline-container-orgdd0ed40" class="outline-2">
<h2 id="orgdd0ed40"><span class="section-number-2">116</span> <a href="https://wordsinasentence.com/importune-in-a-sentence/">Importune</a></h2>
<div class="outline-text-2" id="text-116">
<p>
<code>to request (someone) pressingly and persistently for or to do something</code>
</p>

<ul class="org-ul">
<li>Even after I had politely declined and shut the door, I could hear the salesman continuing to importune me to let him demonstrate the expensive vacuum cleaner.</li>
<li>Realizing that the boss was in one of his rare good moods, I seized the opportunity to importune him for a raise.</li>
<li>Sometimes fundraisers will appeal to your emotions to importune for donations.</li>
<li>Most politicians importune voters for money as well as support.</li>
<li>Demetri <b>jumped at</b> <code>立即抓住</code> the opportunity to importune his neighbors to <b>pitch in</b> <code>加入</code> and build a playground for the children.</li>
<li>We will continue to importune City Council to put a stop sign on the corner; hopefully, it will be taken care of before something tragic occurs.</li>
<li>Every Christmas, malls are crowded with children who importune Santa for their heart’s desire as they try to convince him that they have been good all year.</li>
</ul>
</div>
</div>



<div id="outline-container-org5d0556b" class="outline-2">
<h2 id="org5d0556b"><span class="section-number-2">117</span> <a href="https://wordsinasentence.com/imprecation-in-a-sentence/">Imprecation</a></h2>
<div class="outline-text-2" id="text-117">
<p>
<code>a stated curse that bears a person ill-will</code>
</p>

<ul class="org-ul">
<li>The witch muttered an imprecation at the man who mistreated her.</li>
<li>Before the woman was burned at the stake, she uttered an imprecation against her accusers.</li>
<li>The woman screamed an imprecation at the police officer who tossed her to the ground.</li>
<li>Since I don’t believe in magic, the wizard’s imprecation didn’t scare me.</li>
</ul>
</div>
</div>



<div id="outline-container-org707b6b0" class="outline-2">
<h2 id="org707b6b0"><span class="section-number-2">118</span> <a href="https://wordsinasentence.com/imprint-in-a-sentence/">Imprint</a></h2>
<div class="outline-text-2" id="text-118">
<p>
<code>to mark or stamp something using pressure</code>
</p>

<ul class="org-ul">
<li>Wedding planners were able to imprint the address on all of the invitations.</li>
<li>The horse tried to run when the hot branding iron began to imprint into its <b>hide</b> <code>兽皮</code>.</li>
<li>Without a way to imprint the logo on the bags, the team began to brainstorm other marketing ideas.</li>
<li>The worker’s job was to imprint the company emblem onto the back of all pottery.</li>
</ul>
</div>
</div>



<div id="outline-container-orgcf21693" class="outline-2">
<h2 id="orgcf21693"><span class="section-number-2">119</span> <a href="https://wordsinasentence.com/incarcerate-in-a-sentence/">Incarcerate</a></h2>
<div class="outline-text-2" id="text-119">
<p>
<code>to lock a person up as a consequence for his or her actions</code>
</p>

<ul class="org-ul">
<li>The police are going to incarcerate the teen who keeps committing acts of violence.</li>
<li>If Jim doesn’t stop drinking and driving, the judge will have to incarcerate him.</li>
<li>The detective promised the Smiths she would incarcerate their daughter’s killer.</li>
<li>Because the king is opposed to executions, he’ll incarcerate the traitor for life.</li>
</ul>
</div>
</div>



<div id="outline-container-org194c439" class="outline-2">
<h2 id="org194c439"><span class="section-number-2">120</span> <a href="https://wordsinasentence.com/incinerate-in-a-sentence/">Incinerate</a></h2>
<div class="outline-text-2" id="text-120">
<p>
<code>destroy by burning</code>
</p>

<ul class="org-ul">
<li>If an atom bomb was dropped over Manhattan, the whole city would incinerate in a flash.</li>
<li>The thieves decided to incinerate the building after leaving fingerprints on the wall.</li>
<li>In the news today, two California wildfires incinerate 400 homes and displace 15,000 residents.</li>
<li>The plan was to incinerate Tyler’s garage, and reduce it to rubble.</li>
</ul>
</div>
</div>



<div id="outline-container-org18d7b21" class="outline-2">
<h2 id="org18d7b21"><span class="section-number-2">121</span> <a href="https://wordsinasentence.com/incite-in-a-sentence/">Incite</a></h2>
<div class="outline-text-2" id="text-121">
<p>
<code>to stir up or excite</code>
</p>

<ul class="org-ul">
<li>The racist man tried to incite hatred in his children by telling them falsehoods about minority groups.</li>
<li>During the pep rally, the cheerleaders worked hard to incite school spirit.</li>
<li>The Christian network will not air any programs that incite violence or hate.</li>
<li>Did you know you could be arrested for trying to incite an uprising against the government?</li>
<li>The dictator’s lavish party only served to incite the hatred of the starving people.</li>
<li>Since I was angry with my husband, I went out of my way to incite an argument with him.</li>
<li>The purpose of the terror alerts is not to incite panic but rather to make people more cautious.</li>
</ul>
</div>
</div>



<div id="outline-container-orgde2c5f2" class="outline-2">
<h2 id="orgde2c5f2"><span class="section-number-2">122</span> <a href="https://wordsinasentence.com/inclement-in-a-sentence/">Inclement</a></h2>
<div class="outline-text-2" id="text-122">
<p>
<code>unpleasant weather in being stormy, rainy, or snowy</code>
</p>

<ul class="org-ul">
<li>Inclement weather is causing us to postpone our picnic.</li>
<li>During hurricane season, cruises are often cancelled because of inclement conditions.</li>
<li>Jason and Heather have no plans to let inclement weather affect their outdoor wedding ceremony.</li>
<li>If you are concerned about inclement weather on your trip, please take a small umbrella in your suitcase.</li>
<li>Unaware the weather would soon turn inclement, Harry left home without a raincoat or umbrella.</li>
<li>Ron loves baseball so much he is willing to remain in the stands and cheer for his favorite team even during inclement weather.</li>
<li>Because of today’s inclement conditions, the children were not allowed to go outside during recess.</li>
</ul>
</div>
</div>



<div id="outline-container-org7decf6f" class="outline-2">
<h2 id="org7decf6f"><span class="section-number-2">123</span> <a href="https://wordsinasentence.com/incriminate-in-a-sentence/">Incriminate</a></h2>
<div class="outline-text-2" id="text-123">
<p>
<code>to suggest an individual has done something inappropriate or illegal</code>
</p>

<ul class="org-ul">
<li>The man refused to talk because he did not want to incriminate himself in court.</li>
<li>Before I can incriminate my rival as the school vandal, I need to put the spray cans in her car.</li>
<li>My dishonest boss tried to incriminate me for his thievery.</li>
<li>As long as the mobster never told his wife about his illegal deeds, he knew she could never incriminate him.</li>
</ul>
</div>
</div>



<div id="outline-container-orga9edb0a" class="outline-2">
<h2 id="orga9edb0a"><span class="section-number-2">124</span> <a href="https://wordsinasentence.com/incubus-in-a-sentence/">Incubus</a></h2>
<div class="outline-text-2" id="text-124">
<p>
<code>a demon or evil spirit supposed to descend upon sleeping women in order to have sex with them</code>
</p>

<ul class="org-ul">
<li>In the myth, the incubus surprised sleeping women with <b>sexual advances</b> <code>性骚扰</code>.</li>
<li>Incubus is a mythological creature that’s sole goal is to rape women who are resting.</li>
<li>After having sex with the evil incubus several times, the woman eventually succumbed to a painful death.</li>
<li>In ancient texts, a demon called an incubus would sleep with women and sometimes <b>impregnate</b> them.</li>
</ul>
</div>
</div>



<div id="outline-container-org880357f" class="outline-2">
<h2 id="org880357f"><span class="section-number-2">125</span> <a href="https://wordsinasentence.com/inculcate-in-a-sentence/">Inculcate</a></h2>
<div class="outline-text-2" id="text-125">
<p>
<code>to frequently instill an idea or belief firmly in someone's mind</code>
</p>

<ul class="org-ul">
<li>In order to inculcate a love of reading, the teacher encourages her students to read different types of literature.</li>
<li>My father spent most of his life trying to inculcate me with his values!</li>
<li>When my puppy chewed up my slippers, I realized how difficult it was to inculcate obedience in a young dog.</li>
<li>Do you feel our professors should inculcate us with their political views?</li>
<li>The goal of the cult leader was to inculcate millions of followers with his teachings.</li>
<li>In order to inculcate patriotism, the president held ten press conferences last month.</li>
<li>Although Pat had no interest in playing the piano, her mother still sought to inculcate her on the proper playing technique.</li>
</ul>
</div>
</div>
