ruby/I.org
* [[https://wordsinasentence.com/inculpate-in-a-sentence/][Inculpate]]

  =to incriminate or accuse someone of doing something=

  - Evidence was used to inculpate the suspects and lead to their eventual conviction.
  - The defense attorney has criticized the investigation, insisting that any findings have failed to inculpate his client.
  - Invoking his 5th amendment right during trial, the defendant did not have to give testimony that my inculpate himself.
  - A faint print in the mud was a match to the suspect’s shoe pattern and enough to inculpate him of the crime.



* [[https://wordsinasentence.com/incur-in-a-sentence/][Incur]]

  =acquire=

  - It was impossible to incur any debt after a year of being unemployed.
  - Because she did not pay her taxes on time, the business owner will incur a penalty this tax year.
  - The retiree was able to pull out his funds early, but he did incur a fee when doing so.
  - Purchasing an older vehicle may save money initially but can cause the buyer to incur higher than average repair costs.



* [[https://wordsinasentence.com/indemnify-in-a-sentence/][Indemnify]]

  =to provide with a payment for damage or loss=

  - Since Kurt was driving drunk, the insurance company will not indemnify him from the property damage he caused.
  - The trucking company will indemnify the victim of the car accident caused by the sleeping trucker.
  - Do you think the airline is going to indemnify the expense I incurred from missing my connecting flight?
  - The construction company is going to indemnify the worker who lost his arm because of another employee’s negligence.



* [[https://wordsinasentence.com/indignant-in-a-sentence/][Indignant]]

  =angry because of an unfair situation or someone's unfair behavior=

  - If I’m indignant, it’s because you threw that book at me!
  - The woman was indignant about the way she had been treated by the rude clerk.
  - Because the teacher accused him of cheating, the boy became indignant and walked out of the classroom.
  - Indignant at the waste of the company’s resources, the financial director cut the supply budget by sixty percent.
  - The protesters were so indignant that they began to throw stones at the police officers.
  - Many teachers become indignant when their students question their authority.
  - While I’m quite indignant the boy broke my window, I am pleased he took responsibility for his actions.



* [[https://wordsinasentence.com/indignity-in-a-sentence/][Indignity]]

  =a situation or event that makes an individual feel embarrassment=

  - I felt as though I suffered a huge indignity when my ex husband brought his young girlfriend to my birthday party.
  - During the game-making play, the star quarterback suffered the indignity of being sacked.
  - The warrior couldn’t bear the indignity of losing so he took his own life.
  - When I was ill, I experienced an indignity each time the aide walked away with my bed pan.



* [[https://wordsinasentence.com/induction-in-a-sentence/][Induction]]

  =a formal ceremony in which a person is appointed to an office or into military service=

  - The Girl Scout Induction Ceremony was taking place at the local meeting hall.
  - We watched the Presidential induction during history class.
  - The singer’s induction into the Hall of Fame was an extravagant affair.
  - At the end of the school year, the high school plans an induction of the incoming senior class.



* [[https://wordsinasentence.com/inebriated-in-a-sentence/][Inebriated]]

  =behaving as though affected by alcohol; drunk=

  - After leaving the restaurant, the police officer cornered the patron to see if he was inebriated.
  - An inebriated individual had to walk the chalk line after he was pulled over by the police.
  - The defendant was questioned by the prosecutor about the night in which he drove in an inebriated condition.
  - After attending the wine party, it was unexpected to see so many inebriated women staggering around.



* [[https://wordsinasentence.com/ineluctable-in-a-sentence/][Ineluctable]]

  =impossible to alter=

  - Perhaps there is no hope for Jerry because even after a year in rehab his drug addiction seems ineluctable.
  - Lee has the irritating habit of arguing his opinions as ineluctable facts.
  - As I listened to the paralyzed soldier speak, I was moved by his ineluctable spirit.
  - So many women try to fight the ineluctable aging process by having cosmetic surgery.
  - Even though Jim promised to stop seeing other women, Ellen refused to budge from her ineluctable decision to divorce him.
  - Always think before you speak because some words are ineluctable and cannot be taken back or changed.
  - When the governor refused to halt the execution, the prisoner realized his fate was ineluctable.



* [[https://wordsinasentence.com/inexpedient-in-a-sentence/][Inexpedient]]

  =impractical or unwise=

  - It would be inexpedient to go walking through the desert without several bottles of water to keep you hydrated.
  - I consider it inexpedient to spend money on leisure and entertainment when you barely have enough money to pay your rent.
  -  It is inexpedient to try and pack all of your things in your car when you could purchase a moving trailer or truck to carry most of it.
  - Many people like to spend money on inexpedient vanity products that serve no real purpose, like watches and fancy suits.



* [[https://wordsinasentence.com/infatuated-in-a-sentence/][Infatuated]]

  =to have a strong liking for someone  or something=

  - Even as a young boy, the singer was infatuated with music.
  - Jan was immediately infatuated with her attractive blind date.
  - Although Bruce thought he was in love with the young woman, he soon realized he was only infatuated with her.
  - The woman was so infatuated with the basketball player that she never missed a game.
  - After Rick realized he was no longer infatuated with his wife, he filed for divorce.
  - The infatuated student brought his teacher a red apple every day.
  - Even though Terry was infatuated with his coworker, he was too shy to express his feelings.



