ruby/I.html



<div id="outline-container-orgdc4bee3" class="outline-2">
<h2 id="orgdc4bee3"><span class="section-number-2">126</span> <a href="https://wordsinasentence.com/inculpate-in-a-sentence/">Inculpate</a></h2>
<div class="outline-text-2" id="text-126">
<p>
<code>to incriminate or accuse someone of doing something</code>
</p>

<ul class="org-ul">
<li>Evidence was used to inculpate the suspects and lead to their eventual conviction.</li>
<li>The defense attorney has criticized the investigation, insisting that any findings have failed to inculpate his client.</li>
<li>Invoking his 5th amendment right during trial, the defendant did not have to give testimony that may inculpate himself.</li>
<li>A faint print in the mud was a match to the suspect’s shoe pattern and enough to inculpate him of the crime.</li>
</ul>
</div>
</div>



<div id="outline-container-org3210bc9" class="outline-2">
<h2 id="org3210bc9"><span class="section-number-2">127</span> <a href="https://wordsinasentence.com/incur-in-a-sentence/">Incur</a></h2>
<div class="outline-text-2" id="text-127">
<p>
<code>acquire</code>
</p>

<ul class="org-ul">
<li>It was impossible to incur any debt after a year of being unemployed.</li>
<li>Because she did not pay her taxes on time, the business owner will incur a penalty this tax year.</li>
<li>The retiree was able to pull out his funds early, but he did incur a fee when doing so.</li>
<li>Purchasing an older vehicle may save money initially but can cause the buyer to incur higher than average repair costs.</li>
</ul>
</div>
</div>



<div id="outline-container-org5328151" class="outline-2">
<h2 id="org5328151"><span class="section-number-2">128</span> <a href="https://wordsinasentence.com/indemnify-in-a-sentence/">Indemnify</a></h2>
<div class="outline-text-2" id="text-128">
<p>
<code>to provide with a payment for damage or loss</code>
</p>

<ul class="org-ul">
<li>Since Kurt was driving drunk, the insurance company will not indemnify him from the property damage he caused.</li>
<li>The trucking company will indemnify the victim of the car accident caused by the sleeping trucker.</li>
<li>Do you think the airline is going to indemnify the expense I incurred from missing my connecting flight?</li>
<li>The construction company is going to indemnify the worker who lost his arm because of another employee’s negligence.</li>
</ul>
</div>
</div>



<div id="outline-container-org9e8f944" class="outline-2">
<h2 id="org9e8f944"><span class="section-number-2">129</span> <a href="https://wordsinasentence.com/indignant-in-a-sentence/">Indignant</a></h2>
<div class="outline-text-2" id="text-129">
<p>
<code>angry because of an unfair situation or someone's unfair behavior</code>
</p>

<ul class="org-ul">
<li>If I’m indignant, it’s because you threw that book at me!</li>
<li>The woman was indignant about the way she had been treated by the rude clerk.</li>
<li>Because the teacher accused him of cheating, the boy became indignant and walked out of the classroom.</li>
<li>Indignant at the waste of the company’s resources, the financial director cut the supply budget by sixty percent.</li>
<li>The protesters were so indignant that they began to throw stones at the police officers.</li>
<li>Many teachers become indignant when their students question their authority.</li>
<li>While I’m quite indignant the boy broke my window, I am pleased he took responsibility for his actions.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf3f907b" class="outline-2">
<h2 id="orgf3f907b"><span class="section-number-2">130</span> <a href="https://wordsinasentence.com/indignity-in-a-sentence/">Indignity</a></h2>
<div class="outline-text-2" id="text-130">
<p>
<code>a situation or event that makes an individual feel embarrassment</code>
</p>

<ul class="org-ul">
<li>I felt as though I suffered a huge indignity when my ex husband brought his young girlfriend to my birthday party.</li>
<li>During the game-making play, the star quarterback suffered the indignity of being sacked.</li>
<li>The warrior couldn’t bear the indignity of losing so he took his own life.</li>
<li>When I was ill, I experienced an indignity each time the aide <b>walked away with</b> <code>顺手拿走</code> my <b>bed pan</b> <code>夜壶</code>.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc9d2c10" class="outline-2">
<h2 id="orgc9d2c10"><span class="section-number-2">131</span> <a href="https://wordsinasentence.com/induction-in-a-sentence/">Induction</a></h2>
<div class="outline-text-2" id="text-131">
<p>
<code>a formal ceremony in which a person is appointed to an office or into military service</code>
</p>

<ul class="org-ul">
<li>The Girl Scout Induction Ceremony was taking place at the local meeting hall.</li>
<li>We watched the Presidential induction during history class.</li>
<li>The singer’s induction into the Hall of Fame was an extravagant affair.</li>
<li>At the end of the school year, the high school plans an induction of the incoming senior class.</li>
</ul>
</div>
</div>



<div id="outline-container-org2d90fbe" class="outline-2">
<h2 id="org2d90fbe"><span class="section-number-2">132</span> <a href="https://wordsinasentence.com/inebriated-in-a-sentence/">Inebriated</a></h2>
<div class="outline-text-2" id="text-132">
<p>
<code>behaving as though affected by alcohol; drunk</code>
</p>

<ul class="org-ul">
<li>After leaving the restaurant, the police officer cornered the patron to see if he was inebriated.</li>
<li>An inebriated individual had to walk the chalk line after he was pulled over by the police.</li>
<li>The defendant was questioned by the prosecutor about the night in which he drove in an inebriated condition.</li>
<li>After attending the wine party, it was unexpected to see so many inebriated women staggering around.</li>
</ul>
</div>
</div>



<div id="outline-container-org533b47b" class="outline-2">
<h2 id="org533b47b"><span class="section-number-2">133</span> <a href="https://wordsinasentence.com/ineluctable-in-a-sentence/">Ineluctable</a></h2>
<div class="outline-text-2" id="text-133">
<p>
<code>impossible to alter</code>
</p>

<ul class="org-ul">
<li>Perhaps there is no hope for Jerry because even after a year in rehab his drug addiction seems ineluctable.</li>
<li>Lee has the irritating habit of arguing his opinions as ineluctable facts.</li>
<li>As I listened to the paralyzed soldier speak, I was moved by his ineluctable spirit.</li>
<li>So many women try to fight the ineluctable aging process by having cosmetic surgery.</li>
<li>Even though Jim promised to stop seeing other women, Ellen refused to <b>budge</b> <code>让步</code> from her ineluctable decision to divorce him.</li>
<li>Always think before you speak because some words are ineluctable and cannot be taken back or changed.</li>
<li>When the governor refused to halt the execution, the prisoner realized his fate was ineluctable.</li>
</ul>
</div>
</div>



<div id="outline-container-org2e83a52" class="outline-2">
<h2 id="org2e83a52"><span class="section-number-2">134</span> <a href="https://wordsinasentence.com/inexpedient-in-a-sentence/">Inexpedient</a></h2>
<div class="outline-text-2" id="text-134">
<p>
<code>impractical or unwise</code>
</p>

<ul class="org-ul">
<li>It would be inexpedient to go walking through the desert without several bottles of water to keep you hydrated.</li>
<li>I consider it inexpedient to spend money on leisure and entertainment when you barely have enough money to pay your rent.</li>
<li>It is inexpedient to try and pack all of your things in your car when you could purchase a moving trailer or truck to carry most of it.</li>
<li>Many people like to spend money on inexpedient vanity products that serve no real purpose, like watches and fancy suits.</li>
</ul>
</div>
</div>



<div id="outline-container-org16ccee1" class="outline-2">
<h2 id="org16ccee1"><span class="section-number-2">135</span> <a href="https://wordsinasentence.com/infatuated-in-a-sentence/">Infatuated</a></h2>
<div class="outline-text-2" id="text-135">
<p>
<code>to have a strong liking for someone or something</code>
</p>

<ul class="org-ul">
<li>Even as a young boy, the singer was infatuated with music.</li>
<li>Jan was immediately infatuated with her attractive blind date.</li>
<li>Although Bruce thought he was in love with the young woman, he soon realized he was only infatuated with her.</li>
<li>The woman was so infatuated with the basketball player that she never missed a game.</li>
<li>After Rick realized he was no longer infatuated with his wife, he filed for divorce.</li>
<li>The infatuated student brought his teacher a red apple every day.</li>
<li>Even though Terry was infatuated with his coworker, he was too shy to express his feelings.</li>
</ul>
</div>
</div>
