ruby/I.org
* [[https://wordsinasentence.com/infelicitous-in-a-sentence/][Infelicitous]]

  =not well-timed or suitable=

  - Given the host’s spouse had recently died, my comment about wanting to die was infelicitous.
  - Wilma’s see-through dress stood out as infelicitous at her father’s funeral.
  - How dare you make an infelicitous comment about the pregnant woman’s weight?
  - The public was outraged when the rapper made an infelicitous remark about the pope.



* [[https://wordsinasentence.com/influx-in-a-sentence/][Influx]]

  =the arrival of a large flow of people, things, or emotions=

  - I was unprepared for the influx of joy I felt when my boyfriend proposed.
  - Since the border patrol is ill prepared to deal with the influx of people arriving at the border, many immigrants are entering the country illegally.
  - The influx of customers sent the manager running to the storeroom for additional promotional items.
  - With the influx of families moving into the city, the prices of single-family homes have reached an all-time high.



* [[https://wordsinasentence.com/infraction-in-a-sentence/][Infraction]]

  =a violation of the rules=

  - One more infraction and Jason will be suspended from school.
  - My mother became angry when my sister refused to apologize for her infraction.
  - Although Susan is now a nun, in her younger days she was once arrested for a minor infraction.
  - The police ignored Jill’s minor infraction because it was her first violation of the law.
  - Since we all know Fred as the teacher’s pet, we were shocked when he received detention for a minor infraction.
  - The judge warned Carl that if he committed another driving infraction he would lose his license.
  - As soon as the referee saw the infraction, he threw a yellow flag on the field.



* [[https://wordsinasentence.com/infringe-in-a-sentence/][Infringe]]

  =to trespass upon something=

  - Having that much work to do at home will only infringe upon my time with my family.
  - Jack did not want any children because he knew their needs would infringe on his social life.
  - Does Cara infringe upon her children’s privacy by checking their emails?
  - Conspiracy groups believe the government is constantly passing laws that infringe on the rights of the people.
  - When Joan wrote her essay, she went out of her way to make sure she did not infringe upon another writer’s ideas.
  - The judge ruled the policeman’s entry into my home without a warrant did infringe upon my rights as a citizen.
  - As I looked at my competitor’s product, I realized my rival had chosen to infringe upon my patent with an item almost identical to my own.




* [[https://wordsinasentence.com/ingress-in-a-sentence/][Ingress]]

  =a means of entry or the action of going into an area=

  - The glass doors on the hotel’s second floor provide ingress into the mall.
  - Since the passenger doors of my jeep don’t work, my children sometimes use the trunk door as a means of ingress.
  - If you sit in front of the doorway, you are creating  a safety hazard by blocking the path of ingress into the hospital.
  - According to federal law, any airline passenger who attempts forceful ingress into a cockpit will be prosecuted.



* [[https://wordsinasentence.com/iniquity-in-a-sentence/][Iniquity]]

  =extremely immoral or unfair behavior=

  - When I went to my brother’s college dorm, I saw drunken boys exhibiting iniquity towards girls.
  - My grandmother, who grew up in a small town where people never locked their doors, saw big cities as dens of iniquity because of their crime rates.
  - Because the dictator killed all his enemies, he was seen as a symbol of iniquity.
  - Those who are quick to criticize the bad deeds of others should first look at their own acts of iniquity.
  - As a result of being scarred by the iniquity of others, Henry grew up to become a very mean man.
  - Peter abandoned a life of iniquity and became a contributing member of his local church.
  - While Megan wanted to do volunteer work every Saturday, her husband chose to stay home and watch movies about sin and iniquity.



* [[https://wordsinasentence.com/inkling-in-a-sentence/][Inkling]]

  =an idea, thought, or suggestion=

  - Even after Phil watched the teacher perform sample problems, he still had no inkling of how to complete the assignment.
  - I had an inkling the housekeeper was the killer after watching the show for only five minutes.
  - As Jill spoke to the police, she realized she had no inkling of who her mysterious boyfriend was.
  - The detective had an inkling the witness was lying because she kept avoiding his eye contact.



* [[https://wordsinasentence.com/innuendo-in-a-sentence/][Innuendo]]

  =a statement that indirectly suggests someone has done something immoral, improper, etc.=

  - Although the dialogue in the book is not sexually explicit, the writer makes great use of innuendo to convey his message.
  - The top advertisers frequently use a form of innuendo to sell their products.
  - Instead of being blunt with Henry about his drug problem, I tried using an innuendo to catch his attention.
  - Jason used an innuendo to spread negative rumors about his ex-wife.
  - After I heard my mother-in-law made an innuendo about me, I banned her from my home.
  - The company president refused to respond to the innuendo about fraud charges.
  - If you respond to Kelly’s innuendo, people will consider her false statement true.



* [[https://wordsinasentence.com/inscribe-in-a-sentence/][Inscribe]]

  =to write on an object=

  - Jake asked the jeweler to inscribe a beautiful message on the engagement ring.
  - Using a knife, the boy tried to inscribe his name onto the metal table.
  - It will take the machine only a few minutes to inscribe the words on the plaque.
  - When Bill retires after fifty years, the firm will buy him a gold watch and inscribe his years of service on it.



