ruby/I.html



<div id="outline-container-orgc233c23" class="outline-2">
<h2 id="orgc233c23"><span class="section-number-2">136</span> <a href="https://wordsinasentence.com/infelicitous-in-a-sentence/">Infelicitous</a></h2>
<div class="outline-text-2" id="text-136">
<p>
<code>not well-timed or suitable</code>
</p>

<ul class="org-ul">
<li>Given the host’s spouse had recently died, my comment about wanting to die was infelicitous.</li>
<li>Wilma’s see-through dress stood out as infelicitous at her father’s funeral.</li>
<li>How dare you make an infelicitous comment about the pregnant woman’s weight?</li>
<li>The public was outraged when the rapper made an infelicitous remark about the pope.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc25f143" class="outline-2">
<h2 id="orgc25f143"><span class="section-number-2">137</span> <a href="https://wordsinasentence.com/influx-in-a-sentence/">Influx</a></h2>
<div class="outline-text-2" id="text-137">
<p>
<code>the arrival of a large flow of people, things, or emotions</code>
</p>

<ul class="org-ul">
<li>I was unprepared for the influx of joy I felt when my boyfriend proposed.</li>
<li>Since the border patrol is ill prepared to deal with the influx of people arriving at the border, many immigrants are entering the country illegally.</li>
<li>The influx of customers sent the manager running to the storeroom for additional promotional items.</li>
<li>With the influx of families moving into the city, the prices of single-family homes have reached an all-time high.</li>
</ul>
</div>
</div>



<div id="outline-container-org8e95787" class="outline-2">
<h2 id="org8e95787"><span class="section-number-2">138</span> <a href="https://wordsinasentence.com/infraction-in-a-sentence/">Infraction</a></h2>
<div class="outline-text-2" id="text-138">
<p>
<code>a violation of the rules</code>
</p>

<ul class="org-ul">
<li>One more infraction and Jason will be suspended from school.</li>
<li>My mother became angry when my sister refused to apologize for her infraction.</li>
<li>Although Susan is now a nun, in her younger days she was once arrested for a minor infraction.</li>
<li>The police ignored Jill’s minor infraction because it was her first violation of the law.</li>
<li>Since we all know Fred as the teacher’s pet, we were shocked when he received detention for a minor infraction.</li>
<li>The judge warned Carl that if he committed another driving infraction he would lose his license.</li>
<li>As soon as the referee saw the infraction, he threw a yellow flag on the field.</li>
</ul>
</div>
</div>



<div id="outline-container-org378a7a4" class="outline-2">
<h2 id="org378a7a4"><span class="section-number-2">139</span> <a href="https://wordsinasentence.com/infringe-in-a-sentence/">Infringe</a></h2>
<div class="outline-text-2" id="text-139">
<p>
<code>to trespass upon something</code>
</p>

<ul class="org-ul">
<li>Having that much work to do at home will only infringe upon my time with my family.</li>
<li>Jack did not want any children because he knew their needs would infringe on his social life.</li>
<li>Does Cara infringe upon her children’s privacy by checking their emails?</li>
<li>Conspiracy groups believe the government is constantly passing laws that infringe on the rights of the people.</li>
<li>When Joan wrote her essay, she went out of her way to make sure she did not infringe upon another writer’s ideas.</li>
<li>The judge ruled the policeman’s entry into my home without a warrant did infringe upon my rights as a citizen.</li>
<li>As I looked at my competitor’s product, I realized my rival had chosen to infringe upon my patent with an item almost identical to my own.</li>
</ul>
</div>
</div>




<div id="outline-container-orgf8be2d7" class="outline-2">
<h2 id="orgf8be2d7"><span class="section-number-2">140</span> <a href="https://wordsinasentence.com/ingress-in-a-sentence/">Ingress</a></h2>
<div class="outline-text-2" id="text-140">
<p>
<code>a means of entry or the action of going into an area</code>
</p>

<ul class="org-ul">
<li>The glass doors on the hotel’s second floor provide ingress into the mall.</li>
<li>Since the passenger doors of my jeep don’t work, my children sometimes use the trunk door as a means of ingress.</li>
<li>If you sit in front of the doorway, you are creating a safety hazard by blocking the path of ingress into the hospital.</li>
<li>According to federal law, any airline passenger who attempts forceful ingress into a <b>cockpit</b> will be prosecuted.</li>
</ul>
</div>
</div>



<div id="outline-container-org4b2b870" class="outline-2">
<h2 id="org4b2b870"><span class="section-number-2">141</span> <a href="https://wordsinasentence.com/iniquity-in-a-sentence/">Iniquity</a></h2>
<div class="outline-text-2" id="text-141">
<p>
<code>extremely immoral or unfair behavior</code>
</p>

<ul class="org-ul">
<li>When I went to my brother’s college dorm, I saw drunken boys exhibiting iniquity towards girls.</li>
<li>My grandmother, who grew up in a small town where people never locked their doors, saw big cities as dens of iniquity because of their crime rates.</li>
<li>Because the dictator killed all his enemies, he was seen as a symbol of iniquity.</li>
<li>Those who are quick to criticize the bad deeds of others should first look at their own acts of iniquity.</li>
<li>As a result of being scarred by the iniquity of others, Henry grew up to become a very mean man.</li>
<li>Peter abandoned a life of iniquity and became a contributing member of his local church.</li>
<li>While Megan wanted to do volunteer work every Saturday, her husband chose to stay home and watch movies about sin and iniquity.</li>
</ul>
</div>
</div>



<div id="outline-container-org9383c73" class="outline-2">
<h2 id="org9383c73"><span class="section-number-2">142</span> <a href="https://wordsinasentence.com/inkling-in-a-sentence/">Inkling</a></h2>
<div class="outline-text-2" id="text-142">
<p>
<code>an idea, thought, or suggestion</code>
</p>

<ul class="org-ul">
<li>Even after Phil watched the teacher perform sample problems, he still had no inkling of how to complete the assignment.</li>
<li>I had an inkling the housekeeper was the killer after watching the show for only five minutes.</li>
<li>As Jill spoke to the police, she realized she had no inkling of who her mysterious boyfriend was.</li>
<li>The detective had an inkling the witness was lying because she kept avoiding his eye contact.</li>
</ul>
</div>
</div>



<div id="outline-container-org162e219" class="outline-2">
<h2 id="org162e219"><span class="section-number-2">143</span> <a href="https://wordsinasentence.com/innuendo-in-a-sentence/">Innuendo</a></h2>
<div class="outline-text-2" id="text-143">
<p>
<code>a statement that indirectly suggests someone has done something immoral, improper, etc.</code>
</p>

<ul class="org-ul">
<li>Although the dialogue in the book is not sexually explicit, the writer makes great use of innuendo to convey his message.</li>
<li>The top advertisers frequently use a form of innuendo to sell their products.</li>
<li>Instead of being <b>blunt</b> <code>坦率</code> with Henry about his drug problem, I tried using an innuendo to catch his attention.</li>
<li>Jason used an innuendo to spread negative rumors about his ex-wife.</li>
<li>After I heard my mother-in-law made an innuendo about me, I banned her from my home.</li>
<li>The company president refused to respond to the innuendo about fraud charges.</li>
<li>If you respond to Kelly’s innuendo, people will consider her false statement true.</li>
</ul>
</div>
</div>



<div id="outline-container-org2bceac3" class="outline-2">
<h2 id="org2bceac3"><span class="section-number-2">144</span> <a href="https://wordsinasentence.com/inscribe-in-a-sentence/">Inscribe</a></h2>
<div class="outline-text-2" id="text-144">
<p>
<code>to write on an object</code>
</p>

<ul class="org-ul">
<li>Jake asked the jeweler to inscribe a beautiful message on the engagement ring.</li>
<li>Using a knife, the boy tried to inscribe his name onto the metal table.</li>
<li>It will take the machine only a few minutes to inscribe the words on the plaque.</li>
<li>When Bill retires after fifty years, the firm will buy him a gold watch and inscribe his years of service on it.</li>
</ul>
</div>
</div>
