ruby/I.org
* [[https://wordsinasentence.com/inscrutable-in-a-sentence/][Inscrutable]]

  =incapable of being investigated or understood=

  - When Larry wrote the letter, he was so tired the writing was nearly inscrutable.
  - Not even the leading experts in criminology could understand the killer’s inscrutable motives.
  - In situations where evidence is lacking, some murder cases remain inscrutable forever.
  - Because my father normally had an inscrutable look on his face, I rarely knew what he was thinking.
  - My professor spoke so rapidly that his lectures were inscrutable to everyone in the auditorium.
  - Because of the discolored paint, the signature on the painting is inscrutable.
  - Although I tried to guess my fate by looking directly at the judge, my effort was futile because his face was inscrutable.



* [[https://wordsinasentence.com/insignia-in-a-sentence/][Insignia]]

  =a patch or badge that indicates a person's official or military rank, or which group or organization they belong to=

  - Because Rita is a Chicago Cubs fan, she wears the team logo as her insignia.
  - Every insignia that could be earned in the military was displayed in the case.
  - When I opened the door to the Corporal Institute, the insignia representing the school was displayed for everyone to see.
  - On the cover of the training manual was an insignia representing the dedication and determination needed to succeed in the elite program.



* [[https://wordsinasentence.com/insouciant-in-a-sentence/][Insouciant]]

  =not concerned about anything; carefree=

  - The insouciant mother did not blink an eye when her son complained of a tummy ache.
  - Because Bill is insouciant  and not concerned about his retirement, he does not worry about saving money.
  - Since Jane is insouciant about her health, she does not bother to take her medication.
  - The insouciant waitress did not seem to care that Matt had to wait over an hour for his food.
  - When the lion trainer walked into the lion’s cage in an insouciant manner, he let the animal know he was not threatened in any way.
  - Instead of Will being angry when he caught his wife cheating, he was insouciant and laughed off the affair.
  - Because Lily was well prepared for the test, she was insouciant about earning a passing grade.



* [[https://wordsinasentence.com/instill-in-a-sentence/][Instill]]

  =to slowly cause a person to develop a feeling or attitude=

  - The detective tried to instill fear in the suspect by telling him about the dangers of prison.
  - As a teacher, I am always eager to find ways to instill a love of learning in my students.
  - The leader hopes to instill voters with a passion for reorganizing the government.
  - In a relationship, you have to be reliable in order to instill trust in your partner.



* [[https://wordsinasentence.com/insuperable-in-a-sentence/][Insuperable]]

  =not possible to achieve=

  - No matter how hard the kitten tried, it could not face the insuperable challenge of climbing back down the tree.
  - Charles is a foolish dreamer who comes up with insuperable plans that he never achieves.
  - Just when it seemed as though victory was insuperable, our football team was able to make a winning play that earned us a spot in the state championship.
  - Despite what doctors described as insuperable odds, the wounded man survived his ordeal.
  - Due to a bad case of writer’s block, the deadline set by my publisher has become insuperable.
  - Since the two countries have been at war for centuries, it is obvious the construction of a peace agreement is insuperable.
  - During the Special Olympics, thousands of men and women display their abilities to win insuperable challenges.



* [[https://wordsinasentence.com/insurrection-in-a-sentence/][Insurrection]]

  =an organized uprising against an authoritative body=

  - During the insurrection, several convicts held a prison doctor hostage.
  - By way of an insurrection, the lower class overthrew the selfish aristocrats during the French Revolution.
  - If the insurrection against the tyrant fails, many innocent people will continue to be killed on a daily basis.
  - Fortunately a government agency discovered the group’s plan for insurrection before the highest politicians in the nation were murdered.



* [[https://wordsinasentence.com/intercede-in-a-sentence/][Intercede]]

  =to try to help settle an argument or disagreement between two or more people or groups=

  - Even though a mother-in-law may have good intentions, I do not believe she should ever intercede in an argument between a husband and a wife.
  - The lawyer will intercede for his client in the court proceedings.
  - If necessary, the police force was ready to intercede between the protestors and the company security team.
  - Your union representative will intercede with management on your behalf.
  - As a judge, Frank has to intercede on disagreements between individuals on a daily basis.
  - One of the religious leader’s duties is to intercede with God on behalf of the people.
  - If the debate becomes too heated, the moderator will intercede to break up the argument.



* [[https://wordsinasentence.com/interloper-in-a-sentence/][Interloper]]

  =someone who intrudes on the privacy or property of another without permission=

  - Since she has never been able to let her son go, my mother-in-law is an interloper in my marriage.
  - Because I am not an actor, I feel like an interloper in this acting class.
  - Although he was an atheist, Jason did not feel as though he was an interloper when he attended his friend’s church wedding.
  - To make sure no one felt like an interloper, William walked around the room and talked to everyone at the party.
  - When the new guy moved into our dormitory, it took a long time for us to see him as anything other than an interloper.
  - We called the police on the interloper we caught peeking through our bedroom window.
  - Although she was nice to him, Henry still viewed his stepmother as an interloper.



* [[https://wordsinasentence.com/interlude-in-a-sentence/][Interlude]]

  =a short period of time that comes in the middle of an event or situation=

  - We exited the theater during the short interlude to purchase something to eat.
  - After sitting in court for five hours, the judge finally announced that they would stop for a twenty-minute interlude.
  - The show paused for a musical interlude which gave us some time to stand up and stretch.
  - During the short interlude, the presidential contestant walked off of the stage and began to mingle with the audience.



