ruby/I.html



<div id="outline-container-org24d6468" class="outline-2">
<h2 id="org24d6468"><span class="section-number-2">145</span> <a href="https://wordsinasentence.com/inscrutable-in-a-sentence/">Inscrutable</a></h2>
<div class="outline-text-2" id="text-145">
<p>
<code>incapable of being investigated or understood</code>
</p>

<ul class="org-ul">
<li>When Larry wrote the letter, he was so tired the writing was nearly inscrutable.</li>
<li>Not even the leading experts in criminology could understand the killer’s inscrutable motives.</li>
<li>In situations where evidence is lacking, some murder cases remain inscrutable forever.</li>
<li>Because my father normally had an inscrutable look on his face, I rarely knew what he was thinking.</li>
<li>My professor spoke so rapidly that his lectures were inscrutable to everyone in the auditorium.</li>
<li>Because of the discolored paint, the signature on the painting is inscrutable.</li>
<li>Although I tried to guess my fate by looking directly at the judge, my effort was futile because his face was inscrutable.</li>
</ul>
</div>
</div>



<div id="outline-container-org0eb99dc" class="outline-2">
<h2 id="org0eb99dc"><span class="section-number-2">146</span> <a href="https://wordsinasentence.com/insignia-in-a-sentence/">Insignia</a></h2>
<div class="outline-text-2" id="text-146">
<p>
<code>a patch or badge that indicates a person's official or military rank, or which group or organization they belong to</code>
</p>

<ul class="org-ul">
<li>Because Rita is a Chicago Cubs fan, she wears the team logo as her insignia.</li>
<li>Every insignia that could be earned in the military was displayed in the case.</li>
<li>When I opened the door to the Corporal Institute, the insignia representing the school was displayed for everyone to see.</li>
<li>On the cover of the training manual was an insignia representing the dedication and determination needed to succeed in the elite program.</li>
</ul>
</div>
</div>



<div id="outline-container-orgf432277" class="outline-2">
<h2 id="orgf432277"><span class="section-number-2">147</span> <a href="https://wordsinasentence.com/insouciant-in-a-sentence/">Insouciant</a></h2>
<div class="outline-text-2" id="text-147">
<p>
<code>not concerned about anything; carefree</code>
</p>

<ul class="org-ul">
<li>The insouciant mother did not blink an eye when her son complained of a tummy ache.</li>
<li>Because Bill is insouciant and not concerned about his retirement, he does not worry about saving money.</li>
<li>Since Jane is insouciant about her health, she does not bother to take her medication.</li>
<li>The insouciant waitress did not seem to care that Matt had to wait over an hour for his food.</li>
<li>When the lion trainer walked into the lion’s cage in an insouciant manner, he let the animal know he was not threatened in any way.</li>
<li>Instead of Will being angry when he caught his wife cheating, he was insouciant and laughed off the affair.</li>
<li>Because Lily was well prepared for the test, she was insouciant about earning a passing grade.</li>
</ul>
</div>
</div>



<div id="outline-container-orgc336320" class="outline-2">
<h2 id="orgc336320"><span class="section-number-2">148</span> <a href="https://wordsinasentence.com/instill-in-a-sentence/">Instill</a></h2>
<div class="outline-text-2" id="text-148">
<p>
<code>to slowly cause a person to develop a feeling or attitude</code>
</p>

<ul class="org-ul">
<li>The detective tried to instill fear in the suspect by telling him about the dangers of prison.</li>
<li>As a teacher, I am always eager to find ways to instill a love of learning in my students.</li>
<li>The leader hopes to instill voters with a passion for reorganizing the government.</li>
<li>In a relationship, you have to be reliable in order to instill trust in your partner.</li>
</ul>
</div>
</div>



<div id="outline-container-org8d43289" class="outline-2">
<h2 id="org8d43289"><span class="section-number-2">149</span> <a href="https://wordsinasentence.com/insuperable-in-a-sentence/">Insuperable</a></h2>
<div class="outline-text-2" id="text-149">
<p>
<code>not possible to achieve</code>
</p>

<ul class="org-ul">
<li>No matter how hard the kitten tried, it could not face the insuperable challenge of climbing back down the tree.</li>
<li>Charles is a foolish dreamer who comes up with insuperable plans that he never achieves.</li>
<li>Just when it seemed as though victory was insuperable, our football team was able to make a winning play that earned us a spot in the state championship.</li>
<li>Despite what doctors described as insuperable odds, the wounded man survived his ordeal.</li>
<li>Due to a bad case of writer’s block, the deadline set by my publisher has become insuperable.</li>
<li>Since the two countries have been at war for centuries, it is obvious the construction of a peace agreement is insuperable.</li>
<li>During the Special Olympics, thousands of men and women display their abilities to win insuperable challenges.</li>
</ul>
</div>
</div>



<div id="outline-container-org817f494" class="outline-2">
<h2 id="org817f494"><span class="section-number-2">150</span> <a href="https://wordsinasentence.com/insurrection-in-a-sentence/">Insurrection</a></h2>
<div class="outline-text-2" id="text-150">
<p>
<code>an organized uprising against an authoritative body</code>
</p>

<ul class="org-ul">
<li>During the insurrection, several convicts held a prison doctor hostage.</li>
<li>By way of an insurrection, the lower class overthrew the selfish aristocrats during the French Revolution.</li>
<li>If the insurrection against the tyrant fails, many innocent people will continue to be killed on a daily basis.</li>
<li>Fortunately a government agency discovered the group’s plan for insurrection before the highest politicians in the nation were murdered.</li>
</ul>
</div>
</div>



<div id="outline-container-org92c89df" class="outline-2">
<h2 id="org92c89df"><span class="section-number-2">151</span> <a href="https://wordsinasentence.com/intercede-in-a-sentence/">Intercede</a></h2>
<div class="outline-text-2" id="text-151">
<p>
<code>to try to help settle an argument or disagreement between two or more people or groups</code>
</p>

<ul class="org-ul">
<li>Even though a mother-in-law may have good intentions, I do not believe she should ever intercede in an argument between a husband and a wife.</li>
<li>The lawyer will intercede for his client in the court proceedings.</li>
<li>If necessary, the police force was ready to intercede between the protestors and the company security team.</li>
<li>Your union representative will intercede with management on your behalf.</li>
<li>As a judge, Frank has to intercede on disagreements between individuals on a daily basis.</li>
<li>One of the religious leader’s duties is to intercede with God on behalf of the people.</li>
<li>If the debate becomes too heated, the <b>moderator</b> will intercede to break up the argument.</li>
</ul>
</div>
</div>



<div id="outline-container-org8aede69" class="outline-2">
<h2 id="org8aede69"><span class="section-number-2">152</span> <a href="https://wordsinasentence.com/interloper-in-a-sentence/">Interloper</a></h2>
<div class="outline-text-2" id="text-152">
<p>
<code>someone who intrudes on the privacy or property of another without permission</code>
</p>

<ul class="org-ul">
<li>Since she has never been able to let her son go, my mother-in-law is an interloper in my marriage.</li>
<li>Because I am not an actor, I feel like an interloper in this acting class.</li>
<li>Although he was an atheist, Jason did not feel as though he was an interloper when he attended his friend’s church wedding.</li>
<li>To make sure no one felt like an interloper, William walked around the room and talked to everyone at the party.</li>
<li>When the new guy moved into our dormitory, it took a long time for us to see him as anything other than an interloper.</li>
<li>We called the police on the interloper we caught peeking through our bedroom window.</li>
<li>Although she was nice to him, Henry still viewed his stepmother as an interloper.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdb19a20" class="outline-2">
<h2 id="orgdb19a20"><span class="section-number-2">153</span> <a href="https://wordsinasentence.com/interlude-in-a-sentence/">Interlude</a></h2>
<div class="outline-text-2" id="text-153">
<p>
<code>a short period of time that comes in the middle of an event or situation</code>
</p>

<ul class="org-ul">
<li>We exited the theater during the short interlude to purchase something to eat.</li>
<li>After sitting in court for five hours, the judge finally announced that they would stop for a twenty-minute interlude.</li>
<li>The show paused for a musical interlude which gave us some time to stand up and stretch.</li>
<li>During the short interlude, the presidential contestant walked off of the stage and began to mingle with the audience.</li>
</ul>
</div>
</div>
