ruby/I.org
* [[https://wordsinasentence.com/intermission-in-a-sentence/][Intermission]]

  =a scheduled break of about 10 to 15 minutes in the middle of a play, movie or concert=

  - The woman quickly consumed the candy and drink during the play’s intermission because she could not take it back in the theater.
  - When the movie came back on, we knew the intermission was over and we had to stop stretching our legs.
  - The small child’s mother couldn’t wait until the intermission since her son began to squirm in his seat after two hours of the play.
  - Lights in the theater flickered indicating that the intermission was over and the play would continue in a few minutes.



* [[https://wordsinasentence.com/intermittent-in-a-sentence/][Intermittent]]

  =displaying in a random pattern; not consistent=

  - When the cops arrived, the loud intermittent noise had stopped.
  - The baby’s crying is intermittent and can occur at anytime.
  - Since the power outages are intermittent, I am not sure If you have enough time to cook your dinner.
  - The holiday lights are intermittent and flicker on and off constantly.
  - Because my spasms are intermittent and occur randomly, it is hard for the doctor to diagnose my condition.
  - The reason I broke up with my boyfriend was because of his intermittent verbal assaults that often happened without warning.
  - While Jeremy was ill, he had an intermittent fever that came and went for three days.



* [[https://wordsinasentence.com/interpose-in-a-sentence/][Interpose]]

  =to involve oneself or to insert=

  - It can be dangerous to interpose yourself between a cat fight.
  - The mediator looked for the opening to interpose himself and break up the debate.
  - He hoped to interpose the container to keep both ingredients separate.
  - As if an afterthought, the senator decided to interpose an entirely new position in his platform.
  - If you interpose in a marital argument, be prepared to be yelled at by both parties.
  - Though he was not invited, he felt he should interpose his point of view.
  - The politician tried to interpose his unusual stance into the debate to throw off his opponents.



* [[https://wordsinasentence.com/interrogate-in-a-sentence/][Interrogate]]

  =to question someone in a commanding manner=

  - If Jill brings a boy home, she knows her father is going to interrogate him by asking hundreds of questions.
  - The prosecutor will interrogate the defendant during the trial.
  - Because I came home late last night, I know my parents are going to interrogate me over breakfast.
  - Does the government have the right to interrogate suspected terrorists without their attorneys present?



* [[https://wordsinasentence.com/inundate-in-a-sentence/][Inundate]]

  =overwhelm with things or people=

  - My boss is the type of person who likes to inundate others with projects.
  - As a teacher, you can expect to have a room full of students who will inundate you with questions.
  - The natural force of the hurricane will soon inundate the state with water.
  - Because of the poor economy, unemployed workers will more than likely inundate the government with requests for financial assistance.
  - Since James is very sensitive to odors, he will not spray any fragrance in his house that will inundate his sinuses.
  - I hope the excited fans will not inundate the shy celebrity when she walks into the theater.
  - If dogs and cats are not spayed and neutered, they can overpopulate and inundate the planet.



* [[https://wordsinasentence.com/invective-in-a-sentence/][Invective]]

  =abusive language used to criticize=

  - The newspaper’s invective of the novel really made the author angry.
  - Because your invective hurt my feelings, I am going to stay away from you for a while.
  -  The politician’s invective about his opponent caused him many votes in the election.
  - When my ex-husband tried to start a fight with me by using an invective, I simply walked away from him.
  - Words of encouragement are much better than the harsh words of an invective.
  - After the first speaker began the debate with an invective towards his opponent, it was impossible for any meaningful conversation to occur between the two men.
  - From across the room, my rival tried to taunt me with an invective.



* [[https://wordsinasentence.com/inveigh-in-a-sentence/][Inveigh]]

  =to criticize someone or something very strongly=

  - Because one politician chose to inveigh on the subject of immigration for an hour, the debate went on all afternoon.
  - No matter how angry I get, I will not inveigh my feelings using social media.
  - The entire purpose of the article was to inveigh on the topic of gun control.
  - Too often, bloggers inveigh on political topics when they know very little about politics.
  - There are not enough words for me to inveigh how angry I am right now!
  - During the trial, the prosecutor took every opportunity to inveigh his feelings about the defendant.
  - When approached by the reporter, it was not difficult at all for the victim’s mother to inveigh her thoughts on her daughter’s attacker.



* [[https://wordsinasentence.com/inveigle-in-a-sentence/][Inveigle]]

  =to persuade someone to do something by means of deception or flattery=

  - Speechless I stood by as June was able to inveigle her way into the private club by flirting with the security guard.
  - The detective could inveigle information out of the quietest suspects.
  - Although the salesman thought it would be easy for him to inveigle my grandmother into buying a vacuum she did not need, he soon realized my grandmother was not easily fooled.
  - Tracy had no problem showing off her feminine assets to inveigle her way backstage to meet her favorite singer.
  - During the trial, the witnesses described how the defendant used deception to inveigle his clients into investing in his scam.
  - My lazy brother is going to try and inveigle our mother into paying for his spring trip to the beach.
  - Although Karen is a lousy secretary, she is very attractive and recently received a pay raise because of her ability to inveigle her boss by constantly referring to his good looks.



