ruby/I.html



<div id="outline-container-orga1dd819" class="outline-2">
<h2 id="orga1dd819"><span class="section-number-2">154</span> <a href="https://wordsinasentence.com/intermission-in-a-sentence/">Intermission</a></h2>
<div class="outline-text-2" id="text-154">
<p>
<code>a scheduled break of about 10 to 15 minutes in the middle of a play, movie or concert</code>
</p>

<ul class="org-ul">
<li>The woman quickly consumed the candy and drink during the play’s intermission because she could not take it back in the theater.</li>
<li>When the movie came back on, we knew the intermission was over and we had to stop stretching our legs.</li>
<li>The small child’s mother couldn’t wait until the intermission since her son began to <b>squirm</b> in his seat after two hours of the play.</li>
<li>Lights in the theater flickered indicating that the intermission was over and the play would continue in a few minutes.</li>
</ul>
</div>
</div>



<div id="outline-container-org7f308ec" class="outline-2">
<h2 id="org7f308ec"><span class="section-number-2">155</span> <a href="https://wordsinasentence.com/intermittent-in-a-sentence/">Intermittent</a></h2>
<div class="outline-text-2" id="text-155">
<p>
<code>displaying in a random pattern; not consistent</code>
</p>

<ul class="org-ul">
<li>When the cops arrived, the loud intermittent noise had stopped.</li>
<li>The baby’s crying is intermittent and can occur at anytime.</li>
<li>Since the <b>power outages</b> are intermittent, I am not sure If you have enough time to cook your dinner.</li>
<li>The holiday lights are intermittent and flicker on and off constantly.</li>
<li>Because my spasms are intermittent and occur randomly, it is hard for the doctor to diagnose my condition.</li>
<li>The reason I broke up with my boyfriend was because of his intermittent verbal assaults that often happened without warning.</li>
<li>While Jeremy was ill, he had an intermittent fever that came and went for three days.</li>
</ul>
</div>
</div>



<div id="outline-container-org9a3e0e4" class="outline-2">
<h2 id="org9a3e0e4"><span class="section-number-2">156</span> <a href="https://wordsinasentence.com/interpose-in-a-sentence/">Interpose</a></h2>
<div class="outline-text-2" id="text-156">
<p>
<code>to involve oneself or to insert</code>
</p>

<ul class="org-ul">
<li>It can be dangerous to interpose yourself between a cat fight.</li>
<li>The mediator looked for the opening to interpose himself and break up the debate.</li>
<li>He hoped to interpose the container to keep both ingredients separate.</li>
<li>As if an afterthought, the senator decided to interpose an entirely new position in his platform.</li>
<li>If you interpose in a marital argument, be prepared to be yelled at by both parties.</li>
<li>Though he was not invited, he felt he should interpose his point of view.</li>
<li>The politician tried to interpose his unusual stance into the debate to <b>throw off</b> his opponents.</li>
</ul>
</div>
</div>



<div id="outline-container-org45e8836" class="outline-2">
<h2 id="org45e8836"><span class="section-number-2">157</span> <a href="https://wordsinasentence.com/interrogate-in-a-sentence/">Interrogate</a></h2>
<div class="outline-text-2" id="text-157">
<p>
<code>to question someone in a commanding manner</code>
</p>

<ul class="org-ul">
<li>If Jill brings a boy home, she knows her father is going to interrogate him by asking hundreds of questions.</li>
<li>The prosecutor will interrogate the defendant during the trial.</li>
<li>Because I came home late last night, I know my parents are going to interrogate me over breakfast.</li>
<li>Does the government have the right to interrogate suspected terrorists without their attorneys present?</li>
</ul>
</div>
</div>



<div id="outline-container-org9b6c3dd" class="outline-2">
<h2 id="org9b6c3dd"><span class="section-number-2">158</span> <a href="https://wordsinasentence.com/inundate-in-a-sentence/">Inundate</a></h2>
<div class="outline-text-2" id="text-158">
<p>
<code>overwhelm with things or people</code>
</p>

<ul class="org-ul">
<li>My boss is the type of person who likes to inundate others with projects.</li>
<li>As a teacher, you can expect to have a room full of students who will inundate you with questions.</li>
<li>The natural force of the hurricane will soon inundate the state with water.</li>
<li>Because of the poor economy, unemployed workers will more than likely inundate the government with requests for financial assistance.</li>
<li>Since James is very sensitive to odors, he will not spray any fragrance in his house that will inundate his sinuses.</li>
<li>I hope the excited fans will not inundate the shy celebrity when she walks into the theater.</li>
<li>If dogs and cats are not <b>spayed</b> and <b>neutered</b>, they can overpopulate and inundate the planet.</li>
</ul>
</div>
</div>



<div id="outline-container-org561e8b7" class="outline-2">
<h2 id="org561e8b7"><span class="section-number-2">159</span> <a href="https://wordsinasentence.com/invective-in-a-sentence/">Invective</a></h2>
<div class="outline-text-2" id="text-159">
<p>
<code>abusive language used to criticize</code>
</p>

<ul class="org-ul">
<li>The newspaper’s invective of the novel really made the author angry.</li>
<li>Because your invective hurt my feelings, I am going to stay away from you for a while.</li>
<li>The politician’s invective about his opponent caused him many votes in the election.</li>
<li>When my ex-husband tried to start a fight with me by using an invective, I simply walked away from him.</li>
<li>Words of encouragement are much better than the harsh words of an invective.</li>
<li>After the first speaker began the debate with an invective towards his opponent, it was impossible for any meaningful conversation to occur between the two men.</li>
<li>From across the room, my rival tried to taunt me with an invective.</li>
</ul>
</div>
</div>



<div id="outline-container-orgaea054b" class="outline-2">
<h2 id="orgaea054b"><span class="section-number-2">160</span> <a href="https://wordsinasentence.com/inveigh-in-a-sentence/">Inveigh</a></h2>
<div class="outline-text-2" id="text-160">
<p>
<code>to criticize someone or something very strongly</code>
</p>

<ul class="org-ul">
<li>Because one politician chose to inveigh on the subject of immigration for an hour, the debate went on all afternoon.</li>
<li>No matter how angry I get, I will not inveigh my feelings using social media.</li>
<li>The entire purpose of the article was to inveigh on the topic of gun control.</li>
<li>Too often, bloggers inveigh on political topics when they know very little about politics.</li>
<li>There are not enough words for me to inveigh how angry I am right now!</li>
<li>During the trial, the prosecutor took every opportunity to inveigh his feelings about the defendant.</li>
<li>When approached by the reporter, it was not difficult at all for the victim’s mother to inveigh her thoughts on her daughter’s attacker.</li>
</ul>
</div>
</div>



<div id="outline-container-orgecd0165" class="outline-2">
<h2 id="orgecd0165"><span class="section-number-2">161</span> <a href="https://wordsinasentence.com/inveigle-in-a-sentence/">Inveigle</a></h2>
<div class="outline-text-2" id="text-161">
<p>
<code>to persuade someone to do something by means of deception or flattery</code>
</p>

<ul class="org-ul">
<li>Speechless I stood by as June was able to inveigle her way into the private club by flirting with the security guard.</li>
<li>The detective could inveigle information out of the quietest suspects.</li>
<li>Although the salesman thought it would be easy for him to inveigle my grandmother into buying a vacuum she did not need, he soon realized my grandmother was not easily fooled.</li>
<li>Tracy had no problem showing off her feminine assets to inveigle her way backstage to meet her favorite singer.</li>
<li>During the trial, the witnesses described how the defendant used deception to inveigle his clients into investing in his scam.</li>
<li>My lazy brother is going to try and inveigle our mother into paying for his spring trip to the beach.</li>
<li>Although Karen is a lousy secretary, she is very attractive and recently received a pay raise because of her ability to inveigle her boss by constantly referring to his good looks.</li>
</ul>
</div>
</div>
