ruby/I.org
* [[https://wordsinasentence.com/inveterate-in-a-sentence/][Inveterate]]

  =have a particular interest or habit that is unlikely to change=

  - Because Janet was an inveterate traveler, it seemed as though she lived at the airport.
  - Mark is an inveterate liar who could not tell the truth even if you paid him.
  - Although Hank was an inveterate peacemaker, he did not function well in his job as a mediator.
  - Ginger is an inveterate reader who always has a book in her hands.
  - Since I am an inveterate skeptic, there is very little I will believe without proof.
  - The inveterate inventor has made millions of dollars by selling numerous product designs.
  - Although Mark is twenty-eight years old, he is an inveterate slacker who has no wish other than to watch wrestling on television.



* [[https://wordsinasentence.com/invidious-in-a-sentence/][Invidious]]

  =unpleasant and likely to cause bad feelings in other people=

  - The dictator’s invidious acts caused the people to rise up against him.
  - In Jeremy’s opinion, the death penalty is an invidious part of the legal system that should be considered a crime against humanity.
  - Nathan’s invidious behavior disturbed others and got him kicked out of the movie theater.
  - When Sally drinks alcohol, she starts to display invidious behavior that makes everyone feel uncomfortable.
  - Many people believe the habit of giving out trophies to only a few student competitors is invidious and likely to promote ill will between peers.
  - When you compare someone to a wild animal, you are making an invidious association that does not compliment the person.
  - The judge knew his decision to release the killer would be considered invidious by the victim’s family.



* [[https://wordsinasentence.com/invoke-in-a-sentence/][Invoke]]

  =to request aid, usually from a deity=

  - During the baptism, the priest will invoke a lifetime of blessings for the infant.
  - The celebrity will invoke assistance from the police to keep stalkers away from his property.
  - To defeat her opponents, the superhero had to invoke Mother Nature’s power to create a tornado.
  - The members of the tribe will invoke water from the gods by performing a rain dance.



* [[https://wordsinasentence.com/iota-in-a-sentence/][Iota]]

  =a tiny amount=

  - If there is even one iota of doubt, the jury should not find the defendant guilty.
  - My father says his love for my mother has not decreased one iota in their thirty years of marriage.
  - Although the suspect said he was out of town at the time of the murder, there was not one iota of proof to support his claim.
  - As a starving writer, all I need is for one publisher to have an iota of faith in my novel.



* [[https://wordsinasentence.com/ire-in-a-sentence/][Ire]]

  =hostility triggered by a grievance or insult=

  - My ire stems from the salesperson ignoring me while she talked on the telephone.
  - When the celebrity wore the fur coat on the red carpet, she drew the ire of many animal rights activists.
  - The victim’s spouse felt a great deal of ire towards the suspect.
  - If my neighbor continues to let his dog poop in my front yard, he is going to feel the full force of my ire when I toss the canine waste on his porch.




* [[https://wordsinasentence.com/irk-in-a-sentence/][Irk]]

  =annoy; irritate=

  - Harry likes to irk us with his irrelevant questions.
  - It must irk Fred when Anna starts complaining.
  - The baby’s nonstop crying began to irk me.
  - Bella’s car makes creaking noises that irk her.



* [[https://wordsinasentence.com/irksome-in-a-sentence/][Irksome]]

  =irritatingly bothersome=

  - Hank's fellow employees try to avoid him because of his irksome behavior.
  - To avoid the irksome security lines at the airport, Rick has applied for a screening pass that will allow him to reach his gate more quickly.
  - My irksome mother-in-law is constantly complaining about the way I clean my home.
  - Because Gina did not think of others, she could not imagine her neighbors would find her loud music irksome.
  - Even the offer of a bonus did not motivate any of the real estate agents to work with the irksome woman.
  - The police officer told the irksome beggar to stop bothering pedestrians.
  - On the plane, I sat next to a woman with an irksome toddler who whined throughout the six-hour flight.



* [[https://wordsinasentence.com/irremediable-in-a-sentence/][Irremediable]]

  =unable to be remedied, cured, corrected or repaired=

  - Bursting into tears, the young mother was appalled when she heard her baby had an irremediable disease which would cause severe pain for the rest of her life.
  - Once the spoiled girl reached her teenage years, the family knew it would be impossible to try to humble the irremediable girl.
  - With only two weeks until the end of the term, the college student decided to register again for the math class because he knew it was too late for his irremediable grade.
  - Since the home team was down 56 to 8, it was irremediable to try and stage a comeback now.



* [[https://wordsinasentence.com/itinerary-in-a-sentence/][Itinerary]]

  =a detailed schedule usually for a trip=

  - With his itinerary in hand, the tourist began his first day in Ireland by walking to each place on his list so he could see every attraction.
  - The teacher had to submit an itinerary for her field trip to Disneyworld listing every stop they would make at each hour of the day.
  - When the itinerary was given out daily to the passengers on the cruise, they could decide which activities they wanted to do and at which time the activities were being offered.
  - In order to be on time for their event, each Olympic athlete consulted their itinerary to determine the location and time for their event.







#+HTML: <a id="bottom"/>
#+HTML: <a href="#top">⇧</a>