ruby/I.html



<div id="outline-container-orgd63847c" class="outline-2">
<h2 id="orgd63847c"><span class="section-number-2">162</span> <a href="https://wordsinasentence.com/inveterate-in-a-sentence/">Inveterate</a></h2>
<div class="outline-text-2" id="text-162">
<p>
<code>have a particular interest or habit that is unlikely to change</code>
</p>

<ul class="org-ul">
<li>Because Janet was an inveterate traveler, it seemed as though she lived at the airport.</li>
<li>Mark is an inveterate liar who could not tell the truth even if you paid him.</li>
<li>Although Hank was an inveterate peacemaker, he did not function well in his job as a mediator.</li>
<li>Ginger is an inveterate reader who always has a book in her hands.</li>
<li>Since I am an inveterate skeptic, there is very little I will believe without proof.</li>
<li>The inveterate inventor has made millions of dollars by selling numerous product designs.</li>
<li>Although Mark is twenty-eight years old, he is an inveterate slacker who has no wish other than to watch wrestling on television.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdcc6942" class="outline-2">
<h2 id="orgdcc6942"><span class="section-number-2">163</span> <a href="https://wordsinasentence.com/invidious-in-a-sentence/">Invidious</a></h2>
<div class="outline-text-2" id="text-163">
<p>
<code>unpleasant and likely to cause bad feelings in other people</code>
</p>

<ul class="org-ul">
<li>The dictator’s invidious acts caused the people to rise up against him.</li>
<li>In Jeremy’s opinion, the death penalty is an invidious part of the legal system that should be considered a crime against humanity.</li>
<li>Nathan’s invidious behavior disturbed others and got him kicked out of the movie theater.</li>
<li>When Sally drinks alcohol, she starts to display invidious behavior that makes everyone feel uncomfortable.</li>
<li>Many people believe the habit of giving out trophies to only a few student competitors is invidious and likely to promote ill will between peers.</li>
<li>When you compare someone to a wild animal, you are making an invidious association that does not compliment the person.</li>
<li>The judge knew his decision to release the killer would be considered invidious by the victim’s family.</li>
</ul>
</div>
</div>



<div id="outline-container-orgb6e7bf0" class="outline-2">
<h2 id="orgb6e7bf0"><span class="section-number-2">164</span> <a href="https://wordsinasentence.com/invoke-in-a-sentence/">Invoke</a></h2>
<div class="outline-text-2" id="text-164">
<p>
<code>to request aid, usually from a deity</code>
</p>

<ul class="org-ul">
<li>During the baptism, the priest will invoke a lifetime of blessings for the infant.</li>
<li>The celebrity will invoke assistance from the police to keep stalkers away from his property.</li>
<li>To defeat her opponents, the superhero had to invoke Mother Nature’s power to create a tornado.</li>
<li>The members of the tribe will invoke water from the gods by performing a rain dance.</li>
</ul>
</div>
</div>



<div id="outline-container-org7eff85c" class="outline-2">
<h2 id="org7eff85c"><span class="section-number-2">165</span> <a href="https://wordsinasentence.com/iota-in-a-sentence/">Iota</a></h2>
<div class="outline-text-2" id="text-165">
<p>
<code>a tiny amount</code>
</p>

<ul class="org-ul">
<li>If there is even one iota of doubt, the jury should not find the defendant guilty.</li>
<li>My father says his love for my mother has not decreased one iota in their thirty years of marriage.</li>
<li>Although the suspect said he was out of town at the time of the murder, there was not one iota of proof to support his claim.</li>
<li>As a starving writer, all I need is for one publisher to have an iota of faith in my novel.</li>
</ul>
</div>
</div>



<div id="outline-container-orgdd14034" class="outline-2">
<h2 id="orgdd14034"><span class="section-number-2">166</span> <a href="https://wordsinasentence.com/ire-in-a-sentence/">Ire</a></h2>
<div class="outline-text-2" id="text-166">
<p>
<code>hostility triggered by a grievance or insult</code>
</p>

<ul class="org-ul">
<li>My ire stems from the salesperson ignoring me while she talked on the telephone.</li>
<li>When the celebrity wore the fur coat on the red carpet, she drew the ire of many animal rights activists.</li>
<li>The victim’s spouse felt a great deal of ire towards the suspect.</li>
<li>If my neighbor continues to let his dog poop in my front yard, he is going to feel the full force of my ire when I toss the canine waste on his porch.</li>
</ul>
</div>
</div>




<div id="outline-container-orgf68d44d" class="outline-2">
<h2 id="orgf68d44d"><span class="section-number-2">167</span> <a href="https://wordsinasentence.com/irk-in-a-sentence/">Irk</a></h2>
<div class="outline-text-2" id="text-167">
<p>
<code>annoy; irritate</code>
</p>

<ul class="org-ul">
<li>Harry likes to irk us with his irrelevant questions.</li>
<li>It must irk Fred when Anna starts complaining.</li>
<li>The baby’s nonstop crying began to irk me.</li>
<li>Bella’s car makes <b>creaking</b> noises that irk her.</li>
</ul>
</div>
</div>



<div id="outline-container-org7bb8cb9" class="outline-2">
<h2 id="org7bb8cb9"><span class="section-number-2">168</span> <a href="https://wordsinasentence.com/irksome-in-a-sentence/">Irksome</a></h2>
<div class="outline-text-2" id="text-168">
<p>
<code>irritatingly bothersome</code>
</p>

<ul class="org-ul">
<li>Hank's fellow employees try to avoid him because of his irksome behavior.</li>
<li>To avoid the irksome security lines at the airport, Rick has applied for a screening pass that will allow him to reach his gate more quickly.</li>
<li>My irksome mother-in-law is constantly complaining about the way I clean my home.</li>
<li>Because Gina did not think of others, she could not imagine her neighbors would find her loud music irksome.</li>
<li>Even the offer of a bonus did not motivate any of the real estate agents to work with the irksome woman.</li>
<li>The police officer told the irksome beggar to stop bothering pedestrians.</li>
<li>On the plane, I sat next to a woman with an irksome toddler who whined throughout the six-hour flight.</li>
</ul>
</div>
</div>



<div id="outline-container-orgfa48101" class="outline-2">
<h2 id="orgfa48101"><span class="section-number-2">169</span> <a href="https://wordsinasentence.com/irremediable-in-a-sentence/">Irremediable</a></h2>
<div class="outline-text-2" id="text-169">
<p>
<code>unable to be remedied, cured, corrected or repaired</code>
</p>

<ul class="org-ul">
<li>Bursting into tears, the young mother was appalled when she heard her baby had an irremediable disease which would cause severe pain for the rest of her life.</li>
<li>Once the spoiled girl reached her teenage years, the family knew it would be impossible to try to humble the irremediable girl.</li>
<li>With only two weeks until the end of the term, the college student decided to register again for the math class because he knew it was too late for his irremediable grade.</li>
<li>Since the home team was down 56 to 8, it was irremediable to try and stage a comeback now.</li>
</ul>
</div>
</div>



<div id="outline-container-org74c87aa" class="outline-2">
<h2 id="org74c87aa"><span class="section-number-2">170</span> <a href="https://wordsinasentence.com/itinerary-in-a-sentence/">Itinerary</a></h2>
<div class="outline-text-2" id="text-170">
<p>
<code>a detailed schedule usually for a trip</code>
</p>

<ul class="org-ul">
<li>With his itinerary in hand, the tourist began his first day in Ireland by walking to each place on his list so he could see every attraction.</li>
<li>The teacher had to submit an itinerary for her field trip to Disneyworld listing every stop they would make at each hour of the day.</li>
<li>When the itinerary was given out daily to the passengers on the cruise, they could decide which activities they wanted to do and at which time the activities were being offered.</li>
<li>In order to be on time for their event, each Olympic athlete consulted their itinerary to determine the location and time for their event.</li>
</ul>







<a id="bottom"/>
<a href="#top">⇧</a>
</div>
</div>
</div>
</body>
</html>